{"Title": "$\\mu$Œº-DDRL: A QoS-Aware Distributed Deep Reinforcement Learning Technique for Service Offloading in Fog Computing Environments", "Doi": "10.1109/TSC.2023.3332308", "Authors": ["m. goudarzi", "m. a. rodriguez", "m. sarvi", "r. buyya"], "Key Words": ["deep reinforcement learning (drl)", "fog/edge computing", "internet of things (iot)", "qos- aware service offloading"], "Abstract": "fog and edge computing extend cloud services to the proximity of end users allowing many internet of things  iot  use cases particularly latency critical applications. smart devices such as traffic and surveillance cameras often do not have sufficient resources to process computation intensive and latency critical services. hence the constituent parts of services can be offloaded to nearby edge fog resources for processing and storage. however making offloading decisions for complex services in highly stochastic and dynamic environments is an important yet difficult task. recently deep reinforcement learning  drl  has been used in many complex service offloading problems  however existing techniques are most suitable for centralized environments and their convergence to the best suitable solutions is slow. in addition constituent parts of services often have predefined data dependencies and quality of service constraints which further intensify the complexity of service offloading. to solve these issues we propose a distributed drl technique following the actor critic architecture based on asynchronous proximal policy optimization  appo  to achieve efficient and diverse distributed experience trajectory generation. also we employ ppo clipping and v trace techniques for off policy correction for faster convergence to the most suitable service offloading solutions. the results obtained demonstrate that our technique converges quickly offers high scalability and adaptability and outperforms its counterparts by improving the execution time of heterogeneous services.", "Pub Date": "2024-02-05"}