{"Title": "2pClPr: A Two-Phase Clump Profiler for Segmentation of Cancer Cells in Fluorescence Microscopic Images", "Authors": ["k. roy", "d. banik", "g. k. chan", "o. krejcar", "d. bhattacharjee"], "Pub Date": "2023-06-01", "Abstract": "cancer cell segmentation is challenging since they grow in tightly packed colonies  clumps  causing adjacent cells to overlap. in this work we proposed an automated vision based analysis framework  a two phase clump profiler  2pclpr  for the segmentation of cancer cells in fluorescence microscopy images. in the first phase we proposed a deep learning  dl  network multiscale cell net for coarse segmentation. another framework multiscale region proposal network  ms rpn  was simultaneously trained in parallel to multiscale cell net to generate seeds for each cell. the coarse segmentation map was unable to segment the complex clumps. we proposed a novel metric the irregularity factor   $i {\\text {ftr}}$   to identify those complex clumps. once identified we mapped them with the seed points generated by ms rpn. these seeds served as the initialization points for our proposed level set framework  weighing repelling force embedded level set method  wrfe lsm  which segments the identified complex clumps in the second phase of segmentation. the final segmentation map was generated with the segmented cells from the two phases. we conducted extensive experiments on our private dataset comprising images from four complex cancer cell lines and obtained an aggregated jaccard index  aji  of 76.6% 72.9% 75.5% and 69.7% on hela mda mb 468 mda mb 231 and t 47d respectively. furthermore to show the generalization ability of 2pclpr we conducted comparative experiments on a publicly available hematoxylin‚äìeosin  h&e  stained histopathological images dataset  monuseg  and obtained an aji of 66.2%. a detailed evaluation of segmentation performance on both the datasets shows that 2pclpr is robust and effective.", "Doi": "10.1109/TIM.2023.3277975", "Key Words": ["cancer cells", "deep learning (dl)", "fluorescence imaging", "level-set method", "mitotic catastrophe", "segmentation"]}