{"Title": "3-D Visualization for Lung Covid-19 Infection Based on U-Net CNN Segmentation", "Authors": ["f. x. ferdinandus", "j. santoso", "e. i. setiawan", "e. m. yuniarno", "i. k. e. purnama", "m. h. purnomo"], "Pub Date": "2023-06-21", "Abstract": "covid 19 is still the attention of researchers in medical image analysis. following the initial respiratory diagnosis a ct scan examination will be performed. segmentation of infection within the lung area is needed as the next step after the examination. in recent years image segmentation has been carried out with the help of deep learning. u net convolutional neural network  cnn  is one of the deep learning based architectures widely used in medical image segmentation. our research aims to support radiologists in visualizing covid 19 infection in 3 d based on cnns u net segmentation. it results in two types of visualization  3 d bitmap and 3 d mesh. 3 d visualization can contribute to seeing the extent of infection and calculating the predicted percentage of covid 19 infection volume in the patient‚äôs lungs. the dataset for training model cnn is relatively small consisting of 20 ct scans of zenodo‚äôs covid 19 patients divided into 17 patients 2808 images  80%  for training and three patients 712 images  20%  for testing. the segmentation evaluation metrics used are dice precision and accuracy while the evaluation metrics for 3 d volume are relative volume difference  rvd  and volumetric similarity  vs . finally the prediction of the percentage of infection volume to the patient‚äôs lung volume is given. the evaluation results were satisfactory obtaining 95% dice scores for lung image segmentation and 75% for infection segmentation. the predicted 3 d visualization volume also scored higher than 90% for both lung volume and infection. furthermore for calculating the prediction of infection volume against lung volume we achieved a maximum difference of 3% from the ground truth value.", "Doi": "10.1109/TIM.2023.3280491", "Key Words": ["3-d-visualization", "computer-tomography", "covid-19", "deep learning", "semantic segmentation", "u-net"]}