{"Title": "3DSRNet: 3-D Spine Reconstruction Network Using 2-D Orthogonal X-Ray Images Based on Deep Learning", "Authors": ["y. gao", "h. tang", "r. ge", "j. liu", "x. chen", "y. xi", "x. ji", "h. shu", "j. zhu", "g. coatrieux", "j. -l. coatrieux", "y. chen"], "Pub Date": "2023-09-04", "Abstract": "orthopedic spine disease is one of the most common diseases in the clinic. the diagnosis of spinal orthopedic injury is an important basis for the treatment of spinal orthopedic diseases. due to the complexity of the spine structure doctors usually need to rely on orthopedic computed tomography  ct  image data for accurate diagnosis. in some cases such as poor areas or in emergency situations it is difficult for doctors to make accurate diagnoses using only 2 d x ray images due to lack of 3 d imaging equipment or time crunch. therefore an approach based on 2 d x ray images is needed to solve this problem. in this article a novel 3 d spine reconstruction technique based on 2 d orthogonal x ray images  3dsrnet  is designed. 3dsrnet uses a generative adversarial network  gan  architecture and novel modules to make 3 d spine reconstruction more accurate and efficient. spine reconstruction convolutional neural network  cnn  transformer framework  srct  is employed to effectively integrate local bone surface information and long range relation spinal structure information. spine reconstruction texture framework  srte  is used to extract spine texture features to enhance the effect of pixel level reconstruction. experiments show that 3dsrnet achieves excellent 3 d spine reconstruction results on multiple metrics including peak signal to noise ratio  psnr   45.4666 db  structural similarity index  ssim   0.8850  cosine similarity  cs   0.7662  mean absolute error  mae   23.6696  mean squared error  mse   9016.1044  and learned perceptual image patch similarity  lpips   0.0768 .", "Doi": "10.1109/TIM.2023.3296838", "Key Words": ["3-d reconstruction", "computed tomography (ct)", "deep learning", "spine", "x-ray"]}