{"Title": "50 GHz Operation of RSFQ Arithmetic Logic Unit Designed Using the Advanced Design Flow and the Dual RSFQ/ERSFQ Cell Library", "Authors": ["a. inamdar", "s. s. meher", "b. chonigman", "a. sahu", "j. ravi", "d. gupta"], "Pub Date": "2023-02-13", "Abstract": "arithmetic logic unit  alu  is an integral part of digital signal processing applications and computing systems. we used alu based on kogge stone adder as a reference circuit to experimentally validate the advanced design flow and the dual rsfq ersfq standard cell library. using the advanced design flow the alu sub blocks were optimized across multiple process corners using monte carlo simulations incorporating statistical variations in the process parameters. the correct operation of alu was verified in the digital hdl simulation using static timing analysis pre fabrication. we designed the rsfq 1 bit and 4 bit alu using the standard cell library approach for mit ll 100 ¬µa/¬µm2 sfq5ee fab node. for the ersfq 1 bit alu the bias current overhead for the feeding jtls was designed to be 100% of the ersfq dut bias current. the rsfq 1 bit alu designed for low frequency functional testing demonstrated greater than ¬±15% bias margins. we demonstrated successful operation of the rsfq 4 bit alu with greater than ¬±6% bias margins at 20 ghz greater than ¬±5% bias margins at 40 ghz and greater than ¬±4% bias margins at 50 ghz clock frequency with ber less than 10‚àí12. the ersfq 1 bit alu worked up to 30.72 ghz clock frequency with ber less than 10‚àí12. in addition we analyzed the model to hardware correlation for the init sub block of the alu. the simulations accounted for critical current density  jc  and sheet resistance  rs  process parameters. we noted the discrepancy in simulated and measured margins and studied that a 15% higher jc in simulations results in better model to hardware correlation for the init sub block.", "Doi": "10.1109/TASC.2023.3240679", "Key Words": ["arithmetic logic unit", "bit error rate", "cryogenic electronics", "cell library", "digital integrated circuits", "electronic design automation", "ersfq", "rsfq", "supertools", "supercon ducting logic circuits", "superconducting integrated circuits", "very high speed integrated circuits", "very large scale integration"]}