{"Title": "5G on the Roads: Latency-Optimized Federated Analytics in the Vehicular Edge", "Doi": "10.1109/ACCESS.2023.3301330", "Authors": ["l. toka", "m. konrad", "i. pelle", "b. sonkoly", "m. szab√≥", "b. sharma", "s. kumar", "m. annavazzala", "s. t. deekshitula", "a. a. franklin"], "Key Words": ["edge platform", "end-to-end latency", "federated analysis", "vehicular communication"], "Abstract": "coordination among vehicular actors becomes increasingly important at the dawn of autonomous driving. with communication serving as the basis for this process latency emerges as a critical limiting factor in information gathering processing and redistribution. while these processes have further implications on data privacy they are also fundamental in safety and efficiency aspects. in this work we target exactly these areas  we propose a privacy preserving system for collecting and sharing data in high mobility automotive environments that aims to minimize the latency of these processes. namely we focus on keeping high definition maps  highly accurate environmental and road maps with dynamic information  up to date in a crowd sourced fashion. we employ federated analytics for privacy preserving low latency scalable processing and data distribution running over a two tiered infrastructural layout consisting of mobile vehicular nodes and static nodes leveraging the low latency high throughput and broadcast capabilities of the 5g edge. we take advantage of this setup by proposing queuing theory based analytical models and optimizations to minimize information delivery latency. as our numerical simulations over wide parameter ranges indicate the latency of timely data distribution can be decreased only with careful system planning and 5g infrastructure. we obtain the optimal latency characteristics in densely populated central metropolitan scenarios when gb s uplink speeds are achievable and the coverage area  map segment size  can reach a diameter of 1km.", "Pub Date": "2023-08-10"}