{"Title": "A 334 ŒºW 0.158 mm2 ASIC for Post-Quantum Key-Encapsulation Mechanism Saber With Low-Latency Striding Toom‚ÄìCook Multiplication", "Authors": ["a. ghosh", "j. m. b. mera", "a. karmakar", "d. das", "s. ghosh", "i. verbauwhede", "s. sen"], "Pub Date": "2023-07-24", "Abstract": "lattice based cryptography is a novel approach to public key cryptography  pkc  of which the mathematical investigation  so far  resists attacks from quantum computers. by choosing a module learning with errors  mlwe  algorithm as the next standard the national institute of standards and technology  nist  follows this approach. the multiplication of polynomials is the central bottleneck in the computation of lattice based cryptography. because pkc is mostly used to establish common secret keys the focus is on compact area power and energy budget and to a lesser extent on throughput or latency. while most other work focuses on optimizing number theoretic transform  ntt  based multiplications in this article we highly optimize a toom‚äìcook based multiplier. we demonstrate that a memory efficient striding toom‚äìcook with lazy interpolation results in a highly compact low power implementation which on top enables a very regular memory access scheme. to demonstrate the efficiency we integrate this multiplier into a saber post quantum accelerator one of the four nist finalists. algorithmic innovation to reduce active memory timely clock gating and shift add multiplier has helped to achieve 38% less power than state of the art post quantum cryptography  pqc  core 4 $\\times $  less memory 36.8% reduction in multiplier energy and 118 $\\times $  reduction in active power with respect to state of the art saber accelerator  not silicon verified . this accelerator consumes 0.158  $\\text {mm}^{2}$  active area which is the lowest reported to date despite the process disadvantages of the state of the art designs.", "Doi": "10.1109/JSSC.2023.3253425", "Key Words": ["compact design", "energy-efficient architecture", "first accelerator", "lazy interpolation", "memory-efficient", "post-quantum cryptography (pqc)", "striding toom‚äìcook"]}