{"Title": "A Bibliometric Analysis of Technology in Digital Health: Exploring Health Metaverse and Visualizing Emerging Healthcare Management Trends", "Authors": ["h. -s. nguyen", "m. voznak"], "Pub Date": "2024-02-16", "Abstract": "the digital economy has engendered health metaverse an innovative technology with vast potential to transform healthcare through immersive experiences. the health metaverse serves as a convergence point for a multitude of technologies including artificial intelligence  artificial intelliegence  virtual reality in heath augmented reality in health internet connected medical devices quantum computing and more. this convergence opens up possibilities for advancing quality healthcare. therefore reviewing recent influential literature is critical to understand current methods and envision future improvements. this study utilizes a hybrid bibliometric structured methodology combining descriptive and bibliometric network analysis. to gather information we conducted searches on the web of science database and reviewed references. our inclusion criteria focused on articles and reviews published between january 2012 and june 2023. we used keyword groups for our searches. then performed bibliometric analysis followed by content analysis. papers were reviewed analyzed and categorized into focuses on multimodal medical information standards medical social data fusion telemedicine online health management and medical artificial intelliegence. this bibliometric analysis of 34 thousand publications over 10 years proposes medical and health informatics in the metaverse. five future research direction clusters were identified. it delineates intelligent solutions bridging healthcare barriers. in conclusion this review examines the metaverse in healthcare explores cutting edge technologies applications projects and highlights areas where adaptation may be needed. it identifies adaptation issues and suggests solutions warranting further research.", "Doi": "10.1109/ACCESS.2024.3363165", "Key Words": ["health metaverse", "healthcare technology", "health informatics", "quality of care", "digital health", "data analysis", "bibliometric analysis"]}