{"Title": "A Blockchain-Assisted Intelligent Edge Cooperation System for IoT Environments With Multi-Infrastructure Providers", "Doi": "10.1109/JIOT.2023.3282954", "Authors": ["x. du", "x. chen", "z. lu", "q. duan", "y. wang", "j. wu", "p. c. k. hung"], "Key Words": ["blockchain-assisted system security", "cooperative edge computing (cec)", "hyperledger fabric", "intelligent edge cooperation system"], "Abstract": "while edge computing has the potential to offer low latency services and overcome the limitations of traditional cloud computing it presents new challenges in terms of trust security and privacy  tsp  in internet of things environments. cooperative edge computing  cec  has emerged as a solution to address these challenges through resource sharing among edge nodes. however for multi infrastructure providers incentive and trust mechanisms among edge nodes are crucial technical issues that must be addressed alongside system latency and reliability to meet performance requirements. in this article we propose a blockchain assisted intelligent edge cooperation system  biecs  to systematically solve these issues. by leveraging blockchain technology we construct trust among edge nodes and employ an incentive mechanism for resource sharing among multi infrastructure providers. we formulate the system performance optimization as a multiobjective joint optimization problem and solve it efficiently through a two stage strategy for selecting edge nodes. we first design an improved long short term memory  lstm  model for resource prediction and then select edge nodes for executing offloaded tasks and handling the corresponding blockchain process related to each task execution. to evaluate the performance of biecs we implement the system based on hyperledger fabric and design extensive experiments. our proposed system achieves better performance in terms of system delay throughput and resource utilization compared to state of the art schemes for edge cooperation.", "Pub Date": "2023-12-11"}