{"Title": "A Blockchain System for QoS Monitoring in Decentralized Edge Computing", "Doi": "10.1109/TSC.2023.3345634", "Authors": ["p. wang", "h. li", "h. fu", "z. sun", "j. chen", "x. du"], "Key Words": ["qos monitoring", "edge computing", "blockchain", "probabilistic threshold query"], "Abstract": "in edge computing applications are usually delivered as services each of which runs independently and cooperates to construct complicated applications. qos  quality of service  monitoring is an important way to detect and locate faulty services. in a decentralized environment qos monitoring will face trust problem because it is difficult to guarantee the trustworthiness of monitoring results. this article builds a blockchain system for qos monitoring. however there are two challenges. first although the blockchain consensus ensures the consistency of on chain data among nodes there is no guarantee that the monitoring data collected in the decentralized environment are authentic because malicious nodes may report falsified data. second in order to handle service faults in time the real time query is usually required for obtaining monitoring data. but blockchains suffer from inefficient querying because the sequential data storage of blockchain is designed for write intensive applications at the expense of some read performance. to address these challenges this article proposes a clustering based algorithm for validating the authenticity of monitoring data collected in the decentralized environment and proposes a probabilistic threshold query over blockchain which supports efficient querying and guarantees the probability that the query results are correct is not less than a given threshold. this article implements the proposed blockchain system based on the blockchain platform hyperledger fabric and the edge computing platform kubeedge. the experiment results demonstrate the proposed blockchain system provides high throughput and low latency monitoring ability and can efficiently obtain monitoring results close to real qos data.", "Pub Date": "2024-02-05"}