{"Title": "A Caching-Based Dual K-Anonymous Location Privacy-Preserving Scheme for Edge Computing", "Doi": "10.1109/JIOT.2023.3235707", "Authors": ["s. zhang", "b. hu", "w. liang", "k. -c. li", "b. b. gupta"], "Key Words": ["caching", "dual k-anonymity", "edge computing", "k-anonymity", "location privacy", "location-based services"], "Abstract": "location based services have become prevalent and the risk of location privacy leakage increases. most existing schemes use third party based or third party free system architectures  the former suffers from a single point of failure  spof  and the latter experiences a heavy load on user terminal equipment and higher communication costs. ensuring location privacy while lowering system overhead becomes a challenge. many existing schemes fail to leverage the responses from an lbs server  such responses can be cached to answer subsequent queries. as a result providing users with a relatively comprehensive level of location privacy protection is troublesome. in this article we propose a caching based dual  ${k}$  anonymous  cdka  location privacy preserving scheme in edge computing environments. our scheme employs an edge server to intercedes between a user and lbs the server. we reduce the load on the user device by applying multilevel caching and to protect location privacy through dual anonymity. to ensure the location privacy in our construction we set mobile clients and edge servers as anonymous. we use caching to lower the communication overhead and enforce the location privacy. the security analysis of our scheme supports its robustness against the edge server and the lbs server privacy offenses. we rely on the computation time the communication cost and the cache hit ratio to evaluate our work against existing constructions. the results are twofold  our work possesses a better response rate down to 15‚äì32.6 ms and exhibits lower communication cost requirements down to 6.2‚äì38.9 kb compared to existing works. our scheme witnesses a higher cache hit ratio of up to 13.6% and 39.1% compared to the literature.", "Pub Date": "2023-05-17"}