{"Title": "A Comparative Analysis of Deadlock Avoidance and Prevention Algorithms for Resource Provisioning in Intelligent Autonomous Transport Systems Over 6G Infrastructure", "Doi": "10.1109/TITS.2022.3169424", "Authors": ["e. e. ugwuanyi", "m. iqbal", "t. dagiuklas"], "Key Words": ["intelligent autonomous transport systems", "collaborative edge", "mec", "deadlock", "real-time algorithms", "banker‚äôs algorithm"], "Abstract": "6g is the future of intelligent connectivity artefacts with artificial intelligence  ai  at its backbone. the multi access edge computing  mec  based 6g enabled infrastructure helps in achieving the required zero latency for autonomous intelligent transport systems  its  with features of low power consumption lower end to end latency minimal processing transmission overheads higher throughput and reliability. mec are prone to a deadlock due to the limited amount of available computational resources resulting in fatal delays in vehicle to vehicle  v2v  vehicles to road side unit  rsu  and rsu to its communication. the unresolved deadlock may entail higher energy consumption that can adversely affect the quality of service  qos  in terms of safety and reliability with potential threats of causing fatal accidents. therefore it is almost imperative to resolve the deadlocks from mec to comply with the qos parameters of mec based autonomous vehicles. the asserted goals can be achieved by employing an intelligent and adaptive deadlock resolution strategy. in this paper a deadlock aware and collaborative edge decision algorithm has been proposed for facilitating the seamless communication of autonomous vehicles over mec. additionally deadlock avoidance and prevention schemes have been evaluated using bankers resource request avoidance algorithm wound wait algorithm and wait die algorithms for resource provisioning in collaborative mec. furthermore the effectiveness of deadlock avoidance and prevention algorithms in real time scenarios has been analyzed in mec systems. the metrics used for a comparative analysis in this research include round trip time queue wait time and cpu utilization. the proposed algorithm shows promising results when compared with prevalent techniques.", "Pub Date": "2023-07-07"}