{"Title": "A Comprehensive Physical Layer Security Mechanism for Mobile Edge Computing", "Doi": "10.1109/JIOT.2023.3272113", "Authors": ["y. chen", "k. zhao", "h. zhang", "s. he"], "Key Words": ["contract theory", "device-to-device (d2d)", "eaves28dropping attacks", "friendly jamming (fj)", "incentive mechanism", "29 mobile edge computing (mec)", "nonorthogonal multiple access30 (noma)", "physical-layer security (pls)"], "Abstract": "mobile edge computing  mec  is becoming popular in many civilian applications. however due to the broadcast nature of wireless connections traditional mec is open to eavesdropping attacks that endanger mobile users‚äô information confidentiality. friendly jamming  fj  as one of the physical layer security  pls  techniques can efficiently protect users from such threats by degrading attackers‚äô wiretap channel capacities. in this article we propose an fj based pls mechanism to safeguard the confidentiality of data uploading in mec services. we design a comprehensive security scheme that uses fj from both base station  bs  and nearby mobile users to cover upload transmission. accordingly the eavesdropping risk zone  erz  is formulated as an area under high secrecy outage probability  sop . to promote fj from users we further introduce device to device  d2d  communication based fj which is inspired by nonorthogonal multiple access  noma  techniques. then we formulate simplify and solve the problem by optimizing the mec secrecy performance under the required risk with efficiencies in data uploading energy consumption and incentive delivery. furthermore we tackle the challenge of efficient incentive design under information asymmetry by introducing contract theory and providing differentiated rewards. by simulations we evaluate the mechanism in terms of secrecy performance and incentive efficiency under information asymmetry and the results accordingly show the effectiveness of the proposed security mechanism.", "Pub Date": "2023-09-22"}