{"Title": "A Contract-Theory-Based Incentive Mechanism for UAV-Enabled VR-Based Services in 5G and Beyond", "Doi": "10.1109/JIOT.2023.3268320", "Authors": ["t. nguyen dang", "a. manzoor", "y. k. tun", "s. m. a. kazmi", "z. han", "c. s. hong"], "Key Words": ["augmented reality (ar)", "computational caching", "contract theory", "virtual reality (vr)"], "Abstract": "the proliferation of novel infotainment services such as virtual reality  vr  based services has fundamentally changed the existing mobile networks. these bandwidth hungry services expanded at a tremendously rapid pace thus generating a burden of data traffic in the mobile networks. to cope with this issue one can use multiaccess edge computing  mec  to bring the resource to the edge. by doing so we can release the burden of the core network by taking the communication computation and caching resources nearby the end users  ues . nevertheless due to the vast adoption of vr enabled devices mec resources might be insufficient in peak times or dense settings. to overcome these challenges we propose a system model where the service provider  sp  might rent unmanned area vehicles  uavs  from uav sps  usps  to serve as micro base stations  ubss  that expand the service area and improve the spectrum efficiency. in which uav can precached certain sets of vr based contents and serve ues via air to ground  a2g  communication. furthermore future intelligent devices are capable of 5g and b5g communication interfaces and thus they can communicate with uavs via a2g links. by doing so we can significantly reduce a considerable amount of data traffic in mobile networks. in order to successfully enable such kinds of services an attractive incentive mechanism is required. therefore we propose a contract theory based incentive mechanism for uav assisted mec in vr based infotainment services in which the mec offers an amount reward to a uav for serving as a ubs in a specific location for certain time slots. we then derive an optimal contract based scheme with individual rationality and incentive compatibility conditions. the numerical findings show that our proposed approach outperforms the linear pricing  lp  technique and is close to the optimal solution in terms of social welfare. additionally our proposed scheme significantly enhanced the fairness of utility for uavs in asymmetric information problems.", "Pub Date": "2023-09-06"}