{"Title": "A Data-Centric Approach for Portuguese Speech Recognition: Language Model And Its Implications", "Doi": "10.1109/TLA.2023.10128886", "Authors": ["j. p. r. alvarenga", "l. h. d. c. merschmann", "e. j. d. s. luz"], "Key Words": ["automatic speech recognition", "language model", "brazilian portuguese", "wav2vec2", "kenlm"], "Abstract": "recent advances in automatic speech recognition have made it possible to achieve a quality never seen before in the literature both for languages with abundant data such as english which has a large number of studies and for the portuguese language which has a more limited amount of resources and studies. the most recent advances address speech recognition problems with transformers based models which have the capability to perform the speech recognition task directly from the raw signal without the need for manual feature extraction. some studies have already shown that it is possible to further improve the quality of the transcription of these models using language models within the decoding stage however the real impact of such language models is still not clear especially for the brazilian portuguese scenario. also it is known that the quality of the data used for training the models is of paramount importance however there are few works in the literature addressing this issue. this work explores the impact of language models applied to portuguese speech recognition both in terms of data quality and computational performance with a data centric approach. we propose an approach to measure similarity between datasets and thus assist in decision making during training. the approach indicates paths for the advancement of the state of the art aiming at portuguese speech recognition showing that it is possible to reduce the size of the language model by 80% and still achieve error rates around 7.17% for the common voice dataset. the source code is available at https //github.com joaoalvarenga/language model evaluation.", "Pub Date": "2023-05-17"}