{"Title": "A Deep Reinforcement Learning-Based Offloading Scheme for Multi-Access Edge Computing-Supported eXtended Reality Systems", "Doi": "10.1109/TVT.2022.3207692", "Authors": ["b. trinh", "g. -m. muntean"], "Key Words": ["deep reinforcement learning", "energy efficiency", "extended reality", "multi-access edge computing", "offloading", "quality of service"], "Abstract": "in recent years extended reality  xr  applications have been widely employed in various scenarios e.g. health care education manufacturing etc. such application are now easily accessible via mobile phones tablets or wearable devices. however such devices normally suffer from constraints in terms of battery capacity and processing power limiting the range of applications supported or lowering quality of experience. one effective way to address these issues is to offload the computation tasks to the edge servers that are deployed at the network edges e.g. base stations or wifi access point etc. this communication fashion also named as multi access edge computing  mec  is proposed to overcome the limitations in terms of long latency due to long propagation distance of traditional cloud computing approach. xr devices that are limited in computation resources and energy can then benefit from offloading the computation intensive tasks to mec servers. however as xr applications are comprised of multiple tasks with variety of requirements in terms of latency and energy consumption it is important to make decision whether one task should be offloaded to mec server or not. this paper proposes a deep reinforcement learning based offloading scheme for xr devices  drlxr . the proposed scheme is used to train and derive the close to optimal offloading decision whereas optimizing a utility function optimization equation that considers both energy consumption and execution delay at xr devices. the simulation results show how our proposed scheme outperforms the other counterparts in terms of total execution latency and energy consumption.", "Pub Date": "2023-01-13"}