{"Title": "A Deep-Reinforcement-Learning-Based Computation Offloading With Mobile Vehicles in Vehicular Edge Computing", "Doi": "10.1109/JIOT.2023.3264281", "Authors": ["j. lin", "s. huang", "h. zhang", "x. yang", "p. zhao"], "Key Words": ["computation offloading", "deep-reinforcement-learning", "mobile edge servers (mess)", "vehicle-to-vehicle (v2v) communications", "vehicular edge networks"], "Abstract": "vehicular edge networks involve edge servers that are close to mobile devices to provide extra computation resource to complete the computation tasks of mobile devices with low latency and high reliability. considerable efforts on computation offloading in vehicular edge networks have been developed to reduce the energy consumption and computation latency in which roadside units  rsus  are usually considered as the fixed edge servers  fess . nonetheless the computation offloading with considering mobile vehicles as mobile edge servers  mess  in vehicular edge networks still needs to be further investigated. to this end in this article we propose a deep reinforcement learning based computation offloading with mobile vehicles in vehicular edge computing namely deep reinforcement learning based computation offloading scheme  drl comv  in which some vehicles  such as autonomous vehicle  are deployed and considered as the mess that move in vehicular edge networks and cooperate with fess to provide extra computation resource for mobile devices in order to assist in completing the computation tasks of these mobile devices with great quality of experience  qoe   i.e. low latency  for mobile devices. particularly the computation offloading model with considering both mobile and fess is conducted to achieve the computation tasks offloading through vehicle to vehicle  v2v  communications and a collaborative route planning is considered for these mess to move in vehicular edge networks with objective of improving efficiency of computation offloading. then a deep reinforcement learning approach with designing rational reward function is proposed to determine the effective computation offloading strategies for multiple mobile devices and multiple edge servers with objective of maximizing both qoe  i.e. low latency  for mobile devices. through performance evaluations our results show that our proposed drl comv scheme can achieve a great convergence and stability. additionally our results also demonstrate that our drl comv scheme also can achieve better both qoe and task offloading requests hit ratio for mobile devices in comparison with existing approaches  i.e. ddpg imopsoq and gabdos .", "Pub Date": "2023-08-23"}