{"Title": "A Decentralized Resource Allocation in Edge Computing for Secure IoT Environments", "Doi": "10.1109/ACCESS.2023.3325056", "Authors": ["a. sasikumar", "l. ravi", "m. devarajan", "s. vairavasundaram", "a. selvalakshmi", "k. kotecha", "a. abraham"], "Key Words": ["internet of things", "blockchain", "edge computing", "resource allocation", "proof-of-importance (poi)"], "Abstract": "the expansion of internet of things  iot  devices and their integration into a variety of vital sectors has created serious concerns regarding data protection privacy and resource management. as a promising model edge computing has the ability to overcome these difficulties by putting the computing power closer to iot devices. this article presents a novel approach for decentralized resource allocation in edge computing settings with the goal of improving the security and efficiency of iot systems. edge nodes are critical in our proposed framework for managing and assigning computing resources to iot devices minimizing latency and optimizing network traffic. the decentralization of resource distribution promotes resilience in the event of network outages or cyberattacks and provides robustness against single points of failure. we created a proof of importance  poi  consensus mechanism for creating new blocks in the blockchain integrated edge computing iot devices. therefore the consensus mechanism will ensure the trust and security of iot devices by authentication of each user in the network. we performed a series of experiments in a simulated edge computing setting to assess the feasibility of our proposed method. we analyze the proposed system model based on the operation of three different file delivery and transactions. the simulation outcomes show that the blockchain system efficiently delivers the files and increases the transmission rate. we also compared our file delivery and transmission rate with existing techniques and our proposed model provides a better result. finally we compared the power consumption of creating iot nodes based on proof of work  pow  proof of stake  pos  and poi. the proposed poi consensus mechanism consumes less power than the other two methods.", "Pub Date": "2023-10-26"}