{"Title": "A Deep Quantum Convolutional Neural Network Based Facial Expression Recognition For Mental Health Analysis", "Authors": ["s. hossain", "s. umer", "r. k. rout", "h. a. marzouqi"], "Pub Date": "2024-04-12", "Abstract": "the purpose of this work is to analyze how new technologies can enhance clinical practice while also examining the physical traits of emotional expressiveness of face expression in a number of psychiatric illnesses. hence in this work an automatic facial expression recognition system has been proposed that analyzes static sequential or video facial images from medical healthcare data to detect emotions in people‚äôs facial regions. the proposed method has been implemented in five steps. the first step is image preprocessing where a facial region of interest has been segmented from the input image. the second component includes a classical deep feature representation and the quantum part that involves successive sets of quantum convolutional layers followed by random quantum variational circuits for feature learning. here the proposed system has attained a faster training approach using the proposed quantum convolutional neural network approach that takes  $\\mathbb {o}{ }\\text {log}{ }{n}{ }{ }$  time. in contrast the classical convolutional neural network models have  $\\mathbb {o}{ }{n}^{{2}}{ }$  time. additionally some performance improvement techniques such as image augmentation fine tuning matrix normalization and transfer learning methods have been applied to the recognition system. finally the scores due to classical and quantum deep learning models are fused to improve the performance of the proposed method. extensive experimentation with karolinska directed emotional faces  kdef  static facial expressions in the wild  sfew 2.0  and facial expression recognition 2013  fer 2013  benchmark databases and compared with other state of the art methods that show the improvement of the proposed system.", "Doi": "10.1109/TNSRE.2024.3385336", "Key Words": ["facial expression", "recognition", "quantum", "convolutional neural network", "quanvolutional", "quantum variational circuit", "mental health conditions"]}