{"Title": "A Differential Voltage Amplifier Scheme for Enhanced Sensitivity and SNR for Remote Piezopolymer-Based Sensor Systems", "Authors": ["b. c", "s. vijayakumar"], "Pub Date": "2023-12-27", "Abstract": "in this article an efficient differential voltage amplifier scheme for interfacing piezoelectric sensors that is insensitive to cable parasitic capacitance and immune to common mode interference  cmi  is presented. the scheme is beneficial for improving the sensitivity and signal to noise ratio  snr  performance of high piezoelectric voltage constant  piezopolymer  piezo sensor based applications involving long cables between the piezo sensor and electronics. in many piezo sensor applications operating in harsh environments the piezo sensor and electronics need to be separated using long cables. the cable introduces signal loading the triboelectric effect and the picking up of external interference resulting in poor sensitivity and snr performance. piezopolymer based sensors [e.g. polyvinylidene fluoride  pvdf ] have high voltage sensitivity compared to charge sensitivity which results in improved sensitivity performance if a voltage amplifier is used instead of a charge amplifier for interfacing these sensors. hence an enhanced differential voltage amplifier scheme insensitive to cable parasitic capacitance and immune to triboelectric effect and cmi is presented in this article. the proposed scheme has been simulated using ltspice and a prototype has been implemented. the performance has been evaluated in the presence of cable parasitic capacitance and common mode interference. the experimental result shows that the sensitivity is improved by 4.55 db in comparison with a normal differential amplifier when a 5 m dual core cable is used to connect a piezo sensor  airmar at200 . the proposed differential scheme improved the rejection of cmi by 18 db compared with the single ended configuration of the scheme.", "Doi": "10.1109/TIM.2023.3334334", "Key Words": ["cable parasitic", "charge amplifier", "common mode interference (cmi)", "differential voltage amplifier", "piezoelectric charge constant", "piezoelectric sensor", "piezoelectric voltage constant", "piezopolymer", "polyvinylidene fluoride (pvdf) sensor", "sensitivity"]}