{"Title": "A Differentially Private Federated Learning Model Against Poisoning Attacks in Edge Computing", "Doi": "10.1109/TDSC.2022.3168556", "Authors": ["j. zhou", "n. wu", "y. wang", "s. gu", "z. cao", "x. dong", "k. -k. r. choo"], "Key Words": ["differential privacy", "edge computing", "federated learning", "high-practicability", "poisoning attack"], "Abstract": "federated learning is increasingly popular as it allows us to circumvent challenges due to data islands  e.g. challenges in getting access to raw datasets particularly when data are owned by multiple data owners  by training a global model using data from one or more data owners / sources. however in an edge computing deployment one cannot assume that resource constrained end devices are sufficiently secure. in other words we have to consider the possibility of these devices being compromised and can be abused to facilitate poisoning attacks. privacy preserving is another important property to consider when dealing with sensitive user data on end devices. most existing approaches only consider either defending against poisoning attacks or supporting privacy but not both properties simultaneously. in this paper we propose a differentially private federated learning model against poisoning attacks designed for edge computing deployment. first we design a weight based algorithm to perform anomaly detection on the parameters uploaded by end devices in edge nodes which improves detection rate using only small size validation datasets and minimizes the communication cost. then differential privacy technology is leveraged to protect the privacy of both data and model in an edge computing setting. we also evaluate the detection performance in the presence of random and customized malicious end devices and compare its performance with those of two other competing approaches published in ieee transactions on dependable and secure computing in terms of attack resiliency and communication and computation costs. experimental results demonstrate that our scheme can achieve an optimal tradeoff between security efficiency and accuracy.", "Pub Date": "2023-05-16"}