{"Title": "A Digital Twin-Assisted Intelligent Partial Offloading Approach for Vehicular Edge Computing", "Doi": "10.1109/JSAC.2023.3310062", "Authors": ["l. zhao", "z. zhao", "e. zhang", "a. hawbani", "a. y. al-dubai", "z. tan", "a. hussain"], "Key Words": ["mobile edge computing", "vehicle edge computing", "digital twin network", "deep reinforcement learning", "task offloading"], "Abstract": "vehicle edge computing  vec  is a promising paradigm that exposes mobile edge computing  mec  to road scenarios. in vec task offloading can enable vehicles to offload the computing tasks to nearby roadside units  rsus  that deploy computing capabilities. however the highly dynamic network topology strict low delay constraints and massive data of tasks of vec pose significant challenges for implementing efficient offloading. digital twin based vec is emerging as a promising solution that enables real time monitoring of the state of the vec network through mapping and interaction between the physical and virtual worlds thus assisting in making sound offload decisions in the physical world. thus this paper proposes an intelligent partial offloading scheme namely digital twin assisted intelligent partial offloading  ignite . first to find the optimal offloading space in advance we combine the improved clustering algorithm with the digital twin  dt  technique in which unreasonable decisions can be avoided by reducing the size of the decision space. second to reduce the overall cost of the system deep reinforcement learning  drl  algorithm is employed to train the offloading strategy allowing for automatic optimization of computational delay and vehicle service price. to improve the efficiency of cooperation between digital and physical spaces a feedback mechanism is established. it can adjust the parameters of the clustering algorithm based on the final offloading results in this clustering. to the best of our knowledge this is the first study on dt assisted vehicle offloading that proposes a feedback mechanism forming a complete closed loop as prediction offloading feedback. extensive experiments demonstrate that ignite has significant advantages in terms of total system computational cost total computational delay and offloading success rate compared with its counterparts.", "Pub Date": "2023-10-26"}