{"Title": "A Distributed Resource Sharing Mechanism in Edge-Enabled IIoT Systems", "Doi": "10.1109/JIOT.2023.3342321", "Authors": ["h. liu", "s. li", "w. li", "w. sun"], "Key Words": ["alternating direction method of multiplier (admm)", "distributed resource sharing", "edge computing", "industrial internet of things (iiot)", "soft-defined network (sdn)", "social welfare maximization"], "Abstract": "the industrial internet of things  iiot  has revolutionized industrial processes by facilitating the seamless connectivity and communication of devices and systems within industrial environments. as a critical component edge computing provides the flexible data sensing and real time processing services which facilitates a comprehensive enhancement for iiot systems. however due to the tremendous increase in iiot devices and the limited resources of edge servers ensuring efficient resource sharing while prioritizing the benefits of both parties would be the driving force in edge enabled iiot systems. in this work we propose a distributed resource sharing mechanism in edge enabled iiot systems. the objective of proposed mechanism is maximizing social welfare which optimizes the utility of iiot device and cost of edge server simultaneously. in particular we integrate the soft defined network  sdn  technique into the threelayer iiot framework to support agile resource management and formulate the resource sharing optimization models in multiple scenarios. furthermore we design the distributed alternating direction method of multipliers  admms  algorithms which appropriately decompose the primal problem into multiple subproblems for iiot devices and edge servers and explore their interactive relationships of resource requesting and sharing using the characteristic of admm. finally extensive performance evaluations are conducted under multiple iiot scenarios to manifest the effectiveness and reliability of proposed distributed mechanism in terms of convergence rate social welfare and fault tolerance.", "Pub Date": "2024-04-09"}