{"Title": "A Drone-Assisted Deep Learning-Based IoT System for Monitoring Ship Emissions in Ports Considering Adversarial Attacks", "Authors": ["m. elsisi", "j. -t. yu", "c. -c. lai", "c. -l. su"], "Pub Date": "2024-03-21", "Abstract": "monitoring ship emissions poses an intricate interdisciplinary challenge encompassing atmospheric science transportation information communication and computer technology. key stakeholders in this effort include maritime institutions and shipping companies. however effectively organizing information from ship emission monitoring especially for policy implementation in the expansion of emission control areas  ecas  faces substantial obstacles in data acquisition transmission analysis and information services. to address these challenges this study suggests an internet of things  iot  paradigm using drones and deep learning for ship emission monitoring in the port areas integrating vital technologies such as industrial contact elements for the iot assisted processing of ship emission real time data monitoring and online processing and tailored information services for port control center. in addition the suggested iot paradigm considers adversarial and false data injection  fdi  assaults which impair the effectiveness of data processing and identification techniques. by actively supporting green port trends and maritime law enforcement this new iot paradigm is developing into the framework of the berth area inside the physical infrastructure. furthermore this model highlights the possibility for a more widespread adoption of ship pollution monitoring while simultaneously demonstrating the model‚äôs efficacy in the current setting. a more expansive version of the suggested iot paradigm might function as a strong cyber physical infrastructure supporting the capacity for thorough ship emission monitoring and enabling in depth study on ship emissions.", "Doi": "10.1109/TIM.2024.3374306", "Key Words": ["adversarial attacks", "cybersecurity", "deep learning", "internet of things (iot)", "ship emission"]}