{"Title": "A Feature Memory Rearrangement Network for Visual Inspection of Textured Surface Defects Toward Edge Intelligent Manufacturing", "Doi": "10.1109/TASE.2022.3204368", "Authors": ["h. yao", "w. yu", "x. wang"], "Key Words": ["visual inspection", "feature memory rearrangement", "robust background reconstruction", "multiphase training", "multimodal strategy", "multilevel detection", "edge intelligence", "smart manufacturing"], "Abstract": "recent advances in the industrial inspection of textured surfaces‚äîin the form of visual inspection‚äîhave made such inspections possible for efficient flexible manufacturing systems. however establishing a unified manual feature based inspection model for homogeneous and nonregularly textured surfaces presents an enormous challenge. furthermore in real industrial scenarios collecting and labeling sufficient defective samples is impracticable due to the scarcity of defects and the endless variety of defect types thus limiting the performance of supervised deep learning methods. to address these challenges we propose an unsupervised feature memory rearrangement network  fmr net  to accurately detect various textural defects simultaneously. consistent with mainstream methods we adopt the idea of background reconstruction  however we innovatively utilize artificial synthetic defects to enable the model to recognize anomalies while traditional wisdom relies only on defect free samples. first we employ an encoding module to obtain multiscale features of the textured surface. subsequently a contrastive learning based memory feature module  cmfm  is proposed to obtain discriminative representations and construct a normal feature memory bank in the latent space which can be employed as a substitute for defects and fast anomaly scores at the patch level. next a novel global feature rearrangement module  gfrm  is proposed to further suppress the reconstruction of residual defects. finally a decoding module utilizes the restored features to reconstruct the normal texture background. in addition to improve inspection performance a two phase training strategy is utilized for accurate defect restoration refinement and we exploit a multimodal inspection method to achieve noise robust defect localization. we verify our method through extensive experiments and test its practical deployment in collaborative edge‚äìcloud intelligent manufacturing scenarios by means of a multilevel detection method demonstrating that fmr net exhibits state of the art inspection accuracy and shows great potential for use in edge computing enabled smart industries. note to practitioners‚äîmost conventional visual inspection methods rely on supervised training and consequently require a large amount of labeled data and can detect only specific types of texture defects. in contrast the proposed fmr net is a robust model for the simultaneous and accurate inspection of textured surfaces for various defects that does not require any real labeled defect samples. furthermore this model can also support a different fine grained detection method that is very suitable in the edge computing paradigm. these two characteristics are both extremely important for practical industrial applications. to the best of our knowledge this is the first unsupervised edge intelligent vision inspection framework. as such it can provide inspiration and serve as a reference for intelligent industry.", "Pub Date": "2023-10-05"}