{"Title": "A Feasibility Study on Indoor Localization and Multiperson Tracking Using Sparsely Distributed Camera Network With Edge Computing", "Doi": "10.1109/JISPIN.2023.3337189", "Authors": ["h. kwon", "c. hegde", "y. kiarashi", "v. s. k. madala", "r. singh", "a. nakum", "r. tweedy", "l. m. tonetto", "c. m. zimring", "m. doiron", "a. d. rodriguez", "a. i. levey", "g. d. clifford"], "Key Words": ["body orientation estimation", "cloud computing", "computer vision", "edge computing", "indoor localization", "multiperson tracking"], "Abstract": "camera based activity monitoring systems are becoming an attractive solution for smart building applications with the advances in computer vision and edge computing technologies. in this article we present a feasibility study and systematic analysis of a camera based indoor localization and multiperson tracking system implemented on edge computing devices within a large indoor space. to this end we deployed an end to end edge computing pipeline that utilizes multiple cameras to achieve localization body orientation estimation and tracking of multiple individuals within a large therapeutic space spanning $\\text{1700}\\ \\text{m}^{2}$ all while maintaining a strong focus on preserving privacy. our pipeline consists of 39 edge computing camera systems equipped with tensor processing units  tpus  placed in the indoor space ceiling. to ensure the privacy of individuals a real time multiperson pose estimation algorithm runs on the tpu of the computing camera system. this algorithm extracts poses and bounding boxes which are utilized for indoor localization body orientation estimation and multiperson tracking. our pipeline demonstrated an average localization error of 1.41 m a multiple object tracking accuracy score of 88.6% and a mean absolute body orientation error of 29$^{\\circ }$. these results show that localization and tracking of individuals in a large indoor space is feasible even with the privacy constrains.", "Pub Date": "2023-12-20"}