{"Title": "A Full Dive Into Realizing the Edge-Enabled Metaverse: Visions, Enabling Technologies, and Challenges", "Doi": "10.1109/COMST.2022.3221119", "Authors": ["m. xu", "w. c. ng", "w. y. b. lim", "j. kang", "z. xiong", "d. niyato", "q. yang", "x. shen", "c. miao"], "Key Words": ["metaverse", "edge networks", "communication and networking", "computation", "blockchain", "internet technology"], "Abstract": "dubbed ‚äúthe successor to the mobile internet‚äù the concept of the metaverse has grown in popularity. while there exist lite versions of the metaverse today they are still far from realizing the full vision of an immersive embodied and interoperable metaverse. without addressing the issues of implementation from the communication and networking as well as computation perspectives the metaverse is difficult to succeed the internet especially in terms of its accessibility to billions of users today. in this survey we focus on the edge enabled metaverse to realize its ultimate vision. we first provide readers with a succinct tutorial of the metaverse an introduction to the architecture as well as current developments. to enable ubiquitous seamless and embodied access to the metaverse we discuss the communication and networking challenges and survey cutting edge solutions and concepts that leverage next generation communication systems for users to immerse as and interact with embodied avatars in the metaverse. moreover given the high computation costs required e.g. to render 3d virtual worlds and run data hungry artificial intelligence driven avatars we discuss the computation challenges and cloud edge end computation framework driven solutions to realize the metaverse on resource constrained edge devices. next we explore how blockchain technologies can aid in the interoperable development of the metaverse not just in terms of empowering the economic circulation of virtual user generated content but also to manage physical edge resources in a decentralized transparent and immutable manner. finally we discuss the future research directions towards realizing the true vision of the edge enabled metaverse.", "Pub Date": "2023-02-23"}