{"Title": "A Game-Based Incentive-Driven Offloading Framework for Dispersed Computing", "Doi": "10.1109/TCOMM.2023.3266833", "Authors": ["h. wu", "j. nie", "z. xiong", "z. cai", "t. zhou", "c. yuen", "d. niyato"], "Key Words": ["incentive-driven", "iot", "mobile computing", "task offloading", "network computation points", "idle resources", "stackelberg game"], "Abstract": "the popularization of smart internet of things  iot  devices has facilitated the development of fog edge computing. however these infrastructure based service paradigms may fail to complete tasks successfully due to computation and communication overload or damage in challenging scenarios such as disasters or traffic jams. noticing that a crowd of devices with considerable idle resources could be available we investigate the problems of addressing the computation and communication unavailability with peer assistance in this work. to this end we propose a dispersed service framework for resource exhausted scenarios that adaptively offloads users‚äô data to available network computation points. however the users may not be able to achieve the offloading due to geographical hindrances. consequently the relay is introduced as a bridge for data offloading between the users and the network computation points. furthermore a game based incentive driven offloading mechanism is designed by analyzing and balancing the cost and gain factors of three main entities  users relays and network computation points . considering the interactions among the entities a two level stackelberg game is established for efficiently allocating potential computation resource as well as balancing the utility conflicts due to the data offloading. given the hierarchical interaction structure the upper level game involves network computation points as followers and the relay as a leader while the lower level game includes the relay as a follower and users as leaders. moreover to facilitate applicability in large scale scenarios with multiple relays we decompose multiple relays into multiple single relay problems using a tripartite matching strategy that assigns appropriate relays to users and network computation points. the simulation results demonstrate the effectiveness of the proposed game based incentive driven mechanism and show that it outperforms the baselines in terms of the overall utilities of the involved entities and the average energy consumption of users.", "Pub Date": "2023-07-14"}