{"Title": "A Game-Theoretic Incentive Mechanism for Battery Saving in Full Duplex Mobile Edge Computing Systems With Wireless Power Transfer", "Doi": "10.1109/TNSM.2023.3246506", "Authors": ["y. cheng", "h. zhao", "y. ni", "w. xia", "l. yang", "h. zhu"], "Key Words": ["mobile edge computing", "battery saving", "wireless power transfer", "full duplex", "stackelberg game"], "Abstract": "mobile edge computing  mec  is a promising paradigm to handle the mismatch between computation intensive applications and resource limited devices. nevertheless as most internet of things  iot  terminals are battery limited the computation gain of mec may be compromised due to insufficient battery energy for task offloading. wireless power transfer  wpt  and full duplex  fd  communications are economical charging and transmission methods for battery limited iot terminals. however when integrating wireless power transfer and fd into mec the incentive problem should be jointly addressed with task offloading because the wpt facilities and their powered iot nodes belong to different service operators. in this paper we investigate the efficiency of wpt from the perspective of battery saving and propose an efficient wireless powered task offloading and incentive mechanism in fd mec enabled cellular iot networks. the battery saving efficiency which addresses both the total cost of wpt and saved energy of battery is proposed as the performance metric. by adopting this metric as the utility function of the network operator  no  the task offloading and incentive problem are jointly formulated as a stackelberg game. we then propose an efficient alternating direction iteration based algorithm to solve its equilibrium efficiently. simulation results demonstrate the benefits of our algorithm in battery saving by comparisons with utility oriented benchmarks. moreover it reveals the tradeoff between the utility of no and battery saving which verifies the positive effects of fd communications and wpt in improving the efficiency of battery saving.", "Pub Date": "2023-10-09"}