{"Title": "A High-Speed FPGA-Based Hardware Implementation for Leighton-Micali Signature", "Authors": ["y. song", "x. hu", "j. tian", "z. wang"], "Pub Date": "2023-01-24", "Abstract": "due to the rapid progress made in quantum computers modern cryptography faces great challenges. many digital signature schemes that have resistance to quantum computing are studied and standardized by several influential international organizations. the leighton micali signature  lms  protocol one of the hash based signature schemes is standardized by both the internet engineering task force  ietf  and the national institute of standards and technology  nist  due to its well studied security and relatively small signature size. however the heavy computation load and high latency of lms limits its practical applications. in this paper for the first time we propose a full hardware implementation of lms to accelerate all the three stages   $key~generation$   $signature~generation$  and  $verification$ . considering the scalability requirement and the characteristic of the parameter sets of lms we extract the coarse grained basic logic a hash group and build a reconfigurable architecture for all available parameters by carefully designing the parallelism degree while achieving low latency and high hardware utilization efficiency. then we devise a fusion architecture for  $key~generation$  and  $signature~generation$  based on the hash group module. moreover for the  $signature~verification$  stage we propose a separate architecture by applying the hash group module along with an efficient depth first merkle tree module. we code our designs with verilog language in parameterized style and implement them on a xilinx xcvu7p fpga platform. the experimental results show that significant improvements are obtained for different parameter sets by the proposed designs when compared to state of the art works.", "Doi": "10.1109/TCSI.2022.3210016", "Key Words": ["post-quantum cryptography (pqc)", "hash-based signature", "leighton-micali signature", "high-speed", "hardware", "fpga"]}