{"Title": "A Hybrid Scheduling Framework for Mixed Real-Time Tasks in an Automotive System With Vehicular Network", "Doi": "10.1109/TCC.2022.3194713", "Authors": ["b. hu", "y. shi", "z. cao", "m. zhou"], "Key Words": ["schedule optimization", "real-time performance", "automotive tasks", "vehicular network"], "Abstract": "as vehicles integrate more and more autonomous driving functionalities it becomes more and more important to use vehicular networks to fully guarantee the safety and real time performance of on board computing tasks. current studies on vehicular networks pay much attention to the performance improvement of network communication and resource allocation while ignoring the fact that automotive on board computing tasks play a significant role in vehicle safety and need to be elegantly handled in vehicular networks. in this article we propose a hybrid scheduling framework for meeting all hard real time task deadlines while minimizing soft real time task deadline misses. in particular the proposed scheduler is composed of some local schedulers and a global scheduler where the former guarantees the schedulability of all hard real time tasks and the latter decides the assignment of soft real time jobs dynamically online. depending on the remaining processing capability of a vehicular network arrival jobs are either assigned for further processing or discarded. an approach combining the utilization based schedulability test and demand supply analysis is proposed to effectively assign tasks to processors offline. to meet as many soft real time task deadlines as possible tasks‚äô demand and supply bounds are computed at runtime such that online execution information can be used to compensate for the scheduling loss with the worst case assumption made by the offline test. experimental results demonstrate that compared to a genetic algorithm our proposed approach needs far less computation to assign more tasks offline. the online scheduling also saves many soft real time jobs that were to be dropped by the offline algorithm.", "Pub Date": "2023-09-05"}