{"Title": "A Hybrid Optimized Intelligent Resource-Constrained Service Scheduling for Unified IoT Applications in Smart Cities", "Doi": "10.1109/TNSM.2023.3341296", "Authors": ["k. h. k. reddy", "g. srivastava", "r. s. goswami", "d. s. roy"], "Key Words": ["unified iot applications", "intelligence", "optimization", "resource management", "context awareness", "service delay"], "Abstract": "as the internet of things  iot  continues to advance as a technology it has given rise to innovative and cross domain iot applications particularly in smart cities. for iot applications and services that are sensitive to latency and due resource constraints it affects the quality of service  qos . to address these challenges context aware fog computing at the network edge requires an enhanced focus on optimizing resources for intelligent service management. due to the dynamic change of workload at fog nodes i.e. sudden rise in demand an effective load balancing approach among fog nodes becomes essential. however it‚äôs crucial to execute load transfers such as virtual machine  vm  migrations but improper migration can lead to a cascade of migrations and ultimately degrade system performance. in this paper we introduce a resource optimized intelligent service model  roism  designed to facilitate resource optimization through a forecasting technique. this technique predicts the requisite context instances and resource computation needed for efficient service delivery. the proposed hybrid approach to service management leverages context sharing context migration and live service migration strategies all based on the forecast method. this method utilizes both current and predicted resource utilization data as well as context availability to fulfil service requests within the specified latency requirements for cross domain iot applications. to validate the effectiveness of our proposed service management algorithms we conducted simulations using a cloudsim simulator. the results obtained from these simulations confirm the superiority of our proposed methods", "Pub Date": "2024-04-15"}