{"Title": "A Knowledge-Enhanced Medical Named Entity Recognition Method that Integrates Pre-Trained Language Models", "Doi": "10.1109/MedAI59581.2023.00046", "Authors": ["z. wang", "q. zhou", "z. junfeng", "y. wang", "h. ding", "j. song"], "Key Words": ["large language model", "named-entity recognition", "large model finetuning", "knowledge enhancement"], "Abstract": "medical named entity recognition  ner  is a critical task in medical text processing. but medical documents exhibit high variability in terms of language usage abbreviations synonyms misspellings and typographical errors so the precise extraction of named entities is challenging. although large language models  large language model  have shown good performance in medical knowledge extraction tasks in few shot settings their performance is difficult to fully leverage in supervised medical named entity recognition  ner  tasks. this is because ner is a sequence labeling task while large language model are more suitable for tasks such as text generation. furthermore the structured output of ner tasks leads to a performance loss when large language model convert it into generative text. therefore it is a challenging problem to utilize large language model to improve the accuracy of medical named entity recognition tasks. on this paper we propose a method that integrates large language model knowledge to enhance the performance of medical ner models. firstly we improve the structure of the large language model model to make it more adaptable to ner tasks. secondly we adopt the lora method and incorporate chinese vocabulary information into the model training. finally to fully utilize the fine tuned large language model to enhance the medical ner model we convert the output of the large language model into a knowledge concentration matrix and inject it into the ner model. we have verify the effectiveness of our new method on the cmeee dataset. the results demonstrate that our method can efficiently fine tune the large language model and improve its performance. moreover our method can also leverage the prior knowledge of the fine tuned large language model to enhance the bert based medical ner model. in addition our method demonstrates good generalization and can tackle entity recognition tasks in other domains. we validated the superiority of our approach on the resume zh dataset.", "Pub Date": "2024-01-31"}