{"Title": "A Lightweight Gear Fault Diagnosis Method Based on Attention Mechanism and Multilayer Fusion Network", "Authors": ["m. wang", "y. yang", "l. wei", "y. li"], "Pub Date": "2023-12-22", "Abstract": "gear fault diagnosis is an important part of rotating machinery maintenance. most state of the art research methods in the field of gear fault diagnosis combine deep learning methods with multisensor data fusion big data analysis and physical models to achieve more accurate fault diagnosis techniques  however there are still some shortcomings in the method of gear fault diagnosis based on deep network models. first the impact of noise on model diagnostics is rarely considered and second there is a conflict between a large number of parameters and calculations of deep networks and the computing resources of current embedded platforms. to address these issues this article proposes a multilayer fusion convolutional neural network  amfcnn  and a multilayer fusion module relational knowledge distillation  mfm rkd  module based on an attention mechanism. the multilayer fusion network uses an inception module to extract multiscale features from multisensor information and adopts an attention mechanism to extract features from the network in different periods. the mfm rkd module activates the extracted features of different periods through a fully connected layer and transfers structural knowledge to a lightweight student network through rkd to build a lightweight multisensor gear fault diagnosis model. experiments show that the lightweight model has excellent robustness in different noise environments. compared with the teacher network the model performance is reduced by less than 2% while the calculations of the model are reduced by 92 times and the running memory is reduced by 7.74 times which provides an efficient solution to address the robustness and model deployment issues in gear fault diagnosis.", "Doi": "10.1109/TIM.2023.3330231", "Key Words": ["gear fault diagnosis", "knowledge distillation (kd)", "lightweight model", "noise impact"]}