{"Title": "A Memetic Algorithm for Cooperative Complex Task Offloading in Heterogeneous Vehicular Networks", "Doi": "10.1109/TNSE.2022.3206228", "Authors": ["h. ren", "k. liu", "g. yan", "y. li", "c. zhan", "s. guo"], "Key Words": ["cooperative offloading", "complex task", "memetic computing", "online scheduling", "vehicular network"], "Abstract": "with the booming of intelligent connected vehicles as well as the emergence of edge computing paradigm complex task offloading becomes a critical yet promising issue in vehicular networks to enable various real time and scalable future intelligent systems. this article makes the first effort on proposing an end edge cloud cooperation architecture together with a tailored memetic algorithm for complex task offloading in heterogeneous vehicular networks. specifically we consider the scenario where a complex task consists of multiple subtasks which require different amount of resources for being processed and a task is completed only when all of its subtasks have been processed. then we formulate a cooperative complex task offloading  ccto  problem by considering heterogeneous computation communication and memory capacities of nodes in vehicular networks as well as task dependency and mobility of vehicles targeting at minimizing average service delay of the system. we prove that ccto is np hard by constructing a polynomial time reduction from the parallel machines scheduling problem  pmsp . further we propose a memetic computing based algorithm named mdma  meme dependency aware memetic algorithm  which consists of a meme dependency based encoding solution a mix strategy for initialization a dedicated offspring generation scheme a meme recombined strategy for local search and a task feature driven method for repairing infeasible solutions. finally we build a simulation model and give a comprehensive performance evaluation. the results demonstrate the superiority of mdma on minimizing the service delay by best exploiting heterogeneous resources in vehicular networks.", "Pub Date": "2023-01-06"}