{"Title": "A Mobile Edge Computing Framework for Traffic Optimization at Urban Intersections Through Cyber-Physical Integration", "Doi": "10.1109/TIV.2023.3332256", "Authors": ["h. xu", "j. yuan", "a. berres", "y. shao", "c. wang", "w. li", "t. j. laclair", "j. sanyal", "h. wang"], "Key Words": ["mobile edge computing", "urban traffic optimization", "vehicle-to-infrastructure", "cyber-physical system"], "Abstract": "the stop and go traffic pattern at urban intersections leads to excessive energy use due to frequent vehicle braking idling and acceleration. this pattern amplified by the growing use of automobiles adversely affects city sustainability causing delays pollution and increased carbon emissions. addressing this we introduce a mobile edge computing framework utilizing internet of things  iot  and edge computing. this framework incorporates real time vehicle to infrastructure communication and intelligent speed control algorithms into a mobile app targeting speed optimization at signalized intersections to alleviate the negative impacts of stop and go traffic at urban intersections. the framework comprises three components  a cyberinfrastructure based messaging system for real time traffic and signal data from iot connected signal controllers and traffic sensors  a speed optimization algorithm generating speed advisories using phone based sensor data  like gps and driving directions  signal phase and timing information and roadside vehicle detector data  and an ad hoc mobile computing environment turning smartphones into edge devices for hosting the algorithm. this enables intelligent speed advisory along signalized corridors. the paper presents the detailed design and implementation of the proposed framework highlighting its practicality utility and energy saving potential. our studies including traffic simulations real vehicle lab experiments evaluation surveys and field tests demonstrate its robustness and effectiveness. specifically simulations indicate that using the mobile app universally could lead to a 24% energy reduction in urban transportation systems.", "Pub Date": "2024-02-22"}