{"Title": "A Modified Aeromagnetic Compensation Method Robust to the Motion State of Aviation Platform Part", "Authors": ["c. zhang", "c. du", "x. peng", "h. guo"], "Pub Date": "2023-06-14", "Abstract": "aeromagnetic compensation is a signal processing method to suppress the magnetic interference from the airborne platform that far exceeds the target magnetic signal. with the development of measurement technology the traditional aeromagnetic compensation model in which the motion platform is considered as a rigidly connected whole cannot satisfy the request for high quality aeromagnetic detection and the magnetic interference generated by the small relative motion components needs to draw our attention. in this article the source of maneuver magnetic interference on the aircraft platform is split into two parts that is the rigidly connected main body part  mbp  and moving part  mp  and their compensation models can be both built by referring to the tolles‚äìlawson  tl  model. the key factor in these two models is how to obtain the direction cosine that describes the maneuvering actions of aircraft. in the mbp compensation model the direction cosine can be directly obtained by the onboard fluxgate magnetometer. however those in the mp model cannot be directly obtained because there is no monitoring equipment for it. therefore a scheme for calculating the direction cosine of the mp compensation model is proposed. this scheme combines the direction cosine obtained by the onboard fluxgate magnetometer with the relative motion angles. and considering the influence of geomagnetic gradient magnetic interference its compensation model is brought to form a new aeromagnetic compensation model herein called the tlgm model. this model is different from the traditional tl model and is nonlinear since the three unknown relative motion angles so the quantum genetic algorithm  qga  is introduced to combine with recursive least squares  rls  to estimate those unknowns. some field experiments were conducted and the results show that the proposed method reduces the standard deviations  stds  and figures of merit  foms  by over 42% and 39% respectively compared with those using the previous model. also the proposed compensation method requires no additional motion monitoring sensors and is more convenient for practical applications.", "Doi": "10.1109/JSEN.2023.3269057", "Key Words": ["aeromagnetic compensation", "direction cosine", "geomagnetic field", "quantum genetic algorithm (qga)"]}