{"Title": "A Multi-Market Trading Framework for Low-Latency Service Provision at the Edge of Networks", "Doi": "10.1109/TSC.2021.3132792", "Authors": ["y. -y. shih", "a. -c. pang", "t. he", "t. -c. chiu"], "Key Words": ["double auction", "edge computing", "multi-market", "fictitious play"], "Abstract": "along with the ultra reliable and low latency communications  urllc  of 5g edge computing enables many potential low latency iot applications and has recently gained widespread attention. addressing edge computing‚äôs economic issues is critical as we need to motivate edge devices as resource providers to devote their computing resources to the service. there are multiple users and resource providers in most edge computing service scenarios. the communication delays between users and providers are not the same since their physical distances are different. however most existing works on edge computing regarding network economics adopt single market models that do not consider the influence of communication delay. some researchers advocate using multi market models to overcome this issue by grouping users who connect to the same access point or base station and letting each host its auction for resource trading. however due to the high cost of deploying 5g ultra dense small cells barely a network operator can reach full network coverage. users cannot rely on a single network but these models do not allow resource trading between different groups. thus this article proposes a novel multi market trading  mmt  framework to address these shortcomings. the framework combines the double auction at each group and a market selection game to enable the resource providers to participate in multiple auctions and analyze their choice of markets. we present the framework‚äôs detailed design and propose a theory based learning algorithm to approximate each provider‚äôs optimal strategies. through extensive simulations using real world datasets of vehicular networks we show that the proposed framework can improve the social welfare by $14.45\\%$14.45% and $36.74\\%$36.74% respectively compared with classic multi market and single market models.", "Pub Date": "2023-02-06"}