{"Title": "A Multihop Task Offloading Decision Model in MEC-Enabled Internet of Vehicles", "Doi": "10.1109/JIOT.2022.3143529", "Authors": ["c. chen", "y. zeng", "h. li", "y. liu", "s. wan"], "Key Words": ["bat algorithm", "internet of vehicles (iov)", "mobile-edge computing (mec)"], "Abstract": "as a new network technology mobile edge computing  mec  combined with the internet of vehicles  iov  can effectively improve the efficiency of task computing and offloading. however the power of edge computing will be severely limited to the areas with poor mec server coverage. furthermore there are a number of peripheral vehicles with temporarily idle computing resources on the road so how to put the resources of these vehicles into use becomes the primary issue to be considered. in this article a distributed multihop task offloading decision model for task execution efficiency is developed which mainly consists of two parts  1  a candidate vehicle selection mechanism for screening the neighboring vehicles that can participate in offloading and 2  a task offloading decision algorithm for obtaining the task offloading solution. considering the impact of different hop and wireless communication ranges on communication ranges on task completion in a generic scenario we introduce the hop count  $k$  and select the neighboring vehicles in the  $k$  hop wireless communication range as the candidate vehicles. then the problem of offloading is modeled as a generalized allocation model with constraints which is solved by the greedy algorithm and discrete bat algorithm respectively. the results show that compared with the scheme in which the task vehicle randomly selects the neighboring vehicles to offload and the scheme that all tasks are completed locally the offloading scheme in which all tasks are completed under the greedy algorithm or bat based algorithm has advantages in time delay performance in terms of different task number task required computation power and task size environment. besides this article also explores the influence of hop count  $k$  on the results when selecting candidate vehicles from the neighboring vehicles within the range of  $k$  hop. the results show that the increase of  $k$  will also increase the number of candidate vehicles which makes the time delay lower. under the parameters set in this article the time delay required for the greedy algorithm offloading scheme to complete all tasks is a lower bound on the time delay of the bat algorithm scheme. the greedy algorithm scheme reduces latency by 0.2‚äì2.4 s compared to the scheme where tasks are all completed locally and it reduces latency by 0.16‚äì2.3 s compared to the random offloading scheme.", "Pub Date": "2023-02-06"}