{"Title": "A Multienergy Computed Tomography Method Based on a Blind Decomposition Model for Multivoltage X-Ray Transmission Images", "Authors": ["j. wei", "z. wang", "p. chen"], "Pub Date": "2023-03-22", "Abstract": "multienergy computed tomography  ct  can be implemented based on traditional ct systems to reduce the hardware cost. however prior knowledge of the x ray spectra or material composition and multiple scans are required in most such implementation methods which imposes an extra burden. to avoid this a method based on a blind decomposition model of multivoltage x ray transmission images is proposed in this article. the model considers x ray scattering as an important factor resulting in errors of theoretical and measured polychromatic x ray transmission. since x ray scatter has low frequency characteristics it is estimated via local averaging of the errors and subtracted from the errors. the solution algorithm for the model is derived with the karush‚äìkuhn‚äìtucker conditions. in addition the image segmentation of the projection or reconstructed image is not needed. samples representing different imaging situations are used in the experiments. beam hardening artifacts are obviously reduced in the reconstructed images obtained with the proposed method. the relative errors of the x ray energies of different component materials are calculated for the reconstructed images. for the first sample the errors are less than 1% in the reconstructed images obtained with the proposed method and are seen to be the best among all compared methods. for the second sample the errors are less than 10% in most reconstructed images obtained with the proposed method whereas they are larger than 10% in most reconstructed images obtained with the compared methods. these results demonstrate the effectiveness of the proposed method.", "Doi": "10.1109/TIM.2023.3246472", "Key Words": ["blind decomposition", "computed tomography (ct)", "multienergy", "multivoltage transmission images", "prior knowledge"]}