{"Title": "A Multifactor Combined Data Sharing Scheme for Vehicular Fog Computing Using Blockchain", "Doi": "10.1109/JIOT.2023.3282672", "Authors": ["z. guo", "g. wang", "g. zhang", "y. li", "j. ni"], "Key Words": ["access control", "attribute revocation", "blockchain", "ciphertext-policy attribute-based encryption (cp-abe)", "multifactor"], "Abstract": "vehicular fog computing  vfc  as an extended model of fog computing combines fog computing with traditional in vehicle networks to provide real time response services for users. however in such a dynamic system architecture achieving secure and efficient data sharing is an enormous challenge. ciphertext policy attribute based encryption  cp abe  is widely regarded as an excellent way of achieving one to many data sharing. nevertheless several practical challenges hinder its widespread application in vfc such as inefficient attribute revocation single factor access control and centralized data storage. for this purpose we design a multifactor combined data sharing scheme for vfc with cp abe and blockchain  mc ds vfc in short . we first propose an efficient attribute revocation mechanism that does not require complex key update operations. we then embed time user attributes and access interests into data sharing for more fine grain access control which enables users with sufficient attributes to efficiently access real time shared data according to their access interests. finally we combine the interplanetary file system  ipfs  and the blockchain maintained by roadside units  rsus  to achieve distributed collaborative storage. furthermore our mechanism also supports user traceability attribute joining online offline encryption and verifiable outsourced decryption. our proposal is shown to satisfy the indistinguishability under chosen plaintext attack  ind cpa  in the standard model. theoretical analysis and simulation experiments indicate that the mc ds vfc scheme is efficient and practical for vfc.", "Pub Date": "2023-10-30"}