{"Title": "A Multi-Step Learning Approach to Assist Code Review", "Doi": "10.1109/SANER56733.2023.00049", "Authors": ["o. b. sghaier", "h. sahraoui"], "Key Words": ["natural language processing", "deep neural networks", "modern code review", "code analysis", "recommender systems"], "Abstract": "modern code review is a process for early detection and reduction of issues which assists in ensuring the quality of the source code detecting anomalies and identifying potential improvements. however this is a highly manual activity that requires a lot of resources and time. recent research has addressed these problems by attempting to entirely automate this task  i.e. generating code reviews . however we do believe that dismissing the reviewer from this process is not the best option in terms of its optimal functioning especially considering the high error rates in the proposed approaches. furthermore this full automation is still too far to achieve given the complexity of the task that requires human intelligence. in this work we aim to assist the reviewer in the code review process. we propose an approach for detecting the type of issue and locating parts of the code that need to be revised by developers. in the first phase we propose a meta learner that combines a learning based model and a knowledge based model to predict the type of issue from the review comment. then we use this component to create and label a large dataset composed of quadruplets <original code review issue type revised code>. we use this data set to finetune a pre trained language model to predict the types of issues  e.g. naming resource handling etc.  that need to be addressed in the original code snippet. furthermore we fine tune another pre trained language model to locate these issues in the source code submitted by developers. we evaluate the performance of our approach using a test set not considered during the training. our results show that our model accurately locates and predicts the types of issues.", "Pub Date": "2023-05-15"}