{"Title": "A Multi-User Cost-Efficient Crowd-Assisted VR Content Delivery Solution in 5G-and-Beyond Heterogeneous Networks", "Doi": "10.1109/TMC.2022.3162147", "Authors": ["l. zhong", "x. chen", "c. xu", "y. ma", "m. wang", "y. zhao", "g. -m. muntean"], "Key Words": ["5g-and-beyond heterogeneous network", "content delivery", "multicast", "video transcoding", "virtual reality"], "Abstract": "the latest evolution of wireless communications enables users to access rich virtual reality  vr  services via the internet including while on the move. however providing a premium immersive experience for the massive number of concurrent users with various device configurations is a significant challenge due to the ultra high data rate and ultra low delay requirements of vr livecast services. this paper introduces an innovative multi user cost efficient crowd assisted delivery and computing  mec dc  framework which leverages mobile edge computing and end user resources to support high performance vr content delivery over 5g and beyond heterogeneous networks  5g hetnets . the proposed mec dc framework is based on three main solutions. first is a novel buffer nadir based multicast  bnm  mechanism for vr transmissions over 5g hetnets. bnm ensures smooth and synchronized user viewing experiences by maximizing the average playback buffer nadir of all participants with stochastic optimization. second and third are practical distributed algorithms  the cost efficient multicast aware transcoding offloading  mato  and crowd assisted delivery algorithm  cad  which optimize jointly multicast delivery and video transcoding. the algorithms‚äô optimality and complexity were investigated. the proposed mato cad solution was evaluated with real datasets trace driven numerical simulations and prototype based experiments. the trace driven experimental results showed how the proposed solution provides 18% throughput improvement the lowest delay and the best playback freeze ratio in comparison with three other state of the art solutions.", "Pub Date": "2023-06-30"}