{"Title": "A New Intelligent Approach for Automatic Stress Level Assessment Based on Multiple Physiological Parameters Monitoring", "Authors": ["g. ribeiro", "o. postolache", "f. f. mart√≠n"], "Pub Date": "2023-12-25", "Abstract": "stress is a natural feeling of not being able to cope with specific demands and events and it may even worsen a person‚äôs health especially in chronic disease patients. stress questionnaires are inefficient and time consuming. several models for stress estimation are based on facial analysis voice recognition thermography electrocardiography  ecg  and photoplethysmography  ppg  but they are not practical for patients. more robust systems with multiple parameters use devices that are incompatible in the same ecosystem. machine learning techniques can also be used but most studies only detect stress few classify it and none quantify it. the latest developments in health state monitoring present ppg as the leading solution. since it is noninvasive and can be integrated into wearable devices it is more user friendly and could be used in smart environments. since it is noninvasive and can be integrated into wearable devices it is more user friendly and could be used in smart environments. the proposed work introduces novelty regarding ppg signal processing algorithms to extract multiple physiological parameters simultaneously. in terms of innovations a multichannel detection system with a distributed computing platform is considered which besides containing the algorithms also includes the introduction of new physiological parameters and the proposal of a model for estimating stress levels based on fuzzy logic classifying stress into five levels. to validate the results experimental protocols were created to induce thermal stress in volunteers which yielded excellent system efficiency and accuracy indicators. the health status monitoring results and estimations are presented using a mobile application that was also developed.", "Doi": "10.1109/TIM.2023.3342218", "Key Words": ["blood oxygen saturation (spo‚çç)", "digital signal processing (dsp)", "embedded systems", "fuzzy logic", "galvanic skin response (gsr)", "heart rate (hr)", "heart rate variability (hrv)", "mobile application", "photoplethysmography (ppg)", "respiratory rate (rr) estimation", "stress levels classification"]}