{"Title": "A New Lightweight and Secure Certificateless Aggregate Signcryption Scheme for Industrial Internet of Things", "Doi": "10.1109/JIOT.2023.3327503", "Authors": ["g. srinivasa rao", "g. thumbur", "r. b. amarapu", "g. n. bhagya", "p. v. reddy"], "Key Words": ["aggregate signcryption", "authentication", "certificateless cryptography", "confidentiality", "industrial internet of things (iiot)"], "Abstract": "the industrial internet of things  iiot  combines several smart devices which communicate continuously with each other via the internet to reshape the traditional industrial process and to enable faster production and optimize processes by monitoring machine status environment and data management from the crowdsourced industrial devices. industry 4.0 is accelerated with modern computing platforms and communication technologies. the storage and data movement over the network is often exposed to many security and efficiency challenges due to the interconnections of millions of smart devices across the globe and the fact that these smart constrained devices have limited power. the cryptographic algorithms provide a solution for the privacy concerns in the iiot network in terms of authentication and data integrity to data transmission across the network. however the traditional cryptographic approaches are complex in nature require high computational costs and are time consuming. hence dedicated cost effective lightweight and cryptographic algorithms are in high demand and are essential. this article intends to develop a new lightweight and secure aggregate signcryption scheme for crowdsourced industrial data using certificateless cryptography. this scheme effectively reduces computational cost and time consumption. in addition this scheme avoids the key escrow problem and achieves stronger security properties. finally we evaluate our pairing free cl based aggregate signcryption scheme‚äôs performance and will compare results with recent state of the art schemes.", "Pub Date": "2024-03-08"}