{"Title": "A Novel Quantum Hash-Based Attribute-Based Encryption Approach for Secure Data Integrity and Access Control in Mobile Edge Computing-Enabled Customer Behavior Analysis", "Doi": "10.1109/ACCESS.2024.3373648", "Authors": ["k. k. singamaneni", "g. muhammad", "z. ali"], "Key Words": ["access control", "attribute-based encryption (abe)", "customer behavior analysis", "data integrity and security", "mobile edge computing (mec)", "quantum key distribution"], "Abstract": "the domain of mobile edge computing  mec  has seen rapid growth making consumer behavior research an essential element in many applications. nevertheless in mec systems that are decentralized and have limited resources challenges arise in ensuring both data integrity and access control. this paper introduces a new technique called quantum hash based attribute based encryption  qh abe  to address these issues. previously there were several methods available to guarantee data integrity and access control in mec. however these systems had limits in managing large and intricate datasets lacked a standardized protocol for revocation and incurred significant computational costs. we were prompted by these restrictions to suggest a more efficient technique which included using the qh abe method in our study. the suggested solution integrates hash functions with quantum computing concepts to enhance security and control access in mec enabled consumer behavior research. the suggested technique provides several benefits compared to traditional hash algorithms by using hash functions. in this technique we introduce a recursive non linear polynomial graph centered integrity algorithm  rnlpia . rnlpia enhances security by thwarting covert alterations to data and guaranteeing tamper evident measures via the generation of unique hash values derived from the content of the data. the suggested method‚äôs efficacy and efficiency are proved by a comprehensive experimental assessment highlighting its capability to fulfill the data integrity and access control needs of mec situations. the performance of our technology showcases its potential and paves the way for using quantum computing technologies for accessing control and data security. this work contributes to the progress of privacy preserving secure consumer behavior analysis in the dynamic mec environment.", "Pub Date": "2024-03-14"}