{"Title": "A Noniterative Supervised On-Chip Training Circuitry for Reservoir Computing Systems", "Doi": "10.1109/TNNLS.2022.3201828", "Authors": ["f. gal√°n-prado", "j. l. rossell√≥"], "Key Words": ["edge computing", "max-plus algebra", "neuromorphic hardware", "reservoir computing (rc)"], "Abstract": "artificial neural networks  anns  is an exponentially growing field mainly because of its wide range of applications to everyday life such as pattern recognition or time series forecasting. in particular reservoir computing  rc  arises as an optimal computational framework suited for temporal sequential data analysis. the direct on silicon implementation of rcs may help to minimize power and maximize processing speed that is especially relevant in edge intelligence applications where energy storage is considerably restricted. nevertheless most of the rc hardware solutions present in the literature perform the training process off chip at the server level thus increasing processing time and overall power dissipation. some studies integrate both learning and inference on the same chip although these works are normally oriented to implement unsupervised learning  ul  [with a lower expected accuracy than supervised learning  sl ] or propose iterative solutions  with a subsequent higher power consumption . therefore the integration of rc systems including both inference and a fast noniterative sl method is still an incipient field. in this article we propose a noniterative sl methodology for rc systems that can be implemented on hardware either sequentially or fully parallel. the proposal presents a considerable advantage in terms of energy efficiency  ee  and processing speed if compared to traditional off chip methods. in order to prove the validity of the model a cyclic echo state nn with on chip learning capabilities for time series prediction has been implemented and tested in a field programmable gate array  fpga . also a low cost audio processing method is proposed that may be used to optimize the sound preprocessing steps.", "Pub Date": "2024-02-29"}