{"Title": "A Novel Hybrid Quantum-Classical Framework for an In-Vehicle Controller Area Network Intrusion Detection", "Authors": ["m. s. salek", "p. k. biswas", "j. pollard", "j. hales", "z. shen", "v. dixit", "m. chowdhury", "s. m. khan", "y. wang"], "Pub Date": "2023-09-11", "Abstract": "in vehicle controller area network  can  is susceptible to various cyberattacks due to its broadcast based communication nature. an attacker can inject false messages to a vehicle‚äôs can via wireless communication the infotainment system or the onboard diagnostic port. thus an effective intrusion detection system is essential to distinguish authentic can messages from false ones. in this study we developed a hybrid quantum classical can intrusion detection framework using a classical neural network  nn  and a quantum restricted boltzmann machine  rbm . the classical nn is dedicated to feature extraction from can images generated from a vehicle‚äôs can bus data. in contrast the quantum rbm is dedicated to can image reconstruction for classification based intrusion detection. the novelty of the study lies in utilizing the generative ability of an rbm to reconstruct the pixels in a can image a portion of which is dedicated to labeling. then that portion of the reconstructed image is used to classify the image as an attack image or a normal image. to evaluate the performance of the hybrid quantum classical can intrusion detection framework we used a real world can fuzzy attack dataset to create three separate attack datasets where each dataset represents a unique set of features related to the vehicle. we compared the performance of our hybrid framework to a similar but classical only framework. our analyses showed that the hybrid framework performs better in can intrusion detection compared to the classical only framework. for the three datasets considered in this study the best models in the hybrid framework achieved 97.5% 97% and 98.3% intrusion detection accuracies and 94.7% 93.9% and 97.2% recalls respectively. in contrast the best models in the classical only framework achieved 92.5% 95% and 93.3% intrusion detection accuracies and 84.2% 89.8% and 88.9% recalls respectively.", "Doi": "10.1109/ACCESS.2023.3304331", "Key Words": ["controller area network", "cyberattack detection", "intrusion detection", "quantum artificial intelligence", "restricted boltzmann machine", "generative artificial intelligence"]}