{"Title": "A Novel Lower-Limb Coordination Assessment Scheme Using Multi-Scale Nonlinear Coupling Characteristics With sEMG", "Authors": ["p. tu", "j. li", "h. wang", "y. li", "w. xiang"], "Pub Date": "2023-03-01", "Abstract": "motor dysfunction  e.g. incoordination of upper or lower limb  significantly limits the individuals‚äô ability of daily living and thus the provisioning of a motion coordination assessment method becomes of vital importance. as a quantitative indicator intermuscular coupling strength could assess limb coordination. since surface electromyography  semg  signals cover nonlinear coupling characteristics in this article a lower limb motion coordination assessment scheme with intermuscular coherence  imc  analysis and optimization variational mode decomposition  vmd  is proposed. first semg signals are decomposed into several intrinsic mode functions  imfs  using optimized vmd. then the nonlinear coupling feature vector in the beta band frequency domain  15‚äì35 hz  is extracted by the g p algorithm from optimal imf thereby estimating the intermuscular coupling strength by imc. in particular differential evolution  de  algorithm‚äôs global optimization capability and envelope entropy  ee ‚äôs sparsity are adopted to provide the basis for optimization vmd and screening optimal imf respectively. finally signals are collected from four muscle pairs of the 12 male and 12 female subjects to assess lower limb motions‚äô coordination. simultaneously the independent sample  $t$  test is leveraged to compare the effects of gender on groups‚äô characteristics  e.g. age height and body mass . results demonstrate not only the effectiveness of the proposed approach  i.e.  $p< 0.01$  with both ‚äús walking‚äù and ‚äúrunning‚äù motions  $p< 0.05$  with ‚äúq walking‚äù  but also the difference in motion coordination relationship between male and female adults as well as the significance of muscle selection.", "Doi": "10.1109/TIM.2023.3246490", "Key Words": ["differential evolution (de) algorithm", "intermuscular coherence (imc)", "lower-limb coordination", "surface electromyography (semg)", "variational mode decomposition (vmd)"]}