{"Title": "A Novel Approach for Sentiment Analysis on social media using BERT & ROBERTA Transformer-Based Models", "Doi": "10.1109/I2CT57861.2023.10126206", "Authors": ["k. n. prasanthi", "r. eswari madhavi", "d. n. sai sabarinadh", "b. sravani"], "Key Words": ["transfer learning", "sentiment analysis", "social media", "transformer models", "informal language", "fine-tuning", "deep learning"], "Abstract": "sentiment analysis on social media platforms has gained immense popularity in recent years due to its ability to analyze and classify users‚äô emotions and opinions on different topics. this paper proposes a sentiment analysis model for twitter that utilizes two powerful transformer models bert and roberta to classify tweets based on their sentiment. the use of bert and roberta transformers offers several advantages over traditional sentiment analysis models. these transformers can capture contextual information and understand the relationships between words in a sentence making them well suited for the nuanced language used in social media platforms like twitter. to train the model transfer learning is employed allowing the transformers to learn from a vast dataset of tweets before fine tuning on the sentiment analysis task. this approach enables the model to understand the nuances of informal language and slang used in tweets improving its ability to accurately classify sentiment. another advantage of the proposed model is its ability to handle the informal language used in tweets. however bert and roberta transformers have been trained on a vast corpus of informal language enabling them to accurately analyze and classify sentiment in tweets. lastly the proposed model‚äôs scalability and efficiency are also advantages. this model can handle large volumes of data with high efficiency and can be fine tuned to adapt to new domains with minimal training data making it highly versatile and applicable in various applications.", "Pub Date": "2023-05-23"}