{"Title": "A Novel Federated Learning Scheme for Generative Adversarial Networks", "Doi": "10.1109/TMC.2023.3278668", "Authors": ["j. zhang", "l. zhao", "k. yu", "g. min", "a. y. al-dubai", "a. y. zomaya"], "Key Words": ["collaborative learning", "distributed learning and deployment", "generative adversarial networks", "non-independent and identical data"], "Abstract": "generative adversarial networks  gans  have been advancing and gaining tremendous interests from both academia and industry. with the development of wireless technologies a huge amount of data generated at the network edge provides an unprecedented opportunity to develop gans applications. however due to the constraints such as bandwidth privacy and legal issues it is inappropriate to collect and send all data to the cloud or servers for analysis training and mining. thus deploying and training gans at the edge becomes a promising alternative solution. the instability of gans introduced by non independent and identical data  non iid  poses significant challenges to training gans. to address these challenges this paper presents a novel federated learning framework for gans namely collaborated game parallel learning  cap . cap supports parallel training of data and models for gans breaking the isolated training among generators that exists in the previous distributed algorithms and achieving collaborative learning among cloud edge servers and devices. then to further enhance the ability of cap gan for addressing non iid issues we propose a mix generator module  mix g  which divides a generator into the sharing layer and personalizing layer. the mix g module extracts the generic and personalization features and improves the performance of cap gan on extremely personalizing datasets. experimental results and analysis substantiate the usefulness and superiority of our proposed cap gan scheme which can achieve better results in the non iid scenarios compared with the state of the art algorithms.", "Pub Date": "2024-04-04"}