{"Title": "A Post-Quantum Compliant Authentication Scheme for IoT Healthcare Systems", "Authors": ["m. adeli", "n. bagheri", "h. r. maimani", "s. kumari", "j. j. p. c. rodrigues"], "Pub Date": "2024-02-05", "Abstract": "in an internet of things  iot  based healthcare system medical iot devices gather and transmit critical patient data. ensuring the security and privacy of medical data is paramount. one of the most critical challenges in this regard is the authentication of participating entities. the literature proposes specific authentication approaches for healthcare systems based on integer factorization and discrete logarithm problems. however the advent of quantum computers would fundamentally break all of these protocols. in this study we conducted an analysis of a recently proposed authentication and access control scheme for e health systems which is based on lattice based cryptography and was developed by gupta et al. our analysis revealed that the scheme is vulnerable to several types of attacks including impersonation de synchronization and smart card stolen attacks which could compromise the confidentiality and integrity of sensitive medical data. to address these security challenges we propose an alternative authentication and access control scheme that uses saber a finalist lattice based key encapsulation algorithm from round three of the nist post quantum cryptography standardization. one of the biggest advantages of saber is its simplicity and efficiency. our proposed scheme is designed specifically for e health systems and provides robust protection against the vulnerabilities identified in gupta et al.‚äôs scheme. we believe that our proposed scheme represents a significant improvement over existing approaches and could help to enhance the security and privacy of e health systems. upon completion of our improved protocol we proceeded to implement it within the vivado 2018.3 environment for zynq ultrascale fpgas. to gather insight into its performance we conducted a performance comparison study with various related protocols.", "Doi": "10.1109/JIOT.2023.3309931", "Key Words": ["authentication", "fpga", "internet of things (iot)", "lattice-based cryptography", "security analysis"]}