{"Title": "A Promising Integration of SDN and Blockchain for IoT Networks: A Survey", "Doi": "10.1109/ACCESS.2023.3260777", "Authors": ["s. w. turner", "m. karakus", "e. guler", "s. uludag"], "Key Words": ["blockchain", "iot", "sdn", "survey", "bc-sdiot"], "Abstract": "the state of computer network technologies has continually advanced at a rapid pace. software defined networking  sdn  and blockchain  bc  have emerged as complementary technologies providing support that facilitates greater security and greater network performance for many domains of application including the internet of things  iot  ecosystem ideally resulting in an improvement to our collective quality of life. the proliferation of iot devices is driven by a wide variety of use cases and by their ubiquitous availability. when combined with the emergence of sdn and bc this environment presents rich opportunities for various emerging research efforts and provides a motivation for this paper. here we present a comprehensive survey of the studies in which bc and sdn have been integrated into the iot ecosystem referred to hereafter as bc enabled software defined iot  bc sdiot . the paper first discusses the motivations and drivers for integrating bc enabled sdn and bc sdiot as well as their benefits and drawbacks. second we categorize the relevant studies according to six key implementation objectives and ideas that combine bc sdn and iot technologies to create smart secure and effective frameworks  security computing paradigms  edge and fog computing  trust management access control & authentication privacy and networking. in the corresponding sections we present the categories  i.e. problem domains  of the aforementioned novel taxonomy and discuss related studies  i.e. solutions  in depth. finally we outline potential major challenges open issues and future prospects that require further research attention and intensive endeavors for complete and ground breaking frameworks to broaden newer research domains in bc sdiot. this survey paper may serve as a fruitful primer for the reader investigating the exploitation of bc in sdn and iot ecosystems.", "Pub Date": "2023-03-30"}