{"Title": "A Review of Cybersecurity in Grid-Connected Power Electronics Converters: Vulnerabilities, Countermeasures, and Testbeds", "Authors": ["r. fu", "m. e. lichtenwalner", "t. j. johnson"], "Pub Date": "2023-10-19", "Abstract": "with the increasing installations of solar energy electric vehicles and other distributed energy resources and the deeper developments of digitalization and standardization cybersecurity became more and more essential and critical in modern power systems. unfortunately most prior research work focuses on the cybersecurity of power transmission and distribution networks other than distributed energy devices and their grid connected power converters. focusing on the grid connected power electronics converters  gcpecs  this article does a comprehensive review of existing outcomes from selected references in the aspects of vulnerabilities countermeasures and testbeds. by analyzing the gcpec‚äôs layout and countermeasure candidates it is found that the vulnerabilities of gcpecs include both cyber and physical layers that are easily accessible to malicious hackers. these vulnerabilities in the two layers must be considered simultaneously and coordinate well with each other. especially hardware hardening is an essential approach to enhance cybersecurity within gcpecs. it is also noticed that the detection and mitigation approaches should consider the complexity of algorithms to be applied and assess the limits of computing and data processing capabilities in gcpecs while evaluating the feasibility of countermeasure candidates to cyberattacks in testbeds. in addition the countermeasures should meet relevant standards such as ieee 1547.1 ieee 2030.5 iec 61850 and iec 62351 to ensure the interoperability and cybersecurity of gcpec devices in smart grids. finally based on the review and analysis four recommendations are raised for future research on gcpec‚äôs cybersecurity and their applications in smart grids.", "Doi": "10.1109/ACCESS.2023.3324177", "Key Words": ["countermeasure", "cybersecurity", "grid-connected", "power converter", "power electronics", "smart grid", "testbed", "vulnerability"]}