{"Title": "A Review on the Immediate Advancement of the Internet of Things in Wireless Telecommunications", "Doi": "10.1109/ACCESS.2023.3250466", "Authors": ["k. b. a. bakar", "f. t. zuhra", "b. isyaku", "s. b. sulaiman"], "Key Words": ["internet of things", "cloud computing", "blockchain", "artificial intelligence", "wireless body sensor networks", "nanotechnology"], "Abstract": "internet of things is emerging as an incredible future technology to improve the existing lifestyle from the research community industry and the public sector. the main intention of iot is to create an efficient interactive and autonomous infrastructure for a safer and healthier world. moreover it grows faster day to day with the support of many other technologies i.e. cloud computing blockchain wireless body sensor networks nanotechnology and artificial intelligence for smart applications including healthcare environment automotive industries transportation agriculture etc. nevertheless managing big data is one of the challenging tasks due to the increased number of devices leading to various serious issues like security privacy accuracy latency scheduling etc. further specific infrastructures with remarkable techniques are required to analyze the bulk of raw data to progress the quality of life and allow timely intervention through various capabilities i.e. data capture unique identification actuation communication data mining etc. in past literature numerous reviews surveys are presented that explore the technologies mentioned above as standalone and application specific. however this paper aims to integrate all the mentioned technologies and deliver a clear vision to future researchers  newcomers  as a kick start article to boost up and understand the status of the existing research through a comprehensive review of the internet of things and its evolution in wireless telecommunications from a general perspective. the most significant challenges and issues are highlighted to research further in these evolving domains.", "Pub Date": "2023-03-07"}