{"Title": "A Review on Large Language Models: Architectures, Applications, Taxonomies, Open Issues and Challenges", "Doi": "10.1109/ACCESS.2024.3365742", "Authors": ["m. a. k. raiaan", "m. s. h. mukta", "k. fatema", "n. m. fahad", "s. sakib", "m. m. j. mim", "j. ahmad", "m. e. ali", "s. azam"], "Key Words": ["large language models (llm)", "natural language processing (nlp)", "artificial intelligence", "transformer", "pre-trained models", "taxonomy", "application"], "Abstract": "large language models  llms  recently demonstrated extraordinary capability in various natural language processing  nlp  tasks including language translation text generation question answering etc. moreover llms are new and essential part of computerized language processing having the ability to understand complex verbal patterns and generate coherent and appropriate replies in a given context. though this success of llms has prompted a substantial increase in research contributions rapid growth has made it difficult to understand the overall impact of these improvements. since a plethora of research on llms have been appeared within a short time it is quite impossible to track all of these and get an overview of the current state of research in this area. consequently the research community would benefit from a short but thorough review of the recent changes in this area. this article thoroughly overviews llms including their history architectures transformers resources training methods applications impacts challenges etc. this paper begins by discussing the fundamental concepts of llms with its traditional pipeline of the llms training phase. then the paper provides an overview of the existing works the history of llms their evolution over time the architecture of transformers in llms the different resources of llms and the different training methods that have been used to train them. the paper also demonstrates the datasets utilized in the studies. after that the paper discusses the wide range of applications of llms including biomedical and healthcare education social business and agriculture. the study also illustrates how llms create an impact on society and shape the future of ai and how they can be used to solve real world problems. finally the paper also explores open issues and challenges to deploy llms in real world scenario. our review paper aims to help practitioners researchers and experts thoroughly understand the evolution of llms pre trained architectures applications challenges and future goals.", "Pub Date": "2024-02-23"}