{"Title": "A Review on Large Language Models: Architectures, Applications, Taxonomies, Open Issues and Challenges", "Doi": "10.1109/ACCESS.2024.3365742", "Authors": ["m. a. k. raiaan", "m. s. h. mukta", "k. fatema", "n. m. fahad", "s. sakib", "m. m. j. mim", "j. ahmad", "m. e. ali", "s. azam"], "Key Words": ["large language models (llm)", "natural language processing (nlp)", "artificial intelligence", "transformer", "pre-trained models", "taxonomy", "application"], "Abstract": "large language models  large language model  recently demonstrated extraordinary capability in various natural language processing  nlp  tasks including language translation text generation question answering etc. moreover large language model are new and essential part of computerized language processing having the ability to understand complex verbal patterns and generate coherent and appropriate replies in a given context. though this success of large language model has prompted a substantial increase in research contributions rapid growth has made it difficult to understand the overall impact of these improvements. since a plethora of research on large language model have been appeared within a short time it is quite impossible to track all of these and get an overview of the current state of research in this area. consequently the research community would benefit from a short but thorough review of the recent changes in this area. this article thoroughly overviews large language model including their history architectures transformers resources training methods applications impacts challenges etc. this paper begins by discussing the fundamental concepts of large language model with its traditional pipeline of the large language model training phase. then the paper provides an overview of the existing works the history of large language model their evolution over time the architecture of transformers in large language model the different resources of large language model and the different training methods that have been used to train them. the paper also demonstrates the datasets utilized in the studies. after that the paper discusses the wide range of applications of large language model including biomedical and healthcare education social business and agriculture. the study also illustrates how large language model create an impact on society and shape the future of artificial intelliegence and how they can be used to solve real world problems. finally the paper also explores open issues and challenges to deploy large language model in real world scenario. our review paper aims to help practitioners researchers and experts thoroughly understand the evolution of large language model pre trained architectures applications challenges and future goals.", "Pub Date": "2024-02-23"}