{"Title": "A Review on Task Scheduling Techniques in Cloud and Fog Computing: Taxonomy, Tools, Open Issues, Challenges, and Future Directions", "Doi": "10.1109/ACCESS.2023.3343877", "Authors": ["z. a. khan", "i. a. aziz", "n. a. b. osman", "i. ullah"], "Key Words": ["cloud computing", "fog computing", "task scheduling", "workflow", "internet of things (iot)"], "Abstract": "efficient task scheduling on the cloud is critical for optimal utilization of resources in data centers. it became even more challenging with the emergence of 5g and iot applications that generate massive number of tasks with stringent latency requirements. this gives birth to fog edge computing   a complementary layer to cloud. tasks latency in fog computing can be reduced as processing in the network is done closer to the end devices and users but every task cannot be scheduled in the fog due to limited resources availability. conventional scheduling algorithms often fail to exploit the heterogeneous resources  therefore specially designed and well tuned scheduling algorithms are desired for achieving better quality of service. in this study the state of the art task scheduling algorithms in the cloud and fog environments are investigated in a diverse set of dimensions. among the relevant studies published between 2018‚äì2022 and indexed in the web of science  wos  scopus and google scholar databases eighteen studies are selected for both the cloud and fog domains from wos and scopus while seventeen studies are chosen for both the cloud and fog domains from google scholar. thus a total of 106 studies are included in this survey for the detail investigation. the scheduling algorithms are broadly classified into three categories such as heuristic meta heuristic and hybrid meta heuristic followed by detailed critical analysis. it has been observed that most of the scheduling algorithms are dynamic and non preemptive in nature while the higher fraction of the tasks is independent in comparison to bag of tasks and workflows. similarly 97% of the studies focus on multiple objectives and 68% of the techniques are non deterministic. further a total of twenty different scheduling objectives are identified with makespan resource utilization delay load balancing and energy consumption as the most significant metrics. the evaluation methods including simulations  51%  real experiments  4%  analytical equations  2%  and datasets  43%  etc. are surveyed. at the end the open issues challenges and future directions are argued.", "Pub Date": "2023-12-25"}