{"Title": "A Relay-Assisted Communication Scheme for Collaborative On-Device CNN Execution Considering Hybrid Parallelism", "Doi": "10.1109/ACCESS.2023.3314381", "Authors": ["e. kilcioglu", "i. stupia", "l. vandendorpe"], "Key Words": ["convex optimization", "convolutional neural network", "data parallelism", "dnn partitioning", "edge inference", "edge intelligence", "energy efficiency", "model parallelism", "relay-assisted communication", "wireless collaborative computing"], "Abstract": "deep learning  dl  has gained increasing prominence in latency critical artificial intelligence  artificial intelliegence  applications. due to the intensive computational requirements of these applications cloud centric approaches have been attempted to address this issue but they result in intolerable latency network congestion and privacy concerns. an alternative concept called edge intelligence which combines artificial intelliegence and edge computing has been proposed to perform dl execution at the edge in multiple resource constrained devices  rcds  collaboratively. this paper proposes a relay assisted distributed and collaborative on device convolutional neural network  cnn  execution scheme for latency critical applications. the system employs hybrid parallelism combining both data and model parallelism to optimize collaborative cnn execution on rcds. a relay assisted communication technique is used to reduce the input data size per rcd and avoid excessive point to point communication between the data owner rcd and collaborative rcds. the proposed approach reduces communication overhead using two strategies  layer block formation and optimal filter assignment. these strategies are applied to multiple collaborative rcds considering their different computing capabilities and network conditions. finally a convex optimization problem is formulated to minimize the overall energy consumption by jointly optimizing the workload of each rcd in each layer and communication and computation parameters.", "Pub Date": "2023-09-19"}