{"Title": "A Robust and Efficient Ensemble of Diversified Evolutionary Computing Algorithms for Accurate Robot Calibration", "Authors": ["t. chen", "s. li", "y. qiao", "x. luo"], "Pub Date": "2024-02-22", "Abstract": "industrial robots are regarded as essential instruments for advanced industry upgrading. the kinematic parameters of an industrial robot should be calibrated precisely to guarantee its absolute positioning accuracy which can be implemented via an evolutionary computing  ec  algorithm  however existing calibrators are mostly based on an ec algorithm with a homogeneous learning scheme which may lead to performance loss due to limited searching ability. on the other hand the existing hybrid algorithm schemes based on multiple ec algorithms mostly work by training different base models with different ec algorithms and then building the ensemble for performance gain which leads to high computational and storage costs. motivated by these discoveries this article proposes a novel hybrid of evolutionary schemes  hoes  model with threefold ideas  1  aggregating the principle of six different ec algorithms‚äô learning schemes to build a hybrid evolution scheme where the learning scheme of each ec algorithm is adopted to make the swarm evolve in sequence thereby building an expert ensemble where each expert‚äôs learning is taken based on previous results for establishing high calibration accuracy  2  establishing a memory system that consists of diversified and highly efficient individuals in a specific population during the update process of each expert for obtaining the solution diversity  and 3  designing a punishment system to dismiss the experts with poor calibration performance to achieve high computational efficiency. the convergence of the hoes model is rigorously proved in theory. to validate its performance a large dataset hsr c has been established and published for industrial robot calibration. empirical studies on hsr c demonstrate that the proposed hoes model outperforms several state of the art algorithms  including both sole algorithms and hoes model‚äôs variants  in terms of calibration accuracy which strongly supports its potential in addressing calibration issues for industrial robots.", "Doi": "10.1109/TIM.2024.3363783", "Key Words": ["absolute positioning accuracy", "data-driven algorithm", "evolutionary computing (ec)", "industrial robot", "kinematic parameters"]}