{"Title": "A Robust Learned Feature-Based Visual Odometry System for UAV Pose Estimation in Challenging Indoor Environments", "Authors": ["l. yu", "e. yang", "b. yang", "z. fei", "c. niu"], "Pub Date": "2023-06-08", "Abstract": "unmanned aerial vehicles  uavs  are becoming popular nowadays due to their versatility and flexibility for indoor applications such as the autonomous visual inspection of the inner surface of a pressure vessel. nevertheless robust and reliable position estimation is critical for completing these tasks. visual odometry  vo  and visual simultaneous localization and mapping  vslam  allow the uav to estimate its position in unknown environments. however traditional feature based vo vslam systems struggle to deal with complex scenes such as low illumination and textureless environments. replacing the traditional features with deep learning based features provides the advantage of handling the challenging environment but the efficiency is ignored. in this work an efficient vo system based on a novel lightweight feature extraction network for uav onboard platforms has been developed. the deformable convolution  dfconv  is utilized to improve the feature extraction capability. owing to the limited onboard computing capability the depthwise separable convolution  dwconv  is adopted to calculate the offsets for the dfconv and construct the backbone network to improve the feature extraction efficiency. experiments on public datasets indicate that the efficiency of the vo system is improved by 30.03% while preserving the accuracy on embedded platforms with the feature points and descriptors detected by the proposed convolutional neural network  cnn . moreover the proposed vo system is verified through uav flying tests in a real world scenario. the results prove that the proposed vo system is able to handle the challenging environments where both the latest traditional and deep learning feature based vo vslam systems fail and it is feasible for uav self localization and autonomous navigation in the confined low illumination and textureless indoor environment.", "Doi": "10.1109/TIM.2023.3279458", "Key Words": ["deep learning-based features", "depthwise separable convolution (dwconv)", "improved deformable convolution (dfconv)", "unmanned aerial vehicles (uavs)", "visual odometry (vo)"]}