{"Title": "A Secure and Intelligent Data Sharing Scheme for UAV-Assisted Disaster Rescue", "Doi": "10.1109/TNET.2022.3226458", "Authors": ["y. wang", "z. su", "q. xu", "r. li", "t. h. luan", "p. wang"], "Key Words": ["unmanned aerial vehicle", "blockchain", "vehicular fog computing", "deep reinforcement learning", "disaster rescue"], "Abstract": "unmanned aerial vehicles  uavs  have the potential to establish flexible and reliable emergency networks in disaster sites when terrestrial communication infrastructures go down. nevertheless potential security threats may occur on uavs during data transmissions due to the untrusted environment and open access uav networks. moreover uavs typically have limited battery and computation capacity making them unaffordable for heavy security provisioning operations when performing complicated rescue tasks. in this paper we develop rescuechain a secure and efficient information sharing scheme for uav assisted disaster rescue. specifically we first implement a lightweight blockchain based framework to safeguard data sharing under disasters and immutably trace misbehaving entities. a reputation based consensus protocol is devised to adapt the weakly connected environment with improved consensus efficiency and promoted uavs‚äô honest behaviors. furthermore we introduce a novel vehicular fog computing  vfc  based off chain mechanism by leveraging ground vehicles as moving fog nodes to offload uavs‚äô heavy data processing and storage tasks. to offload computational tasks from the uavs to ground vehicles with idle computing resources an optimal allocation strategy is developed by choosing payoffs that achieve equilibrium in a stackelberg game formulation of the allocation problem. for lack of sufficient knowledge on network model parameters and users‚äô private cost parameters in practical environment we also design a two tier deep reinforcement learning based algorithm to seek the optimal payment and resource strategies of uavs and vehicles with improved learning efficiency. simulation results show that rescuechain can effectively accelerate consensus process improve offloading efficiency reduce energy consumption and enhance user payoffs.", "Pub Date": "2023-12-19"}