{"Title": "A Single-Step Multiclass SVM Based on Quantum Annealing for Remote Sensing Data Classification", "Authors": ["a. delilbasic", "b. le saux", "m. riedel", "k. michielsen", "g. cavallaro"], "Pub Date": "2023-12-14", "Abstract": "in recent years the development of quantum annealers has enabled experimental demonstrations and has increased research interest in applications of quantum annealing such as in quantum machine learning and in particular for the popular quantum support vector machine  svm . several versions of the quantum svm have been proposed and quantum annealing has been shown to be effective in them. extensions to multiclass problems have also been made which consist of an ensemble of multiple binary classifiers. this article proposes a novel quantum svm formulation for direct multiclass classification based on quantum annealing called quantum multiclass svm  qmsvm . the multiclass classification problem is formulated as a single quadratic unconstrained binary optimization problem solved with quantum annealing. the main objective of this article is to evaluate the feasibility accuracy and time performance of this approach. experiments have been performed on the d wave advantage quantum annealer for a classification problem on remote sensing data. results indicate that despite the memory demands of the quantum annealer qmsvm can achieve an accuracy that is comparable to standard svm methods such as the one versus one  ovo  depending on the dataset  compared to ovo  0.8663 versus 0.8598 on toulouse 0.8123 versus 0.8521 on potsdam . more importantly it scales much more efficiently with the number of training examples resulting in nearly constant time  compared to ovo  85.72 versus 248.02 s on toulouse 58.89 versus 580.17 s on potsdam . this article shows an approach for bringing together classical and quantum computation solving practical problems in remote sensing with current hardware.", "Doi": "10.1109/JSTARS.2023.3336926", "Key Words": ["classification", "quantum annealing (qa)", "quantum computing (qc)", "remote sensing (rs)", "support vector machine (svm)"]}