{"Title": "A Single Chip SPAD Based Vision Sensing System With Integrated Memristive Spiking Neuromorphic Processing", "Authors": ["m. s. a. shawkat", "m. m. adnan", "r. d. febbo", "j. j. murray", "g. s. rose"], "Pub Date": "2023-03-02", "Abstract": "this paper presents a new scalable  $8\\times8$  single photon avalanche diode  spad  based vision sensor with integrated spiking neuromorphic system on a single chip. the proposed vision sensing system adopts the benefits of spad‚äôs high quantum efficiency and energy efficiency of memristive spiking neuromorphic processing. the spad based vision sensor includes biologically inspired address event representation  aer  readout to generate asynchronous digital address events at the output reducing computation and making it suitable to process directly with integrated on chip spiking neuromorphic system in a faster and more energy efficient way. a novel on chip interface is designed to convert the output events of a spad based event sensor into temporally coded spikes  tcs  that enable on chip processing with integrated spiking neuromorphic system. we have tested the prototype vision sensing system for imaging characters by spad based vision sensor and recognizing them using the integrated memristive spiking neuromorphic system. to help with the evaluation we have built a complete temporal pulses data set from simulating the spad vision sensor with aer readout in imaging characters and applied directly to integrated spiking neuromorphic system via designed novel on chip interface. the achieved accuracy is 89.54% with a power consumption of  $316~\\mu \\text{w}$  for the memristive neuromorphic processor. the spad based vision sensor exhibits array level dynamic range of 148 db with a power consumption of 2.8 mw. the designed spad based vision sensing system with an integrated spiking neuromorphic system on a single chip shows great promise for robotics autonomous vehicles health and security applications.", "Doi": "10.1109/ACCESS.2023.3244793", "Key Words": ["single-photon avalanche diode", "spad", "spad imager", "vision sensor", "neuromorphic computing", "memristor", "spiking neural network", "snn", "address event representation", "aer"]}