{"Title": "A Smart Healthcare Framework for Accurate Detection of Schizophrenia Using Multichannel EEG", "Authors": ["g. sharma", "a. m. joshi", "d. yadav", "s. p. mohanty"], "Pub Date": "2023-07-20", "Abstract": "in recent years advanced computing techniques have been investigated and employed for the computerized detection of brain disorders like schizophrenia. schizophrenia is a neurological condition leading to hallucinations and disorganized speech in patients. emerging deep learning approaches can augment the computer based diagnosis of this brain disorder by measuring and analyzing the electroencephalography  eeg  signals. this article proposes a novel concept of the easy to wear cap namely the schizophrenia detection cap  sczcap  integrating hardware and software for acquiring eeg signals from the scalp for accurate schizophrenia detection. in this research a seven layer model comprising convolution neural networks  cnns  and temporal convolution networks  tcns  is designed and tested using raw eeg data  approach 1  and manually extracted features  approach 2 . three pretrained models vgg 16 alexnet and resnet 50 along with the proposed model have also been implemented in this work. a dataset consisting of eeg signals of 14 healthy and 14 schizophrenic patients is used in this work for the implementations. the performance of the proposed cnn tcn model  approaches 1 and 2  is also presented using nonsubject wise and subject wise experiments. it is found that the proposed cnn tcn model using approach 1 outperformed all other implemented models with 99.57% accuracy 99.51% sensitivity 99.64% specificity and 99.63% precision in nonsubject wise experiments. the experimental results also exhibit the superiority of this model over other schizophrenia models in the state of the art literature.", "Doi": "10.1109/TIM.2023.3293544", "Key Words": ["convolution neural network (cnn)", "electroencephalography (eeg) measurement", "schizophrenia disorder", "smart healthcare", "temporal convolution network (tcn)", "wearable device"]}