{"Title": "A Socially-Aware Radio Map Framework for Improving QoS of UAV-Assisted MEC Networks", "Doi": "10.1109/TNSM.2022.3206473", "Authors": ["s. tripathi", "o. j. pandey", "l. r. cenkeramaddi", "r. m. hegde"], "Key Words": ["uav-assisted networks", "multi-access edge-networks", "radio-maps", "clustering", "social-networks", "kalman filter"], "Abstract": "the expeditious growth of the internet of things  iot  has accelerated the evolution of multi access edge computing  mec . mec alleviates the challenges of conventional cloud computing such as high data latency poor data gathering reliability increased network cost and lack of network robustness. the primary objective of mec is to facilitate a hierarchy of edge servers to address these quality of service  qos  challenges especially the information propagation issue due to the mobility of iot devices  iod . further social relationship among mobile iod is a critical parameter used to reduce the data transmission delay and queue size at the mec. specifically in this work a novel socially aware radio map generation method is proposed to compute the fine grained and accurate locations of qos deprived areas. firstly a novel method to compute the social relationship index  sri  factor is proposed on the basis of current and future encounters among moving iods. then the obtained sri factor is used to form clusters of mobile iod. the clusters‚äô signal to interference plus noise ratio  sinr  is then used to generate the socially aware radio map. following that unmanned aerial vehicles  uav  use this radio map which contains rich and serviceable channel information for 3d beamforming towards the mobile clusters. using the obtained radio map kalman filter based offline path planning of uavs is proposed to minimize the uavs flying distance from the initial to final locations. furthermore an optimization problem is formulated to assess the performance of the proposed method. finally the performance of the proposed method is compared with the existing methods taking into account various network parameters such as optimum number of uavs needed to cover the deployed area data transmission delay and received sinr.", "Pub Date": "2023-03-10"}