{"Title": "A Storage Optimization and Energy-Efficiency-Based Edge-Enabled Companion-Side eHealth Monitoring System for IoT-Based Smart Hospitals", "Doi": "10.1109/JIOT.2023.3298264", "Authors": ["n. gharaei", "y. d. al-otaibi", "s. j. malebary", "a. o. almagrabi"], "Key Words": ["body area network", "covid-19", "edge computing", "ehealth monitoring system", "energy efficiency", "smart hospital", "storage optimization"], "Abstract": "during the last few years due to the covid-19 pandemic there has been a significant development of ehealth monitoring systems. however most of the systems to date have been developed specifically for patient monitoring by nurses physicians and specialists. to keep attendants informed about the health status of their patients in the hospitals we are developing an edge enabled companion side ehealth monitoring system for smart hospitals based on the internet of things  iot . in most existing edge enabled ehealth monitoring systems the utilized edge devices have limited storage capacity and energy resources resulting in network outages and loss of data packets. although these challenges lead to life threatening problems much less attention has been paid to these shortcomings in the previous work. therefore we first deploy edge enabled health evaluators to receive the medical signals from the biosensors in each unit of time and evaluate the health status of the patients. then each evaluator generates and stores only one health number instead of caching the data from all sensor nodes which increases the storage efficiency. we also employ a wireless mobile charger  wmc  to charge the batteries of the health evaluators. unlike previous work the different attributes of the wmc are individually optimized to achieve different objectives resulting in improved network performance and efficiency of the wmc. experimental results show that the performance of the proposed system is better than other solutions by 99% in cloud storage optimization 83% in edge storage optimization 23% in end to end delay and 10% in energy efficiency of edge devices.", "Pub Date": "2024-01-08"}