{"Title": "A Surrogate-Assisted Evolutionary Framework With Regions of Interests-Based Data Selection for Expensive Constrained Optimization", "Authors": ["z. song", "h. wang", "y. jin"], "Pub Date": "2023-09-15", "Abstract": "optimization problems whose evaluations of the objective and constraints involve costly numerical simulations or physical experiments are referred to as expensive constrained optimization  eco  problems. such problems can be solved by evolutionary algorithms  eas  in conjunction with computationally cheap surrogates that separately approximate the expensive objective and constraint functions. during the process of the eco the interested regions of surrogate models for the objective and constraints usually have a small overlap only. specifically the surrogate model for the objective function should focus on the prediction accuracy in the promising region while the models for constraint functions should concentrate on the accuracy at the boundary of the feasible region. however most existing methods neglect such differences and train those different models using the same training data barely resulting in satisfactory performance. therefore we propose a general framework for solving expensive optimization problems with inequality constraints. in the proposed framework the objective and constraints are separately trained with two different sets of training data to enhance the prediction accuracy and reliability in the interested regions. a novel infill sampling criterion is tailored to decide whether potentially better or more uncertain solutions should be sampled. moreover a new strategy termed search intensity adjustment is designed for adjusting the number of search generations on new surrogate models. we attempt to embed three competitive constrained eas into our framework to verify its generality. the experimental results obtained on numerous benchmark functions from cec2006 cec2010 and cec2017 have demonstrated the superiority of our approach over three state of the art surrogate assisted eas.", "Doi": "10.1109/TSMC.2023.3281822", "Key Words": ["data selection", "expensive constrained optimization (eco) framework", "search intensity control", "surrogate model"]}