{"Title": "A Survey on Securing Federated Learning: Analysis of Applications, Attacks, Challenges, and Trends", "Doi": "10.1109/ACCESS.2023.3269980", "Authors": ["h. n. c. neto", "j. hribar", "i. dusparic", "d. m. f. mattos", "n. c. fernandes"], "Key Words": ["federated learning", "machine learning", "collaborative learning", "information security", "multiaccess edge computing"], "Abstract": "the growth of data generation capabilities facilitated by advancements in communication and computation technologies as well as the rise of the internet of things  iot  results in vast amounts of data that significantly enhance the performance of machine learning models. however collecting all necessary data to train accurate models is often unfeasible due to privacy laws. federated learning  fl  evolved as a collaborative machine learning approach for training models without sharing private data. unfortunately several in design vulnerabilities have been exposed allowing attackers to infer private data of participants and negatively impacting the performance of the federated model. in light of these challenges and to encourage the development of fl solutions this paper provides a comprehensive analysis of secure fl proposals that both protect user privacy and enhance the performance of the model. we performed a systematic review using predefined criteria to screen and extract data from multiple electronic databases resulting in a final set of studies for analysis. through the systematic review methodology the paper groups the security vulnerabilities of fl into model performance and data privacy attacks. it also presents an analysis and comparison of potential mitigation strategies against these attacks. additionally the paper conducts a security analysis of state of the art fl applications and proposals based on the vulnerabilities addressed. finally the paper outlines the main applications of secure fl and lists future research challenges. the survey highlights the crucial role of security strategies in ensuring the protection of user privacy and model performance in the context of future fl applications.", "Pub Date": "2023-05-04"}