{"Title": "A Survey on Secure and Private Federated Learning Using Blockchain: Theory and Application in Resource-Constrained Computing", "Doi": "10.1109/JIOT.2023.3313055", "Authors": ["e. moore", "a. imteaj", "s. rezapour", "m. h. amini"], "Key Words": ["blockchain", "federated learning (fl)", "privacy", "resource limitations", "security"], "Abstract": "federated learning  fl  has gained widespread popularity in recent years due to the fast booming of advanced machine learning and artificial intelligence along with emerging security and privacy threats. federated learning  fl  enables efficient model generation from local data storage of the edge devices without revealing the sensitive data to any entities. while this paradigm partly mitigates the privacy issues of users‚äô sensitive data the performance of the fl process can be threatened and reach a bottleneck due to the growing cyber threats and privacy violation techniques. to expedite the proliferation of the fl process the integration of blockchain for fl environments has drawn increasing attention from academia and industry. blockchain has the potential to prevent security and privacy threats with its decentralization immutability consensus and transparency characteristics. however if the blockchain mechanism requires costly computational resources then the resource constrained fl clients cannot be involved in the training. considering that this survey focuses on reviewing the challenges solutions and future directions for the successful deployment of blockchain in resource constrained fl environments. we comprehensively review variant blockchain mechanisms suitable for the fl process and discuss their tradeoffs for a limited resource budget. furthermore we extensively analyze the cyber threats that could be observed in a resource constrained fl environment and how blockchain can play a key role in blocking those cyberattacks. to this end we highlight some potential solutions for the coupling of blockchain and fl that can offer high levels of reliability data privacy and distributed computing performance.", "Pub Date": "2023-12-11"}