{"Title": "A Survey of Cloud-Enabled GIS Solutions Toward Edge Computing: Challenges and Perspectives", "Doi": "10.1109/OJCOMS.2023.3344198", "Authors": ["f. franchi", "f. graziosi", "e. d. fina", "a. galassi"], "Key Words": ["cloud", "mec", "gis", "cloud-edge computing", "smart communities", "survey"], "Abstract": "geographical information system  gis  as an information system  is  helps public private organizations represent changes in natural human context and discover patterns relationships for social and economic progress through the examination of spatial non spatial data. in gis applications like smart communities services rapid updating of great amount of data and expenditure of resources  hardware human financial  are significant making traditional analysis on a single computer impractical due to computing limitations. over the years gis has transformed from a tool that merely visualizes data to one that can model future scenarios. so at first cloud computing  cc  emerged as an internet based paradigm offering dynamic and scalable solutions. then a new ecosystem has been defined multi access edge computing  mec  enabling cc capabilities and information technology  it  services environment to the edge of the network running applications and performing related processing tasks closer to the customers. in this way network congestion is reduced and applications perform better. therefore a transition from cc to mec is recommended for gis. in this survey we provide a clear and structured overview of gis applications proposed to date who is using gis and for what to take advantage of its capabilities from integration with emerging technologies cc first and mec later critically considering the problems strengths and challenges inherent in these approaches to support intelligent resource management and to fully grasp the opportunity offered by fifth generation  5g  connectivity. the survey concludes by presenting some recommendations and future research directions.", "Pub Date": "2024-01-05"}