{"Title": "A Survey on UAV-Aided Maritime Communications: Deployment Considerations, Applications, and Future Challenges", "Doi": "10.1109/OJCOMS.2022.3225590", "Authors": ["n. nomikos", "p. k. gkonis", "p. s. bithas", "p. trakadas"], "Key Words": ["maritime communications", "maritime internet of things (iot)", "sixth-generation (6g) mobile communication networks", "space-air-ground-sea integrated networks", "underwater iot", "unmanned aerial vehicles (uavs)"], "Abstract": "maritime activities represent a major domain of economic growth with several emerging maritime internet of things use cases such as smart ports autonomous navigation and ocean monitoring systems. the major enabler for this exciting ecosystem is the provision of broadband low delay and reliable wireless coverage to the ever increasing number of vessels buoys platforms sensors and actuators. towards this end the integration of unmanned aerial vehicles  uavs  in maritime communications introduces an aerial dimension to wireless connectivity going above and beyond current deployments which are mainly relying on shore based base stations with limited coverage and satellite links with high latency. considering the potential of uav aided wireless communications this survey presents the state of the art in uav aided maritime communications which in general are based on both conventional optimization and machine learning aided approaches. more specifically relevant uav based network architectures are discussed together with the role of their building blocks. then physical layer resource management and cloud edge computing and caching uav aided solutions in maritime environments are discussed and grouped based on their performance targets. moreover as uavs are characterized by flexible deployment with high re positioning capabilities studies on uav trajectory optimization for maritime applications are thoroughly discussed. in addition aiming at shedding light on the current status of real world deployments experimental studies on uav aided maritime communications are presented and implementation details are given. finally several important open issues in the area of uav aided maritime communications are given related to the integration of sixth generation  6g  advancements. these future challenges include physical layer aspects non orthogonal multiple access schemes radical learning paradigms for swarms of uavs and unmanned surface and underwater vehicles as well as uav aided edge computing and caching.", "Pub Date": "2023-01-06"}