{"Title": "A Water Monitoring System for Proton Exchange Membrane Fuel Cells Based on Ultrasonic Lamb Waves: An Ex Situ Proof of Concept", "Authors": ["z. dou", "b. fang", "l. tropf", "h. hoster", "h. schmidt", "j. czarske", "d. weik"], "Pub Date": "2023-11-14", "Abstract": "up to date the efficiencies of proton exchange membrane fuel cells  pemfcs  are limited by the water flooding issue. water monitoring systems which are a crucial step to overcoming these flooding related problems are mostly either invasive or compromise on the temporal resolution and field of view. thus we propose an ultrasonic lamb waves based real time and nondestructive water monitoring system. briefly ultrasonic transducers are mounted on the back side of bipolar plates  bpps  exciting lamb waves along flow channels incorporated in bpps. echo signals from water droplets in the channels are also received by the transducers. thus with the knowledge of lamb wave propagation velocity water droplets are spatially resolved by the time of flight of each droplet echo. meanwhile the energy of each droplet induced echo wave packet is used to quantify the local flooding status. we have implemented a flexible and generic system adaptable to various flow field designs. the working principle was demonstrated for ex situ conditions with a bpp with a 25 cm2 active area. a water sensitivity of at least 50 nl was realized allowing for studying droplet and slug flows in pemfcs. a 1.3 mm spatial resolution and a 2 khz temporal resolution were simultaneously achieved. the high performance water monitoring opens new horizons to study dynamic water evolution in channels of pemfcs using cost effective instrumentation which may pave the way toward more efficient high power pemfcs with increased lifetimes.", "Doi": "10.1109/TIM.2023.3329101", "Key Words": ["cross correlation", "echo localization", "flooding issue", "low-temperature proton exchange membrane fuel cell (pemfc)", "ultrasonic flow field measurement", "ultrasonic lamb wave"]}