{"Title": "Accurate and Efficient Federated-Learning-Based Edge Intelligence for Effective Video Analysis", "Doi": "10.1109/JIOT.2023.3241039", "Authors": ["l. xu", "h. sun", "h. zhao", "w. zhang", "h. ning", "h. guan"], "Key Words": ["edge intelligence", "federated learning", "misdetection", "object detection", "video analysis"], "Abstract": "video data is the biggest iot data which is challenging for effective analysis with good performance. object misdetection is usually inevitable in edge based distributed cross scene video analysis. traditional centralized model training can potentially result in edge data leakage. even though joint model can be trained with federated learning while maintaining data privacy the size of gradient data transmitted is large for computer vision models used. to address these problems this article proposed an accurate and efficient federated learning based edge intelligence for effective video analysis method called eieva aefl. in eieva aefl a federation misdetection reinforcement network  fmrn  is designed to alleviate the misdetection problem. fmrn contains a vanilla object detection network and a misdetection reinforcement branch which finetunes object detection via feature re extraction to reduce object misdetection. to reduce the communication cost in training an efficient federated learning strategy is designed. in this strategy an oscillation suppression loss function is proposed to suppress the loss fluctuation resulting from data on edge clients. average accuracy and recall increase 0.5 and 0.7 with fmrn on the microsoft common objects in context  ms coco  data set respectively and with improvements of 4.5 and 5.5 with fmrn on our self made mis detection data set respectively. eieva aefl can reduce the training speed on the premise of ensuring the accuracy of the model. the model parameters data amount transmission delay and convergence epochs on eieva aefl model training are reduced by 78% 89% 84% and 36% respectively.", "Pub Date": "2023-07-06"}