{"Title": "Accurate Anomaly Detection With Energy Efficiency in IoT‚ÄìEdge‚ÄìCloud Collaborative Networks", "Doi": "10.1109/JIOT.2023.3273542", "Authors": ["y. li", "z. zhou", "x. xue", "d. zhao", "p. c. k. hung"], "Key Words": ["anomaly detection", "boundary refinement", "energy efficiency", "internet of things (iot)‚äìedge‚äìcloud networks"], "Abstract": "with the applicability of edge intelligence in various domains anomaly detection which aims to identify unusual and infrequent circumstances is regarded as a regularly performed task to guarantee the health of the internet of things  iot  applications. generally sensory data are gathered at the network edge and completely transmitted to the cloud where computational heavy algorithms are mostly adopted to determine the locations of anomaly. considering the occurrence infrequency of anomalies this strategy may transmit relatively huge volume of sensory data which may reflect a healthy situation indeed to the cloud. to mitigate this problem this article proposes an accurate anomaly detection mechanism with energy efficiency in three tier iot‚äìedge‚äìcloud collaborative networks. specifically after gathering sensory data provided by iot nodes in certain edge networks the edge node applies the marching squares algorithm to generate isopleths where an isopleth may capture the boundary of anomaly. a sensory data filtering mechanism is conducted at the edge tier such that anomaly relevant sensory data are transmitted to the cloud and thus the network traffic is decreased significantly. thereafter the boundary of anomaly is obtained and the locations of candidate boundary nodes are determined by adopting the kriging spatial interpolation algorithm at the cloud tier. these locations are traversed by mobile sensing nodes at edge networks and their sensory data are gathered for boundary refinement. extensive experiments are conducted on an air quality hazardous gas data set from toward data science and evaluation results show that our technique outperforms the state of the art counterparts in boundary accuracy and energy consumption.", "Pub Date": "2023-09-22"}