{"Title": "Active Multiview Fusion Framework for SAR Automatic Target Recognition", "Authors": ["x. tong", "y. wang"], "Pub Date": "2024-01-04", "Abstract": "multiview fusion algorithms have been widely applied in synthetic aperture radar automatic target recognition  sar atr . however these algorithms usually assume that multiple views are strongly correlated and thus completely fuse them. by doing this they fail to explore the weak correlations among multiple views caused by redundant views under realistic scenarios thereby reducing recognition accuracy. to tackle this problem we propose an active multiview fusion  amvf  framework which includes two parts  subdictionary based spatial temporal adversarial sparse representation  sstasr  and sparse code based reinforcement learning  scrl . specifically sstasr involves the view specific view spatial temporal and view adversarial loss terms. among them the view specific loss term utilizes subdictionary to convert multiple views into the sparse codes the view spatial temporal loss term explores the spatial and temporal correlations among multiple views and the view adversarial loss term increases the gap among multiple views. these three loss terms are jointly optimized to acquire the sparse codes of multiple views. then scrl accumulates rewards designed by the acquired sparse codes when it selects views. afterward scrl maximizes the accumulated reward by optimizing the view selection policy according to reinforcement learning. finally we utilize the optimal view selection policy to actively select highly correlated views to fuse for recognition therefore eliminating the redundant views and considering the weak correlations among multiple views. the results demonstrate that amvf achieves better recognition performance than other advanced algorithms under various scenarios.", "Doi": "10.1109/TIM.2023.3341140", "Key Words": ["active multiview fusion (amvf)", "automatic target recognition (atr)", "reinforcement learning", "sparse representation (sr)"]}