{"Title": "Adaptive Storage Optimization Scheme for Blockchain-IIoT Applications Using Deep Reinforcement Learning", "Doi": "10.1109/ACCESS.2022.3233474", "Authors": ["n. k. akrasi-mensah", "a. s. agbemenu", "h. nunoo-mensah", "e. t. tchao", "a. -r. ahmed", "e. keelson", "a. sikora", "d. welte", "j. j. kponyo"], "Key Words": ["blockchain", "iiot", "reinforcement learning", "scalability", "storage efficiency", "storage optimization"], "Abstract": "blockchain iiot integration into industrial processes promises greater security transparency and traceability. however this advancement faces significant storage and scalability issues with existing blockchain technologies. each peer in the blockchain network maintains a full copy of the ledger which is updated through consensus. this full replication approach places a burden on the storage space of the peers and would quickly outstrip the storage capacity of resource constrained iiot devices. various solutions utilizing compression summarization or different storage schemes have been proposed in literature. the use of cloud resources for blockchain storage has been extensively studied in recent years. nonetheless block selection remains a substantial challenge associated with cloud resources and blockchain integration. this paper proposes a deep reinforcement learning  drl  approach as an alternative to solving the block selection problem which involves identifying the blocks to be transferred to the cloud. we propose a drl approach to solve our problem by converting the multi objective optimization of block selection into a markov decision process  mdp . we design a simulated blockchain environment for training and testing our proposed drl approach. we utilize two drl algorithms advantage actor critic  a2c  and proximal policy optimization  ppo  to solve the block selection problem and analyze their performance gains. ppo and a2c achieve 47.8% and 42.9% storage reduction on the blockchain peer compared to the full replication approach of conventional blockchain systems. the slowest drl algorithm a2c achieves a run time 7.2 times shorter than the benchmark evolutionary algorithms used in earlier works which validates the gains introduced by the drl algorithms. the simulation results further show that our drl algorithms provide an adaptive and dynamic solution to the time sensitive blockchain iiot environment.", "Pub Date": "2023-01-06"}