{"Title": "Adaptive Video Streaming in Multi-Tier Computing Networks: Joint Edge Transcoding and Client Enhancement", "Doi": "10.1109/TMC.2023.3263046", "Authors": ["s. wang", "j. yang", "s. bi"], "Key Words": ["adaptive video streaming", "deep reinforcement learning", "edge computing", "video enhancement", "video transcoding"], "Abstract": "with the advancement of multimedia technology and wireless networks there is a growing demand for high quality video streaming. delivering stable video streaming in extremely dynamic wireless networks nevertheless is still an open problem. recent developments in client computing and mobile edge computing  mec  technologies have both shown promise in enhancing the adaptive bitrate  abr  streaming services. in this paper we consider a video streaming system in multi tier computing networks enabled by joint edge side video transcoding and client side video enhancement. by ‚äúenhancement‚äù we mean that the client improves the video chunk quality via client side image processing modules. in particular we aim to design a joint bitrate adaptation edge transcoding and client image processing algorithm maximizing the quality of experience  qoe  of streaming services. the majority of the prior art has concentrated on super resolution enabled video streaming. contrarily we show that the video enhancement method outperforms the super resolution approach in terms of signal to noise ratio and frames per second implying a superior alternative for client side processing in abr streaming. we formulate the problem as an event triggered markov decision process  e mdp  and propose a deep reinforcement learning  drl  based framework named edtea. to deal with the delayed feedback induced by multi tier computing the entropy and the expected re buffering terms are introduced to the objective and the reward respectively. extensive simulations based on real world videos and bandwidth traces manifest that compared with state of the art approaches edtea provides $10.4\\%\\sim 78.4\\%$10.4%‚àº78.4% extra qoe while reducing re buffering time by $85.5\\%\\sim 91.7\\%$85.5%‚àº91.7%.", "Pub Date": "2024-03-07"}