{"Title": "Adaptive and Priority-Based Resource Allocation for Efficient Resources Utilization in Mobile-Edge Computing", "Doi": "10.1109/JIOT.2021.3111838", "Authors": ["z. sharif", "l. t. jung", "i. razzak", "m. alazab"], "Key Words": ["adaptive resource allocation", "fog computing", "mobile-edge computing (mec)", "optimized resource utilization", "priority-based requests", "resource management"], "Abstract": "edge computing  ec  offers cloud like services at the edge of mobile networks to satisfy the delay sensitive and rapid computation applications in meeting the demands of rapidly increasing mobile devices and other internet of things. ec is known to be constrained with limited resources that its efficacy greatly depends on an effective and efficient resource allocation to provide optimal resource utilization. focusing on the fact this article presents an adaptive resource allocation mechanism abbreviated as a pbra for effective resources utilization in the ec paradigm. to realize optimal utilization the available resources are allocated dynamically  adaptability  by considering the nature of the incoming requests. the proposed scheme shall adapt to the resource demands and priorities of the incoming requests. after identifying the received request which can be either the priority based or normal request each of them is processed with three possibilities. the available resources are thus allocated as per the priorities of the incoming requests to satisfy the constraints accordingly. the proposed mechanism is adaptable to a maximum number of incoming requests along with optimizing the utilization of limited resources at the edge node. extensive simulations were performed through ifogsim to evaluate the performance of the proposed method. critical comparisons were made against closely related algorithms and techniques i.e. the novel bioinspired hybrid algorithm and the cora gt. the simulation results from the proposed scheme optimistically showing that it performed better in terms of resources utilization average response time task execution time and energy consumption.", "Pub Date": "2023-02-06"}