{"Title": "Adaptively Attentional Feature Fusion Oriented to Multiscale Object Detection in Remote Sensing Images", "Authors": ["w. zhao", "y. kang", "h. chen", "z. zhao", "z. zhao", "y. zhai"], "Pub Date": "2023-03-03", "Abstract": "currently reliable and accurate object detection in high resolution remote sensing images still faces significant challenges such as color aspect ratio complex background and scale variations. even the detection results obtained based on the latest convolutional neural network  cnn  methods are not satisfactory. to obtain more accurate detection results from large scale remote sensing images we proposed a multiscale object detection algorithm oriented to adaptively attentional feature fusion based on the yolox algorithm. first a multiscale attentional feature fusion  msaff  structure was added to the yolox network to increase the perceptual field and aggregate the contextual information to obtain a feature map with richer semantic information. second an adaptively spatial feature fusion  asff  structure was introduced to process the fused feature maps to which spatial feature weights were assigned at different levels to enhance the feature representation of remote sensing objects and reduce feature loss. finally the aligned convolutional  align conv  network was used in the object classification and localization task to achieve a more accurate localization of densely arranged objects with arbitrary orientation. the algorithm proposed in this article was extensively experimented on the pascal voc and the dior datasets and the average accuracy reached 89.2% and 75.3% respectively. compared with some current mainstream two stage and one stage object detection algorithms the experimental results demonstrated that our method performed well in both accuracy and speed. at the same time it reduced the leakage rate of remote sensing objects to a certain extent.", "Doi": "10.1109/TIM.2023.3246536", "Key Words": ["adaptively attentional feature fusion", "aligned convolutional (align conv) network", "feature representation", "high-resolution remote sensing images", "object detection", "yolox"]}