{"Title": "Advances in Modeling of Noisy Quantum Computers: Spin Qubits in Semiconductor Quantum Dots", "Authors": ["d. costa", "m. simoni", "g. piccinini", "m. graziano"], "Pub Date": "2023-09-19", "Abstract": "the new quantum era is expected to have an unprecedented social impact enabling the research of tomorrow in several pivotal fields. these perspectives require a physical system able to encode process and store for a sufficiently long amount of time the quantum information. however the optimal engineering of currently available quantum computers which are small and flawed by several non ideal phenomena requires an efficacious methodology for exploring the design space. hence there is an unmet need for the development of reliable hardware aware simulation infrastructures able to efficiently emulate the behaviour of quantum hardware that commits to looking for innovative systematic ways with a bottom up approach starting from the physical level moving to the device level and up to the system level. this article discusses the development of a classical simulation infrastructure for semiconductor quantum dot quantum computation based on compact models where each device is described in terms of the main physical parameters affecting its performance in a sufficiently easy way from a computational point of view for providing accurate results without involving sophisticated physical simulators thus reducing the requirements on cpu and memory. the effectiveness of the involved approximations is tested on a benchmark of quantum circuits ‚äî in the expected operating ranges of quantum hardware ‚äî by comparing the corresponding outcomes with those obtained via numeric integration of the schr√∂dinger equation. the achieved results give evidence that this work is a step forward towards the definition of a classical simulator of quantum computers.", "Doi": "10.1109/ACCESS.2023.3312559", "Key Words": ["models", "nisq", "noise", "noisy intermediate scale quantum computers", "heterostructures", "quantum computing", "semiconductor quantum dots", "simulation"]}