{"Title": "Advancing Twitter Sentiment Analysis: An Ensemble Approach with Transformer-XL, RoBERTa, and XGBoost", "Doi": "10.1109/ICSSAS57918.2023.10331828", "Authors": ["p. tumuluru", "s. s. hussain", "l. kankanala", "s. shoaib", "d. madhu", "c. n. kumar"], "Key Words": ["social media", "sentiment analysis", "natural language processing (nlp)", "transformer-xl-roberta-xgboost", "ensemble model"], "Abstract": "the emergence of social media has made it crucial to analyze and comprehend users' sentiments especially on platforms like twitter which provide real time data for sentiment analysis. this study proposes an innovative ensemble classifier model incorporating the latest advancements in natural language processing  nlp  and machine learning technologies such as transformer xl roberta and xgboost for twitter sentiment analysis. transformer xl is a state of the art language model that can capture long range dependencies in text data making it ideal for handling sequential data like tweets. roberta on the other hand is a variant of bert that leverages a larger dataset and training time resulting in improved performance in understanding the context and meaning of words in tweets. in addition to these powerful language models xgboost an efficient gradient boosting framework is integrated into the ensemble. xgboost is renowned for its ability to handle complex interactions between features and has been successfully applied in various machine learning tasks. this study leverage a diverse and comprehensive dataset extending beyond covid-19 pandemic related tweets to train the ensemble classifier model. it ensures the transformer xl roberta xgboost ensemble model versatility and generalizability for sentiment analysis across different contexts by including tweets from various domains and topics. proposed experimental results demonstrates that the proposed ensemble classifier model exceeds individual classifiers with accuracy precision recall and f1 score. incorporating advanced nlp techniques and the power of xgboost enables the ensemble model to achieve higher accuracy and better performance in sentiment analysis on twitter data. by harnessing the potential of cutting edge technologies the study gains valuable insights into user sentiments which can benefit various applications including market analysis brand perception monitoring and social trend tracking.", "Pub Date": "2023-12-06"}