{"Title": "Aerial-Aided Multiaccess Edge Computing: Dynamic and Joint Optimization of Task and Service Placement and Routing in Multilayer Networks", "Doi": "10.1109/TAES.2022.3217430", "Authors": ["j. von mankowski", "e. durmaz", "a. papa", "h. vijayaraghavan", "w. kellerer"], "Key Words": ["aeronautical communications", "low-latency", "multiaccess edge computing (mec)", "multilayer network (mln)"], "Abstract": "5g feature of ubiquity in network coverage is expected to be extended to the computing domain in 6g. to accomplish ubiquity in communication and computation integration of satellite aerial and terrestrial networks is foreseen. in particular the rising amount of applications such as in flight entertainment and connectivity services  ifecs  and software defined networking enabled satellites renders network management more challenging. moreover the stringent quality of service  qos  demands of these applications require edge computing. network performance can be boosted by considering components of the aerial network as potential multi access edge computing  mec  nodes. thus to cater to the qos critical applications we propose an aerial aided multi access edge computing  aa mec  architecture that provides a framework for optimal management of computing resources and internet based services in the sky. furthermore we formulate optimization problems to minimize the network latency for the two use cases of providing ifecs to aircrafts and services for offloading ai ml tasks from satellites. due to the dynamicity of satellite and aerial networks we propose a re configurable optimization. for this transforming network we continuously identify the optimal mec node for each application and the optimal path to the destination mec node. in summary our results demonstrate that using aa mec improves network latency performance by 10.43% compared to the traditional approach of using only terrestrial mec nodes for latency critical applications such as online gaming. furthermore while comparing our proposed dynamic approach with a static one we record a minimum of 6.7% decrease in flow latency for ifecs and 56.03% decrease for computation offloading.", "Pub Date": "2023-06-08"}