{"Title": "Affective Computing: A Topic-Based SER Approach on Collaborative Discussions in Academic Setting", "Doi": "10.1109/FIE58773.2023.10342963", "Authors": ["n. dehbozorgi", "m. t. kunuku"], "Key Words": ["speech emotion recognition (ser)", "large language models (llm)", "nlp", "topic modeling", "affective computing", "chatgpt api", "teamwork", "engineering education"], "Abstract": "one of the biggest concerns in the modern day especially in the educational domain centers on the student mental health. high rates of anxiety and depression have especially brought the attention of researchers in engineering education to apply affective computing to help with students' academic performance. it is known that a person emotional states cause physiological and physical changes in the body. emotions may impact facial expression tone of speech blood pressure pulse etc. since visual and auditory signals are two variables that can be measured without the need to attach any physical device to the individuals they are most studied in this field. speech in particular has been known as a means that transfers much information about the mental and emotional states of the person. speech emotion recognition  ser  is a growing field that has been applied in several domains including engineering education. recent advancements in artificial intelliegence natural language understanding  nlu  and large language models  large language model  have significantly streamlined this line of research. in this work which is a continuation of our prior work we propose a speech analysis model that extracts both the emotions and topics from verbal discussions in a computer science classroom to understand if the expressed emotions were mostly about the course related topics or not. the goal of this research is to develop a tool that helps educators gain insights into the students' emotional states in teamwork and also understand the context of their conversations. we further analyze if the expressed emotions in the verbal class discussions are mostly about the course content or other subjects outside class setting. to expand the emotion analysis module we added a new layer to our developed pipeline by passing the speech data into the chatgpt application programming interface to generate summarized scripts and extract additional classes of emotion. the preliminary results from this study are promising indicating the potential value of this research direction and its prospects for further development. application of this model in the educational domain can greatly benefit both educators and students and allows the instructors to make necessary interventions needed to maximize students' positive experiences in team settings while considering their emotional states.", "Pub Date": "2024-01-05"}