{"Title": "Age-of-Information-Based Computation Offloading and Transmission Scheduling in Mobile-Edge-Computing-Enabled IoT Networks", "Doi": "10.1109/JIOT.2023.3283287", "Authors": ["y. jiang", "j. liu", "i. humar", "m. chen", "s. a. alqahtani", "m. s. hossain"], "Key Words": ["age of information (aoi)", "dueling double deep q network (d3qn)", "internet of things (iot)", "transmission scheduling"], "Abstract": "the emergence of mobile edge computing  mec  technology has deployed edge clouds with strong computing capabilities closer to internet of thing  iot  devices which can effectively meet the demands for computing power and latency. however in addition to the stringent latency requirements more and more emerging iot applications also have higher standards for the freshness and timeliness of collected information. in order to ensure the freshness and high information value in iot system we propose an age of information  aoi  based optimization strategy for computation offloading and transmission scheduling. the strategy considers the aoi during the transmission phase and the execution phase respectively under the constraints of delay and remaining energy. then a joint optimization model is established based on the comprehensive benefits of aoi and computation rate. to address the strong coupling between the offloading decision and the transmission decision the original optimization problem is divided into two stages. by the use of the deep deterministic policy gradient  ddpg  algorithm and the dueling double deep  $q$  network  d3qn  algorithm the solution is obtained in terms of the offloading decision and transmission scheduling decision respectively. the proposed joint optimization strategy considers the impact of the transmission decision on the offloading decision and is adaptable to the dynamic changes in the channel connection between the edge cloud and the user due to user mobility. experimental results show that compared with other offloading and transmission strategies the proposed approach has higher overall system revenue and lower aoi.", "Pub Date": "2023-10-30"}