{"Title": "Age-Aware Data Selection and Aggregator Placement for Timely Federated Continual Learning in Mobile Edge Computing", "Doi": "10.1109/TC.2023.3333213", "Authors": ["z. xu", "l. wang", "w. liang", "q. xia", "w. xu", "p. zhou", "o. f. rana"], "Key Words": ["mobile edge computing", "federated continual learning", "data selection and aggregator placement", "approximation and online algorithms"], "Abstract": "federated continual learning  fcl  is emerging as a key technology for time sensitive applications in highly adaptive environments including autonomous driving and industrial digital twin. each fcl trains machine learning models using newly generated datasets as soon as possible to obtain a highly accurate machine learning model for new event predictions. the age of data defined as the time difference between the generation time of a dataset and the current time is widely adopted as a key criterion to evaluate both timeline and quality of training. in this paper we study the problem of age aware fcl in a mobile edge computing  mec  network. we not only investigate optimization techniques that optimize the data selection and aggregator placement for fcl but also implement a real system as a prototype for age aware fcl. specifically we first propose an approximation algorithm with a provable approximation ratio for the age aware data selection and aggregator placement problem for fcl with a single request. in real application scenarios there are usually multiple fcl requests that require to train models and delays in the mec network are usually uncertain. we then study the problem of age aware data selection and aggregator placement problem for fcl with uncertain delays and multiple requests by devising an online learning algorithm with a bounded regret based on contextual bandits. we finally implement a prototype for fcl in an mec network with various heterogeneous user equipments  ues  and cloudlets with different computing capabilities in the network. experiment results show that the performance of the proposed algorithms outperform existing studies by achieving 47% lower age of data and 12% higher model accuracy.", "Pub Date": "2024-01-15"}