{"Title": "Airborne Computing: A Toolkit for UAV-Assisted Federated Computing for Sustainable Smart Cities", "Doi": "10.1109/JIOT.2023.3292308", "Authors": ["k. hayawi", "z. anwar", "a. w. malik", "z. trabelsi"], "Key Words": ["fog computing", "smart cities", "task offloading", "unmanned aerial vehicle (uav) swarm"], "Abstract": "smart vehicles are equipped with onboard computing units designed to run in vehicle applications. however due to limited computing power the onboard units are unable to execute compute intensive tasks and those that require near real time processing. therefore tasks are offloaded to nearby fog edge devices that have more powerful processors. however the fog devices are static placed at fixed locations such as intersections and have a limited communication range. therefore they can only facilitate vehicles in their immediate vicinity and only limited areas of the city can be covered to provide services on demand. in this article we propose an unmanned aerial vehicle  uav  based computing framework design termed skywalker to provide computing in regions where there are no static fog units thereby extending coverage. skywalker‚äôs contributions are threefold  1  it allows for load aware uav placement and provisions a swarm of uavs to fly to areas experiencing a gap in service where the size of the swarm is proportional to the demand  2  it implements multiple scheduling algorithms that the uavs swarm employs to divide up the task processing responsibility for individual uavs within the swarm  and 3  a zone based delivery mechanism is being proposed to facilitate the return of completed tasks either through direct delivery or relay based methods. the choice between these options depends on the distance covered by the requesting vehicle from the uav swarm. the efficiency of the framework is compared with existing techniques and it is found that it can greatly extend coverage during peak traffic hours while providing low communication delay and consuming minimum energy.", "Pub Date": "2023-10-19"}