{"Title": "AlignBodyNet: Deep Learning-Based Alignment of Non-Overlapping Partial Body Point Clouds From a Single Depth Camera", "Authors": ["p. hu", "e. s. l. ho", "a. munteanu"], "Pub Date": "2023-01-16", "Abstract": "this article proposes a novel deep learning framework to generate omnidirectional 3 d point clouds of human bodies by registering the front  and back facing partial scans captured by a single depth camera. our approach does not require calibration assisting devices canonical postures nor does it make assumptions concerning an initial alignment or correspondences between the partial scans. this is achieved by factoring this challenging problem into  1  building virtual correspondences for partial scans and 2  implicitly predicting the rigid transformation between the two partial scans via the predicted virtual correspondences. in this study we regress the skinned multi person linear model  smpl  vertices from the two partial scans for building virtual correspondences. the main challenges are  1  estimating the body shape and pose under clothing from single partially dressed body point clouds and 2  the predicted bodies from the front  and back facing inputs required to be the same. we thus propose a novel deep neural network  dnn  dubbed alignbodynet that introduces shape interrelated features and a shape constraint loss for resolving this problem. we also provide a simple yet efficient method for generating real world partial scans from complete models which fills the gap in the lack of quantitative comparisons based on real world data for various studies including partial registration shape completion and view synthesis. experiments based on synthetic and real world data show that our method achieves state of the art performance in both objective and subjective terms.", "Doi": "10.1109/TIM.2022.3222501", "Key Words": ["3-d scanning", "deep learning on point clouds", "iterative closest point (icp)", "non-overlapping registration", "partial registration", "virtual correspondence"]}