{"Title": "Alignment of Quality Models for Assessing Software Requirements in Large-scale Projects: A Case from Space", "Doi": "10.1109/ICE/ITMC58018.2023.10332295", "Authors": ["p. beyersdorffer", "j. m√ºnch", "m. kuhrmann"], "Key Words": ["quality attribute", "quality model", "quality assessment", "software requirements specification", "aerospace"], "Abstract": "large critical systems such as those created in the space domain are usually developed by a large number of organizations and furthermore they have to comply with standards. yet the different stakeholders often do not have a common understanding of the needed quality of requirements specifications. achieving such a common understanding is a laborious process that is currently not sufficiently supported. moreover such a common understanding must be aligned with the standards. in this paper we present an approach that can be used to align the different stakeholder perceptions regarding the quality of requirements specifications. existing quality models for requirements specifications are analyzed for equivalences and transferred into a common representation the so called aligned quality map  aqm . furthermore a process is defined that supports the alignment of different stakeholder perspectives with regard to the quality of requirements specifications using aqm which is validated in a case study in the context of european space projects. aqm has been created and populated with an initial set of quality models. it is designed in such way that it can be extended to include further quality models. the case study has shown that an alignment of different stakeholder perspectives and the quality model of the european cooperation for space standardization using aqm is feasible. the approach allows for aligning different stakeholder perspectives for a common understanding of the quality of requirements specifications in the context of standards. furthermore aqm supports the assessment of requirements specifications.", "Pub Date": "2023-12-04"}