{"Title": "ALIVE: A Latency- and Cost-Aware Hybrid P2P-CDN Framework for Live Video Streaming", "Doi": "10.1109/TNSM.2023.3335190", "Authors": ["r. farahani", "e. √áetinkaya", "c. timmerer", "m. shojafar", "m. ghanbari", "h. hellwagner"], "Key Words": ["http adaptive streaming (has)", "edge computing", "network function virtualization (nfv)", "content delivery network (cdn)", "peer-to-peer (p2p)", "quality of experience (qoe)", "video transcoding", "video super-resolution"], "Abstract": "recent years have witnessed video streaming demands evolve into one of the most popular internet applications. with the ever increasing personalized demands for high definition and low latency video streaming services network assisted video streaming schemes employing modern networking paradigms have become a promising complementary solution in the http adaptive streaming  has  context. the emergence of such techniques addresses long standing challenges of enhancing users‚äô quality of experience  qoe  end to end  e2e  latency as well as network utilization. however designing a cost effective scalable and flexible network assisted video streaming architecture that supports the aforementioned requirements for live streaming services is still an open challenge. this article leverages novel networking paradigms i.e. edge computing and network function virtualization  nfv  and promising video solutions i.e. has video super resolution  sr  and distributed video transcoding  tr  to introduce a latency  and cost aware hybrid p2p cdn framework for live video streaming  alive . we first introduce the alive multi layer architecture and design an action tree that considers all feasible resources  i.e. storage computation and bandwidth  provided by peers edge and cdn servers for serving peer requests with acceptable latency and quality. we then formulate the problem as a mixed integer linear programming  milp  optimization model executed at the edge of the network. to alleviate the optimization model‚äôs high time complexity we propose a lightweight heuristic namely greedy based algorithm  gba . finally we   ${i}$   design and instantiate a large scale cloud based testbed including 350 has players  ii  deploy alive on it and  iii  conduct a series of experiments to evaluate the performance of alive in various scenarios. experimental results indicate that alive   ${i}$   improves the users‚äô qoe by at least 22%  ii  decreases incurred cost of the streaming service provider by at least 34%  iii  shortens clients‚äô serving latency by at least 40%  iv  enhances edge server energy consumption by at least 31% and   ${v}$   reduces backhaul bandwidth usage by at least 24% compared to baseline approaches.", "Pub Date": "2024-04-15"}