{"Title": "AMBITION: Ambient Temperature Aware VM Allocation for Edge Data Centers", "Doi": "10.1109/ACCESS.2023.3292342", "Authors": ["s. h. choi", "s. y. kim", "y. g. kim", "j. kong", "s. w. chung"], "Key Words": ["ambient temperature", "computing capacity", "edge data centers", "heterogeneous servers", "vm allocation"], "Abstract": "edge data centers are increasingly deployed to improve response time of intelligent services. due to the high computing demands for such services edge data centers consume a considerable amount of power generating excessive heat. to mitigate thermal problems with a smaller cooling power edge data centers usually trigger software based thermal management techniques along with the air cooling systems. unfortunately the ambient temperature of servers often has a surge due to the consolidation of vms and heat propagation among components  e.g. cpu gpu memory unit disk etc. . higher ambient temperature further increases the on chip temperature invoking more frequent thermal throttling. to resolve thermal problems deteriorated by the ambient temperature in this paper we propose an ambient temperature aware vm allocation technique called ambition. considering the performance impact of ambient temperature ambition estimates the actual computing capacity of servers. based on the computing demands of vms ambition finds an appropriate server which has sufficient ambient aware computing capacity to run the vm  it allocates computation intensive vms to the servers with the higher ambient aware computing capacity and distributes memory intensive vms to the individual servers as much as possible. in our experiments on an edge data center ambition shows the execution time speedup of 50.3% on average  up to 73.8%  compared to a conventional vm allocation technique while saving system wide energy by 5.9%  up to 13.6% . at the expense of 5.8% speedup  from 50.3% to 44.5%  ambition further saves cooling power by 84.3% leading to 29.3% of total edge data center energy saving.", "Pub Date": "2023-07-13"}