{"Title": "An Adaptive Mechanism for Dynamically Collaborative Computing Power and Task Scheduling in Edge Environment", "Doi": "10.1109/JIOT.2021.3119181", "Authors": ["y. xu", "l. chen", "z. lu", "x. du", "j. wu", "p. c. k. hung"], "Key Words": ["collaborative task scheduling", "edge computing", "heterogeneous resources", "internet of everything (ioe)", "microservice caching"], "Abstract": "edge computing can provide high bandwidth and low latency service for big data tasks by leveraging the edge side‚äôs computing storage and network resources. with the development of microservice and docker technology service providers can flexibly and dynamically cache microservice at the edge side to respond efficiently with limited resources. automatically caching needed services on the nearest edge nodes and dynamically scheduling users‚äô requests can realize that computing power and software services flow with the users to provide continuous services. however achieving the goal needs to overcome many challenges such as the significant fluctuation of user devices‚äô requests at the edge side and the lack of collaboration among edge nodes. in this article dynamic computing power scheduling and collaborative task scheduling among edge nodes are comprehensively developed. the problem is considered a multiobjective optimization problem including sequentially minimizing the deadline missing rate of requests and the average task completion time. we propose an adaptive mechanism for dynamically collaborative computing power and task scheduling  adcs  in the edge environment to solve this problem. it adopts the greedy decision method to schedule computing tasks to meet their deadline requirements. at the same time it uses the best fit method to adjust the computing resources according to the changes of users‚äô requests. the simulation results show that adcs can decrease the deadline missing rate and reduce the average completion time. compared with dsr and codsr the deadline missing rate is reduced by 59.91% and 19.95% respectively. the average completion time is decreased by 37.87% and 6.71%.", "Pub Date": "2023-02-06"}