{"Title": "An Adaptive Network Security System for IoT-Enabled Maritime Transportation", "Doi": "10.1109/TITS.2022.3159450", "Authors": ["e. gyamfi", "j. a. ansere", "m. kamal", "m. tariq", "a. jurcut"], "Key Words": ["internet of things", "task offloading", "multi-access edge computing", "cloud computing", "maritime transport system", "intrusion detection"], "Abstract": "with the rapid growth of the internet of things  iot  applications in maritime transportation systems  mts  cyber attacks and challenges in data safety have also increased extensively. meanwhile the iot devices are resource constrained and cannot implement the existing security systems making them susceptible to various types of debilitating cyber attacks. the dynamics in the attack processes in iot enabled mts networks keep changing which makes a traditional offline or batch ml based attack detection systems intractable to apply. this paper provides a novel approach of using an adaptive incremental passive aggressive machine learning  ai paml  method to create a network attack detection system  nads  to protect the iot devices in an mts environment. in this paper we propose an nads that utilizes a multi access edge computing  mec  platform to provide computational resources to execute the proposed model at a network end. since online learning models face data saturation problems we present an improved approximate linear dependence and a modified hybrid forgetting mechanism to filter the inefficient data and keep the detection model up to date. the proposed data filtering ensures that the model does not experience a rapid increase in unwarranted data which affects the model‚äôs attack detection rate. a markov transition probability is applied to control the mec selection and data offloading process by the iot devices. the performance of the nads is verified using selected benchmark datasets and a realistic iot environment. experimental results demonstrate that ai paml achieves remarkable performance in the nads design for an mts environment.", "Pub Date": "2023-02-08"}