{"Title": "An Analytical Analysis of Text Stemming Methodologies in Information Retrieval and Natural Language Processing Systems", "Doi": "10.1109/ACCESS.2023.3332710", "Authors": ["a. jabbar", "s. iqbal", "m. i. tamimy", "a. rehman", "s. a. bahaj", "t. saba"], "Key Words": ["text stemming", "information retrieval (ir) systems", "text classification", "stemmer evaluation", "technological development", "natural language processing (nlp)"], "Abstract": "the exponential increase in textual unstructured digital data creates significant demand for advanced and smart stemming systems. as a preprocessing stage stemming is applied in various research fields such as information retrieval  ir  domain vocabulary analysis and feature reduction in many natural language processing  nlp . text stemming  ts  an important step can significantly improve performance in such systems. text stemming methods developed till now could be better in their results and can produce errors of different types leading to degraded performance of the applications in which these are used. this work presents a systematic study with an in depth review of selected stemming works published from 1968 to 2023. the work presents a multidimensional review of studied stemming algorithms i.e. methodology data source performance and evaluation methods. for this study we have chosen different stemmers which can be categorized as 1  linguistic knowledge based 2  statistical 3  corpus based 4  context sensitive and 5  hybrid stemmers. the study shows that linguistic knowledge based stemming techniques were widely used for highly inflected languages  such as arabic hindi and urdu  and have reported higher accuracy than other techniques. we compare and analyze the performance of various state of the art ts approaches including their issues and challenges which are summarized as research gaps. this work also analyzes different nlp applications utilizing stemming methods. at the end we list the future work directions for interested researchers.", "Pub Date": "2023-12-01"}