{"Title": "An Ambiguous Edge Detection Method for Computed Tomography Scans of Coronavirus Disease 2019 Cases", "Doi": "10.1109/TSMC.2023.3307393", "Authors": ["p. singh", "y. -p. huang"], "Key Words": ["ambiguous set (as)", "computed tomography (ct)", "covid-19", "edge detection"], "Abstract": "recently the coronavirus disease of 2019  covid 19  as named by the world health organization  who  has spread to over 200 countries. the who has declared this disease as a worldwide public health emergency. one of the most difficult tasks in combating this epidemic is to identify and segregate the afflicted people. the reverse transcription polymerase chain reaction test  rt pcr  is the most common pathology test used to diagnose this infection. studies show that the rt pcr test has a low positive rate and sometimes becomes ineffective in diagnosing infection. in some cases computed tomography  ct  scans reveal acute pneumonia and pulmonary anomalies. therefore ct scans are used together with rt pcr tests to confirm infected people. existing artificial intelligence and machine learning techniques require a large number of ct scans for training which is a time consuming process. visual inspection shows that most ct scans of covid-19 cases have broken blurred and ambiguous edges for infectious areas. another major issue with these images is the heterogeneous intensity of the pixels high noise and low resolution. as a result of all these issues the problem of effective edges boundaries of various areas of ct scans of covid-19 cases cannot be resolved by the current edge detection approach. indeed improper selection of edges can lead to an incorrect diagnosis of diseases through ct scans of covid-19 cases. therefore there is an urgent need for a diagnostic method in addition to the rt pcr test that can extract useful information from the minimum number of chest ct scans of suspected covid-19 cases. this study introduces a new ambiguous edge detection method  aedm  for identifying the edges boundaries of different regions in ct scans of covid-19 cases. the proposed aedm is developed on the basis of ambiguous set  as  theory which is highly efficient in processing ambiguous pixel information. for simulation purposes various ct scans of covid-19 cases are classified into three different categories  1  low infection  li   2  moderate infection  mi   and 3  severe infection  si . empirical analysis shows that the proposed aedm can effectively highlight the edges in ct scans of three different categories in comparison with other well known edge detection methods.", "Pub Date": "2023-12-18"}