{"Title": "An Adjustable Feature-Weighted Bayesian Model for Hybrid Satellite Telemetry Variables Anomaly Detection Under Multioperating Conditions", "Authors": ["m. liu", "t. luo", "l. zhang", "x. cao", "g. duan"], "Pub Date": "2023-11-03", "Abstract": "integrated health management of the main node satellite is crucial to ensuring the overall safety and stability of the large scale constellation. nevertheless the telemetry data of the main node satellite includes several categories of characteristics and the satellites may encounter a series of conditions of slow or abrupt transition all of which provide a considerable challenge to the satellite anomaly detection task. traditional machine learning methods such as  $k$  nearest neighbor  knn  support vector machines  svms  and principal component analysis  pca  cannot effectively utilize multivalued variables while deep learning methods generally lack interpretability. as a result based on the bayesian theory and statistical learning methods this article proposes an adjustable feature weighted bayesian model  afwbm  that can utilize both continuous and multivalued variables and is completely interpretable. afwbm employs the gaussian mixed and multinomial mixed models  mmms  to describe continuous and multivalued variables under multioperating conditions respectively. additionally for the initial label formulation and parameters learning tasks the expectation maximization  em  algorithm is utilized. theoretically afwbm computes the weights of each feature using normalized mutual information  nmi  and takes the label of the maximum prediction probability as the prediction label. since most faults in the satellite anomaly detection tasks are usually accumulated from the aging of health components afwbm updates the initial labels based on the rapid aging process determination scheme. furthermore the incremental learning method is adopted for online adjustment of model weights and parameters as well as online reprediction of sample labels. finally a numerical example and a practical example of a satellite are utilized to verify the superiority of afwbm under both dual working and multiworking anomaly detection tasks.", "Doi": "10.1109/TIM.2023.3325874", "Key Words": ["anomaly detection", "bayesian theory", "expectation-maximization (em) algorithm", "gaussian mixture model (gmm)", "multinomial mixture model (mmm)"]}