{"Title": "An Adaptive LDA Optimal Topic Number Selection Method in News Topic Identification", "Doi": "10.1109/ACCESS.2023.3308520", "Authors": ["m. zheng", "k. jiang", "r. xu", "l. qi"], "Key Words": ["lda model", "multi-view information fusion", "optimal number of topics", "news topics", "social media data mining"], "Abstract": "nowadays news text information is exploding and people need more and more heterogeneous news content. therefore news text topic identification is needed to help viewers quickly and accurately screen and filter news related to their interests to save time and energy. the latent dirichlet allocation  lda  model is the most commonly used method for text topic identification. the optimal number of topics must be specified in advance when using the lda model to extract topics in previous studies. however selecting the too large or the too small number of topics significantly impacts the final results of lda topic models directly determining the quality of topic extraction. moreover the news text datasets from social media are very time sensitive and the combination of temporal and semantic modeling has not been considered in past studies of news topic identification. this paper proposes an adaptive optimal topic number determination method for fusing semantic and temporal information in news datasets to address the existing problems. semantic and temporal are first extracted in this method as two different views. then density peak clustering of multi view information fusion is performed based on the two obtained feature vectors. the clustering results are used as the final optimal number of topics. to demonstrate the effectiveness of the proposed method this paper compares the performance of four traditional methods for determining the optimal number of topics with the performance of this paper‚äôs method on public datasets. the results show that the optimal number of topics considering semantic and temporal factors is significantly better than the other four traditional methods regarding f value pmi scores and mi scores. it performs well in other indicators as well. the above experimental results show that the method proposed in this paper combines the temporal and semantic of news data to determine the optimal number of topics of news text which can improve the accuracy of selecting the optimal number of topics in the lda model and the effectiveness of the topic identification of news text to some extent. it can help viewers better understand and utilize the massive news text information. in addition the method also broadens the idea of identifying and mining unique datasets from multiple perspectives.", "Pub Date": "2023-09-01"}