{"Title": "An Efficient Approximation Algorithm for Service Function Chaining Placement in Edge‚ÄìCloud Computing Industrial Internet of Things", "Doi": "10.1109/JIOT.2023.3338516", "Authors": ["m. asgarian", "k. jamshidi", "a. bohlooli"], "Key Words": ["approximation algorithm", "edge-cloud computing industrial internet of things (eciiot)", "network function virtualization (nfv)", "service function chain (sfc)"], "Abstract": "edge cloud computing industrial internet of things  eciiot  is composed of edge and cloud nodes with industrial internet of things  iiot  devices to get the service function chain  sfc . the service function chaining placement refers to a series of virtual network functions  vnfs  that are run at edge or cloud nodes in the form of software instances. in the problem of eciiot service embedding the multiple vnfs must be placed for iiot devices so how these virtual functions are placed at cloud or edge nodes to minimize the delay is challenging to achieve. in this article the placement of virtual functions with considering the edge and cloud nodes is proposed. in our model the cloud server with edge nodes can run the required functions of iiot devices in the sfc to decrease the imposed delay and use the computation resource in an efficient way. this is formed as an optimization problem to minimize the delay and residual computing resource consumption and reuse the previous functions. the exact solution of this problem is not available in polynomial time therefore an efficient approximation algorithm is proposed which solves the problem in three stages. first it linearizes the nonlinear objective function and constraint and approximates them by the convexity of these functions. then it solves the relaxed linear problem and finally it rounds the decision variables in a heuristic way. this solution not only has polynomial time computational complexity but also obtains the near optimal solution. the simulation results confirm the effectiveness of this approach.", "Pub Date": "2024-03-27"}