{"Title": "An Effective Lightweight Crowd Counting Method Based on an Encoder‚ÄìDecoder Network for Internet of Video Things", "Doi": "10.1109/JIOT.2023.3294727", "Authors": ["j. yi", "f. chen", "z. shen", "y. xiang", "s. xiao", "w. zhou"], "Key Words": ["convolution neural network", "crowd counting", "edge computing", "lightweight network"], "Abstract": "an emerging internet of video things  iovt  application crowd counting is a computer vision task where the number of heads in a crowded scene is estimated. in recent years it has attracted increasing attention from academia and industry because of its great potential value in public safety and urban planning. however it has become a challenge to cross the gap between the increasingly heavy and complex network architecture widely used for the pursuit of counting with high accuracy and the constrained computing and storage resources in the edge computing environment. to address this issue an effective lightweight crowd counting method based on an encoder‚äìdecoder network named lightweight crowd counting network  ledcrowdnet  is proposed to achieve an optimal tradeoff between counting performance and running speed for edge applications of iovt. in particular an improved mobilevit module as an encoder is designed to extract global local crowd features of various scales. the decoder is composed of the adaptive multiscale large kernel attention module  amlka  and the lightweight counting atrous spatial pyramid pooling process module  lc aspp  which can perform end to end training to obtain the final density map. the proposed ledcrowdnet is suitable for deployment on two edge computing platforms  nvidia jetson xavier nx and coral edge tpu  to reduce the number of floating point operations  flops  without a significant drop in accuracy. extensive experiments on five mainstream benchmarks  shanghaitech part a b ucf cc 50 ucf qnrf worldexpo‚äô10 and rsoc data sets  verify the correctness and efficiency of our method.", "Pub Date": "2024-01-08"}