{"Title": "An Energy-Saving Scheme With Edge Computing and Energy Harvesting in mmWaves Backhauling HetNets", "Doi": "10.1109/ACCESS.2023.3259728", "Authors": ["a. alqasir"], "Key Words": ["5g", "energy harvesting", "edge computing", "next-gen networks", "wireless communication"], "Abstract": "the exponential growth of data traffic from mobile devices requires the implementation of heterogeneous networks  hetnets  which densely deploy multiple radio access technologies to match such demands. the deployment of many small base stations  sbss  leads to backhauling problems where wired backhauling is neither available nor efficient. millimeter waves  mmwaves  can potentially mitigate the backhauling problem by providing high throughput and low capital expenditure  capex . however due to the high attenuation rate in mmwaves the increase in the distance between sbs and macro base station  mbs  can severely degrade the system‚äôs overall performance. on the other hand densely deployed sbss with wireless backhauling can cause high energy consumption in the system. therefore in this work a novel network model is presented in which a combination of sbs active antenna units  aaus  and edge computing units  ecus  are deployed to minimize the overall energy consumption of the network while maintaining the sufficient quality of service  qos . a mathematical model based on optimization modeling is introduced to solve user equipments  ues  association dynamic sleeping backhauling and fronthauling and power transmission. due to the complexity of the formulated problem a heuristic algorithm is introduced. namely integrated access and backhauling  iab  with edge computing and dynamic sleeping algorithm  ieds  algorithm is introduced to decompose the formulated problem into two parts and solve them iteratively. finally computer simulation results that demonstrate the model‚äôs performance are presented for comparison between optimal solution ieds and hbds which shows that ieds outperformed hbds in performance with negligible computation difference.", "Pub Date": "2023-03-28"}