{"Title": "An Effectively Applicable to Resource Constrained Devices and Semi-Trusted Servers Authenticated Key Agreement Scheme", "Doi": "10.1109/TIFS.2024.3362589", "Authors": ["d. xie", "j. yang", "b. wu", "w. bian", "f. chen", "t. wang"], "Key Words": ["resource-constrained iot devices", "semi-trusted servers", "anonymous authentication key agreement", "ban logic", "provable security"], "Abstract": "in a mobile edge computing environment the computing tasks of resource constrained iot devices are often offloaded to mobile edge computing servers for processing. in order to ensure the security of the task offloading process both parties need to perform mutual authentication and negotiate a session key first. the security defenses in the existing authentication schemes are often only aimed at external attackers while ignoring the possible malicious behaviors of semi trusted servers. furthermore they cannot effectively take into account the device side lightweight and security as well as the load problem of a single registry. in this paper we propose a new anonymous authentication key agreement scheme that fully considers the resource constraints of terminal devices and the security risks of semi trusted servers. in the scheme we use the method of generating pairing information during registration to avoid the server side directly contacting the user‚äôs private information and support trusted third parties not to participate in the authentication process. in addition by setting up authentication servers to outsource computing tasks the device side can avoid blindly selecting a computing server for task offloading achieve accurate task assignment and efficient execution of authentication. we use real or random model and ban logic to demonstrate the security of the proposed scheme and use the proverif tool to verify its authenticated reachability and confidentiality. compared with other schemes with the same structure this scheme is superior to similar schemes and has higher security on the basis of ensuring the least amount of computation on the device side.", "Pub Date": "2024-02-13"}