{"Title": "An Empirical Study of Pre-Trained Model Reuse in the Hugging Face Deep Learning Model Registry", "Doi": "10.1109/ICSE48619.2023.00206", "Authors": ["w. jiang", "n. synovic", "m. hyatt", "t. r. schorlemmer", "r. sethi", "y. -h. lu", "g. k. thiruvathukal", "j. c. davis"], "Key Words": ["software reuse", "empirical software engineering", "machine learning", "deep learning", "software supply chain", "engineering decision making", "cybersecurity", "trust"], "Abstract": "deep neural networks  dnns  are being adopted as components in software systems. creating and specializing dnns from scratch has grown increasingly difficult as state of the art architectures grow more complex. following the path of traditional software engineering machine learning engineers have begun to reuse large scale pre trained models  ptms  and fine tune these models for downstream tasks. prior works have studied reuse practices for traditional software packages to guide software engineers towards better package maintenance and dependency management. we lack a similar foundation of knowledge to guide behaviors in pre trained model ecosystems. in this work we present the first empirical investigation of ptm reuse. we interviewed 12 practitioners from the most popular ptm ecosystem hugging face to learn the practices and challenges of ptm reuse. from this data we model the decision making process for ptm reuse. based on the identified practices we describe useful attributes for model reuse including provenance reproducibility and portability. three challenges for ptm reuse are missing attributes discrepancies between claimed and actual performance and model risks. we substantiate these identified challenges with systematic measurements in the hugging face ecosystem. our work informs future directions on optimizing deep learning ecosystems by automated measuring useful attributes and potential attacks and envision future research on infrastructure and standardization for model registries.", "Pub Date": "2023-07-14"}