{"Title": "An Efficient Machine Learning-Based Resource Allocation Scheme for SDN-Enabled Fog Computing Environment", "Doi": "10.1109/TVT.2023.3242585", "Authors": ["j. singh", "p. singh", "m. hedabou", "n. kumar"], "Key Words": ["collaborative machine learning (cml)", "fog computing", "software defined network (sdn)", "resource allocation"], "Abstract": "fog computing is an emerging technology which enables computing resources accessibility close to the end users. it overcomes the drawbacks of available network bandwidth and delay in accessing the computing resources as observed in cloud computing environment. resource allocation plays an important role in resource management in a fog computing environment. however the existing traditional resource allocation techniques in fog computing do not guarantee less execution time reduced energy consumption and low latency requirements which is a pre requisite for most of the modern fog computing based applications. the complex fog computing environment requires a robust resource allocation technique to ensure the quality and optimal resource usage. motivated from the aforementioned challenges and constraints in this article we propose a resource allocation technique for sdn enabled fog computing with collaborative machine learning  cml . the proposed cml model is integrated with the resource allocation technique for the sdn enabled fog computing environment. the fogbus and ifogsim are deployed to test the results of the proposed technique using various performance evaluation metrics such as bandwidth usage power consumption latency delay and execution time. the results obtained are compared with other existing state of the art techniques using the aforementioned performance evaluation metrics. the results obtained show that the proposed scheme reduces 19.35% processing time 18.14% response time and 25.29% time delay. moreover compared to the existing techniques it reduces 21% execution time 9% network usage and 7% energy consumption.", "Pub Date": "2023-06-19"}