{"Title": "An Efficient and Autonomous Planning Scheme for Deploying IoT Services in Fog Computing: A Metaheuristic-Based Approach", "Doi": "10.1109/TCSS.2023.3254922", "Authors": ["z. lin", "l. lu", "j. shuai", "h. zhao", "a. shahidinejad"], "Key Words": ["differential evolution algorithm (dea)", "fog computing", "internet of things (iot)", "meta-heuristics", "microservice architecture", "service placement"], "Abstract": "the fog computing paradigm is a promising concept to overcome the exponential increase in data volume in internet of things  iot  applications. this paradigm can support delay sensitive iot applications by extending cloud services to the network edge. however fog computing faces challenges such as resource allocation for applications at the network edge due to limited resources as well as its heterogeneous and distributed nature. this is in line with the goals of microservice architecture and develops the placement of microservice based iot applications. the iot service placement problem  spp  on fog nodes is known as non deterministic polynomial time  np  hard. in this study we introduce a meta heuristic approach named spp differential evolution algorithm  dea  to handle spp which originates from the dea with a shared parallel architecture. the proposed method takes advantage of the scalable and deployable nature of microservices to minimize the resource utilization and delay as much as possible. spp dea is developed based on monitoring analysis decision making and execution with knowledge bas  made k  autonomous planning model with the aim of compromise between service cost response time resource utilization and throughput. in order to address the computational complexity of the problem we consider the resource consumption distribution and service deployment priority in the placement process. in order to evaluate the quality of placement in spp dea extensive experiments have been performed on a synthetic fog environment. the simulation results show that compared to the state of the art approaches spp dea reduces the service cost and waiting time by 16% and 11% respectively.", "Pub Date": "2024-01-25"}