{"Title": "An Energy-and-Area-Efficient CNN Accelerator for Universal Powers-of-Two Quantization", "Authors": ["t. xia", "b. zhao", "j. ma", "g. fu", "w. zhao", "n. zheng", "p. ren"], "Pub Date": "2023-02-24", "Abstract": "cnn model computation on edge devices is tightly restricted to the limited resource and power budgets which motivates the low bit quantization technology to compress cnn models into 4 bit or lower format to reduce the model size and increase hardware efficiency. most current low bit quantization methods use uniform quantization that maps weight and activation values onto evenly distributed levels which usually results in accuracy loss due to distribution mismatch. meanwhile some non uniform quantization methods propose specialized representation that can better match various distribution shapes but are usually difficult to be efficiently accelerated on hardware. in order to achieve low bit quantization with high accuracy and hardware efficiency this paper proposes universal power of two  upot  a novel low bit quantization method that represents values as the addition of multiple power of two values selected from a series of subsets. by updating the subset contents upot can provide adaptive quantization levels for various distributions. for each cnn model layer upot automatically searches for the optimized distribution that minimizes the quantization error. moreover we design an efficient accelerator system with specifically optimized power of two multipliers and requantization units. evaluations show that the proposed architecture can provide high performance cnn inference with reduced circuit area and energy and outperforms several mainstream cnn accelerators with higher   $8\\times $ ‚äì $65\\times $   area efficiency and   $2\\times $ ‚äì $19\\times $   energy efficiency. further experiments of 4/3/2 bit quantization on resnet18/50 mobilenet v2 and efficientnet models show that our upot can achieve high model accuracy which greatly outperform other state of the art low bit quantization methods by 0.3%‚äì6%. the results indicate that our approach provides a highly efficient accelerator for low bit cnn model quantization with low hardware overheads and good model accuracy.", "Doi": "10.1109/TCSI.2022.3227608", "Key Words": ["cnn accelerator", "power-of-two quantization", "circuit design", "asic implementation", "hardware system"]}