{"Title": "An Efficient Lightweight Event Detection Algorithm for On-Site Non-Intrusive Load Monitoring", "Authors": ["s. kotsilitis", "e. kalligeros", "e. c. marcoulaki", "i. g. karybali"], "Pub Date": "2023-01-12", "Abstract": "non intrusive load monitoring  nilm  aims to determine individual appliance energy consumption with minimum cost by decomposing aggregated electricity measurements. although important for achieving energy conservation and cost minimization nilm requires high frequency sampling rates to provide accurate results. this requirement significantly increases the need for storage and computational resources in the electric utility‚äôs fog cloud infrastructure and for bandwidth on the customer‚äôs side. to resolve these issues on  site disaggregation i.e. on the monitoring device can be employed. however to keep device cost low lightweight nilm algorithms are needed. to this end a lightweight event detection algorithm designed to ease on  site implementation on either software or hardware is proposed. event detection is the first critical half of the well established event based nilm approach  it identifies appliance state changes  events . although a few lightweight event detection techniques utilizing high frequency data have been presented in the literature their performance is relatively low in complex load cases. the proposed algorithm utilizes simple to compute features and employs multiple simple criteria to declare an event as detected and slope coefficient inspection to identify steady states. moreover it can detect events with very small time difference between them. comparisons show that its performance is superior even against more complex event detection approaches while its low computational cost is also verified.", "Doi": "10.1109/TIM.2022.3232169", "Key Words": ["energy disaggregation", "event detection", "event-based non-intrusive load monitoring (nilm)", "lightweight algorithms", "nilm", "on-site implementation"]}