{"Title": "An Edge-Cloud Collaboration Framework for Graph Processing in Smart Society", "Doi": "10.1109/TETC.2023.3297066", "Authors": ["j. zhou", "m. kondo"], "Key Words": ["edge-cloud collaboration", "graph processing", "interactivity", "network socket", "reliability"], "Abstract": "due to the limitations of cloud computing on latency bandwidth and data confidentiality edge computing has emerged as a novel location aware way to provide the capacity constrained portable terminals with more processing capacity to improve the computing performance and quality of service  qos  in several typical domains of the human activity in smart society such as social networks medical diagnosis telecommunications recommendation systems internal threat detection transportation internet of things  iot  etc. these application domains often manage a vast collection of entities with various relationships which can be naturally represented by the graph data structure. graph processing is a powerful tool to model and optimize complex problems where graph based data is involved. in consideration of the relatively insufficient resource provisioning of the edge devices in this article for the first time to our knowledge we propose a reliable edge cloud collaboration framework that facilitates the graph primitives based on a lightweight interactive graph processing library  gpl  especially for shortest path search  sps  operations as the demonstrative example. two types of different practical cases are also presented to show the typical application scenarios of our graph processing strategy. experimental evaluations indicate that the acceleration rate of performance can reach 6.87x via graph reduction and less than 3% and 20% extra latency is required for much better user experiences for navigation and pandemic control respectively while the online security measures merely consume about 1% extra time of the overall data transmission. our framework can efficiently execute the applications with considering of user friendliness low latency response interactions among edge devices collaboration between edge and cloud and privacy protection at an acceptable overhead.", "Pub Date": "2023-12-08"}