{"Title": "An Exploratory Literature Study on Sharing and Energy Use of Language Models for Source Code", "Doi": "10.1109/ESEM56168.2023.10304803", "Authors": ["m. hort", "a. grishina", "l. moonen"], "Key Words": ["sustainability", "reuse", "replication", "energy", "dl4se"], "Abstract": "context  large language models trained on source code can support a variety of software development tasks such as code recommendation and program repair. large amounts of data for training such models benefit the models' performance. however the size of the data and models results in long training times and high energy consumption. while publishing source code allows for replicability users need to repeat the expensive training process if models are not shared. goals  the main goal of the study is to investigate if publications that trained language models for software engineering  se  tasks share source code and trained artifacts. the second goal is to analyze the transparency on training energy usage. methods  we perform a snowballing based literature search to find publications on language models for source code and analyze their reusability from a sustainability standpoint. results  from a total of 494 unique publications we identified 293 relevant publications that use language models to address code related tasks. among them 27%  79 out of 293  make artifacts available for reuse. this can be in the form of tools or ide plugins designed for specific tasks or task agnostic models that can be fine tuned for a variety of downstream tasks. moreover we collect insights on the hardware used for model training as well as training time which together determine the energy consumption of the development process. conclusion  we find that there are deficiencies in the sharing of information and artifacts for current studies on source code models for software engineering tasks with 40% of the surveyed papers not sharing source code or trained artifacts. we recommend the sharing of source code as well as trained artifacts to enable sustainable reproducibility. moreover comprehensive information on training times and hardware configurations should be shared for transparency on a model carbon footprint.", "Pub Date": "2023-11-08"}