{"Title": "An EEG-Based Computational Model for Decoding Emotional Intelligence, Personality, and Emotions", "Authors": ["k. kannadasan", "j. shukla", "s. veerasingam", "b. s. begum", "n. ramasubramanian"], "Pub Date": "2024-01-11", "Abstract": "emotional intelligence  ei  a critical aspect of regulating emotions and behavior in daily life holds paramount significance in both psychology research and real world applications. understanding and assessing ei are essential for informed decision making nurturing relationships and facilitating efficient communication. as human‚äìcomputer interaction  hci  continues to evolve there is a growing need to develop systems capable of comprehending human emotions personality traits and moods through recognition models. this research endeavors to explore the potential of recognizing ei in the context of effective hci. to address this challenge we have developed a novel computational model based on electroencephalogram  eeg  data. our work encompasses a carefully curated eeg dataset featuring recordings from 40 participants who were exposed to a set of 16 emotional video clips selected from distinct quadrants of the valence arousal  va  space. participants‚äô emotional responses were meticulously annotated through self assessment of emotional dimensions for each video stimulus. in addition participants‚äô feedback on the big five personality traits and their responses to the trait emotional intelligence questionnaire  teique  served as our ground truth for further analysis. our study includes a comprehensive correlation analysis using pearson correlations to establish the relationships between personality traits and ei. furthermore we conducted eeg based analysis to uncover connections between eeg signals and emotional attributes. remarkably our analysis reveals that eeg signals excel at capturing differences in ei levels. leveraging machine learning algorithms we have constructed binary classification models that yield average  $f1$  scores of 0.72 0.71 and 0.62 for emotions personality traits and ei respectively. these experimental outcomes underscore the potential of eeg signals in the recognition of ei personality traits and emotions. we envision our proposed model as a foundational element in the development of effective hci systems enabling a deeper and better understanding of human behavior.", "Doi": "10.1109/TIM.2023.3347790", "Key Words": ["affective computing", "brain-computer interface (bci)", "electroencephalogram (eeg) signals", "emotion analysis", "emotional intelligence (ei) recognition", "personality traits", "signal processing"]}