{"Title": "An HPC Pipeline for Calcium Quantification of Aortic Root From Contrast-Enhanced CCT Scans", "Authors": ["g. minghini", "a. u. cavallo", "a. miola", "v. sisini", "e. calore", "f. fortini", "r. micheloni", "p. rizzo", "s. f. schifano", "f. v. d. sega", "c. zambelli"], "Pub Date": "2023-09-22", "Abstract": "precise assessment of calcification lesions in the aortic root  ar  is relevant for the success of the transcatheter aortic valve implantation  tavi  procedure. to this end the radiologists analyze the cardiac computed tomography  cct  scans of patients and detect the position and extent of the calcium deposits. in this contribution we develop a computationally efficient high performance computing  hpc  system to detect segment and quantify volumes of calcium in contrast enhanced ccts embedding in a three step pipeline two 3d convolutional neural networks  cnn  and a threshold adaptive filter. the first step crops the images to a bounding box around the ar keeping the original resolution the second builds the segmentation and the third detects and measures the volume of the calcium lesions. our system is trained on high resolution contrast ccts routinely planned for the tavi manually annotated by expert radiologists and evaluated on a test set of patients with different levels of calcifications. the accuracy achieved in segmenting the ar is approximately 92% for the test set while the average difference of calcium lesion volumes with respect to the radiologists measurements is about 0.49 mm3. running on a 4x nvidia v100 and an 8x nvidia a100 gpu systems we achieve a remarkable inference throughput of 17 and 70 cct sec respectively and a linear scaling of computing performance. our contribution provides an hpc system suitable for hospital premises installation and is able to aid radiologists in assessing the calcification level of patients undergoing the tavi making this process automated fast and more reliable.", "Doi": "10.1109/ACCESS.2023.3315734", "Key Words": ["aortic root segmentation", "calcifications assessment", "contrast-enhanced cct scans", "gpu performance analysis"]}