{"Title": "An Intelligent Buffalo-Based Secure Edge-Enabled Computing Platform for Heterogeneous IoT Network in Smart Cities", "Doi": "10.1109/ACCESS.2023.3288815", "Authors": ["r. r. irshad", "s. hussain", "i. hussain", "i. ahmad", "a. yousif", "i. m. alwayle", "a. a. alattab", "k. m. alalayah", "j. g. breslin", "m. m. badr", "j. j. p. c. rodrigues"], "Key Words": ["african buffalo algorithm", "internet of things", "smart city", "heterogeneous", "secure edge enabled computing"], "Abstract": "the internet of things  iot  based smart city applications are the latest technology driven solutions designed to collect and analyze data to enhance the quality of life for urban residents by creating more sustainable efficient and connected communities. communication nodes are networked independently to monitor the circumstances where they require being more energy efficient and securing to improve the performance of sustainable cities. because the enormous number of networked devices makes the smart cities application vulnerable to many security breaches all of which have serious ramifications for a city and its residents‚äô safety well being and economic development. low powered sensors have limitations in terms of battery life short transmission range and security considerations despite the fact that the combination of edge computing and green iot considerably enhances network performance in terms of processing and data storage. consequently it is necessary to implement an advanced approach to provide energy resources with secure data transmission for sustainable cities. therefore this research proposes an intelligent buffalo based secure edge enabled computing  ib sec  framework for smart cities by iot platform which aims to enhance communication efficiency and reliability with minimizing latency in terms of energy consumption and data security for data transmission. the developed ib sec platform utilizes a combination of the african buffalo optimization  abo  algorithm and a distributed hash function based security algorithm to enhance the efficiency security and reliability of data transmission in iot based smart city networks. this platform leverages the capabilities of secure edge computing and mac protocols to achieve its goals by implementing encryption authentication and access control mechanisms that ensure the wireless communication is secure and the data is protected against unauthorized access. overall the ib sec framework provides an advanced approach to secure iot networks and enable smart city applications. moreover the developed platform enables the integration of heterogeneous edge devices sensors and systems which is effectively managed and adapted by median access control  mac  protocols. the ib sec is implemented in matlab and validated through cutting edge security algorithms in terms of improved security reliability throughput and reduced latency and energy consumption.", "Pub Date": "2023-07-13"}