{"Title": "An Intelligent Edge Diagnosis System Based on Multiplication‚ÄìConvolution Sparse Network", "Doi": "10.1109/JSEN.2023.3304301", "Authors": ["q. wu", "x. ding", "q. zhang", "r. liu", "s. wu", "q. he"], "Key Words": ["deep learning (dl)", "edge computing", "edge diagnosis system", "equipment fault diagnosis", "multiplication‚äìconvolution network"], "Abstract": "real time fault diagnosis of equipment is an important means to avoid major safety accidents. the increase of equipment which needs to be monitored creates a burden of data transmission computation and storage for the traditional cloud diagnosis and the real time online diagnosis is later limited because of its large data transmission volume and bandwidth limitation. to address these issues this study proposed an intelligent edge fault diagnosis system  ieds  based on a new lightweight intelligent architecture which is named ‚äúmultiplication‚äìconvolution sparse network‚äù  mcsn . first the first layer of mcsn is carefully designed a series of multiplicative filtering kernels  mfks  to separate the multiscale fault features distributed in different mono frequency clusters which greatly increases the fault identification accuracy of mcsn. the lightweight performance of mcsn enables it to be deployed in edge hardware with limited computing resources. additionally oriented to the intelligent edge diagnosis this proposed mcsn is transplanted to an edge diagnosis unit  edu  to conduct the designed mc ieds. mc ieds can complete real time data acquisition data processing fault identification and fault data filtering at the edge of the equipment which can consume a large number of low value density data in the proposed system and improve the real time performance of fault diagnosis. experiments and comparisons demonstrate that the lightweight mcsn can achieve a high fault recognition accuracy. the minimum bit width of mcsn is illustrated by fixed point quantization without loss of accuracy which is beneficial to the deployment of mcsn into edu. meanwhile online experiments and analysis demonstrated that mc ieds can efficiently and accurately achieve edge diagnosis and fault feature filtering at the edge side. with the merits of mc ieds in data transmission volume compression and intelligent edge diagnosis with real time signal filtering it can be foreseen that the proposed method shows great potential in equipment intelligent fault diagnosis.", "Pub Date": "2023-10-31"}