{"Title": "An Investigation of Large Language Models for Real-World Hate Speech Detection", "Doi": "10.1109/ICMLA58977.2023.00237", "Authors": ["k. guo", "a. hu", "j. mu", "z. shi", "z. zhao", "n. vishwamitra", "h. hu"], "Key Words": ["hate speech", "large language model", "prompt engineering", "few-shot learning"], "Abstract": "hate speech has emerged as a major problem plaguing our social spaces today. while there have been significant efforts to address this problem existing methods are still significantly limited in effectively detecting hate speech online. a major limitation of existing methods is that hate speech detection is a highly contextual problem and these methods cannot fully capture the context of hate speech to make accurate predictions. recently large language models  large language model  have demonstrated state of the art performance in several natural language tasks. large language model have undergone extensive training using vast amounts of natural language data enabling them to grasp intricate contextual details. hence they could be used as knowledge bases for context aware hate speech detection. however a fundamental problem with using large language model to detect hate speech is that there are no studies on effectively prompting large language model for context aware hate speech detection. in this study we conduct a large scale study of hate speech detection employing five established hate speech datasets. we discover that large language model not only match but often surpass the performance of current benchmark machine learning models in identifying hate speech. by proposing four diverse prompting strategies that optimize the use of large language model in detecting hate speech. our study reveals that a meticulously crafted reasoning prompt can effectively capture the context of hate speech by fully utilizing the knowledge base in large language model significantly outperforming existing techniques. furthermore although large language model can provide a rich knowledge base for the contextual detection of hate speech suitable prompting strategies play a crucial role in effectively leveraging this knowledge base for efficient detection.", "Pub Date": "2024-03-19"}