{"Title": "An Optimal Transport-Based Federated Reinforcement Learning Approach for Resource Allocation in Cloud‚ÄìEdge Collaborative IoT", "Doi": "10.1109/JIOT.2023.3292368", "Authors": ["d. gan", "x. ge", "q. li"], "Key Words": ["actor‚äìcritic (ac) network", "deep reinforcement learning (drl)", "edge computing", "joint delay and energy consumption optimization", "optimal transport (ot)"], "Abstract": "in the traditional cloud‚äìedge collaborative internet of things  iot  the high communication cost and slow convergence of the models often result in high delay and energy consumption. in this article a model and data dual driven resource optimization mechanism is proposed for cloud‚äìedge collaborative iot applications. the model and data dual driven mechanism is a joint delay and energy consumption optimization mechanism based on optimal transport and federated actor‚äìcritic  otfac  is proposed which combines the offline and online learning. to be specific in the model driven offline learning phase an optimization problem on the bandwidth and computation resource allocation is first formulated. the optimal transport  ot  based offline optimization model is constructed. and then the ot based algorithm is proposed to solve the optimization problem. in the data driven online learning phase federated actor‚äìcritic based online optimization model are constructed. and then the federated learning  fl  and actor‚äìcritic  ac  learning based online resource optimization algorithm is designed to further reduce the delay and energy consumption with edge servers serving as local aggregators. simulation results illustrate that the proposed otfac in this article reduces the average delay by 55% and the average energy consumption by 51% as compared with the benchmark hierarchical aggregation method hierfavg. compared with benchmark fl based deep deterministic policy gradient method ddpg the average delay is reduced by 47% and the average energy consumption is reduced by 43% by the proposed method.", "Pub Date": "2024-01-08"}