{"Title": "An Optimized IoT-Enabled Big Data Analytics Architecture for Edge‚ÄìCloud Computing", "Doi": "10.1109/JIOT.2022.3157552", "Authors": ["m. babar", "m. a. jan", "x. he", "m. u. tariq", "s. mastorakis", "r. alturki"], "Key Words": ["backpropagation (bp) neural network", "big data analytics", "edge computing", "internet of things (iot)", "machine learning (ml)", "yet another resource negotiator (yarn)"], "Abstract": "the awareness of edge computing is attaining eminence and is largely acknowledged with the rise of the internet of things  iot . edge enabled solutions offer efficient computing and control at the network edge to resolve the scalability and latency related concerns. though it comes to be challenging for edge computing to tackle diverse applications of iot as they produce massive heterogeneous data. the iot enabled frameworks for big data analytics face numerous challenges in their existing structural design for instance the high volume of data storage and processing data heterogeneity and processing time among others. moreover the existing proposals lack effective parallel data loading and robust mechanisms for handling communication overhead. to address these challenges we propose an optimized iot enabled big data analytics architecture for edge‚äìcloud computing using machine learning. in the proposed scheme an edge intelligence module is introduced to process and store the big data efficiently at the edges of the network with the integration of cloud technology. the proposed scheme is composed of two layers  1  iot‚äìedge and 2  cloud processing. the data injection and storage is carried out with an optimized mapreduce parallel algorithm. an optimized yet another resource negotiator  yarn  is used for efficiently managing the cluster. the proposed data design is experimentally simulated with an authentic data set using apache spark. the comparative analysis is decorated with the existing proposals and traditional mechanisms. the results justify the efficiency of our proposed work.", "Pub Date": "2023-02-20"}