{"Title": "An Online Parsing Framework for Semistructured Streaming System Logs of Internet of Things Systems", "Doi": "10.1109/OJIM.2022.3232650", "Authors": ["s. bhattacharya", "b. ray", "r. chugh", "s. gordon"], "Key Words": ["bert", "context-aware", "gateway", "information extraction", "internet of things (iot)", "log parsing", "natural language", "streaming", "transformer", "triples", "word-embedding"], "Abstract": "this article presents a novel log abstraction framework based on neural open information extraction  openie  and dynamic word embedding principles. though various log parsing frameworks are proposed in the literature the existing frameworks are modeled on predefined heuristics or auto regressive methodologies that work well in offline scenarios. however these frameworks are less suitable for dynamic self adaptive systems such as the internet of things  iot  where the log outputs have diverse contextual variations and disparate time irregularities. therefore it is essential to move away from these traditional approaches and develop a systematic model that can effectively analyze log outputs in real time and increase the system up time of iot networks so that they are almost always available. to address these needs the proposed framework used openie along with term frequency inverse document frequency  tf idf  vectorization for constructing a set of relational triples  aka triple sets . additionally a dynamic pretrained encoder‚äìdecoder architecture is utilized to imbibe the positional and contextualized information in its resultant outputs. the adopted methodology has enabled the proposed framework to extract richer word representations with dynamic contextualization of time sensitive event logs to enhance further downstream activities such as failure prediction and prognostic analysis of iot networks. the proposed framework is evaluated on the system event log traces accumulated from a long range wide area network  lorawan  iot gateway to proactively determine the probable causes of its various failure scenarios. additionally the study also provided a comparative analysis of its mathematical representations with that of the current state of the art  sota  approaches to project the advantages and benefits of the proposed model particularly from its data analytics standpoint.", "Pub Date": "2023-01-24"}