{"Title": "Analysis of Integration Technologies for High-Speed Analog Neuromorphic Photonics", "Authors": ["l. d. marinis", "n. andriolli", "g. contestabile"], "Pub Date": "2023-12-27", "Abstract": "while the use of graphic processing units fueled the success of artificial intelligence models their future evolution will likely require overcoming the speed and energy efficiency limitations of current implementations with the use of specialized neuromorphic hardware. in this scenario neuromorphic photonic processors have recently proved to be a feasible solution. in this paper we first discuss basic analog photonic processing elements based on mach zehnder modulators and assess their effective bit resolution. then we evaluate how different photonic integration technologies affect the performance and the scalability of analog optical processors in order to provide a clearer path toward real world implementations of such engines. to this aim we focus our analysis on the silicon on insulator  soi  lithium niobate on insulator  lnoi  and indium phosphide  inp  platforms. in particular we have numerically evaluated the performance of the photonic electronic multiply  accumulate neuron  peman  and its tensorial version both based on mach zehnder modulators with the three technologies in terms of resolution energy efficiency and footprint efficiency. lnoi modulators achieve the best resolution at high speed with 4.3 bits at 56 gmac s for the single peman and 3.6 bits at 224 gmac s for the tensorial version. the energy consumption in inp and lnoi platforms is the lowest accounting for just 13.2 pj mac and 4.6 pj mac for the single and tensorial peman respectively. nonetheless soi devices outperform the others in terms of footprint efficiency reaching 18.6 gmac s/mm$^{2}$ in the single neuron version and 29.6 gmac s/mm$^{2}$ in the tensorial version.", "Doi": "10.1109/JSTQE.2023.3273784", "Key Words": ["photonic analog computing", "photonic neural networks", "photonic integration technologies"]}