{"Title": "Analysis and Construction of Nonlinear Correctors Used in True Random Number Generators", "Authors": ["w. zhang"], "Pub Date": "2023-09-15", "Abstract": "the problem of true random number generators  trngs  traces back to von neumann‚äôs 1951 work that aims to simulate an unbiased coin by using a biased coin with unknown probability. the core component in a trng is the corrector which is a post processing function used to reduce or eliminate statistical weaknesses of physical random number generators. note that an  $ nmt $  resilient function is an  $ nmt $  corrector. hence a natural question is how to construct an  $ nmt $  corrector which is not  $ nmt $  resilient? in this paper a framework concerning the construction of nonlinear  $ nmt $  correctors with algebraic degree  $m+1$  is proposed based on an equidistant linear code. we show that the derived correctors are  $ nmt 1 $  resilient but not  $ nmt $  resilient. given the importance of equidistant linear codes we discuss how to get such a code with relatively flexible length and how to get a pair of disjoint equidistant linear codes. in addition the parameters comparison with linear correctors is given. it is shown that our method achieves the same correction order compared to the optimal linear method. as far as we know the  $ nmt $  correctors we constructed also possess the best known correction order compared with the known nonlinear  $ nm $  resilient functions. the algebraic degree and nonlinearity of the constructed correctors are also analyzed. through a pair of disjoint equidistant linear codes the nonlinearity of the nonlinear  $ nmt $  correctors can be improved. the results show that our  $ nmt $  correctors also possess the best algebraic degree and nonlinearity for fixed  $ nm $ .", "Doi": "10.1109/TIT.2023.3241899", "Key Words": ["algebraic degree", "boolean function", "corrector", "cryptography", "resilient function", "true random number generator", "walsh spectrum"]}