{"Title": "Analysis of Power Consumption and Carbon Emissions of Large Public Buildings Based on Neural Network", "Doi": "10.1109/ICAICA58456.2023.10405638", "Authors": ["g. zhou", "j. qian", "c. kong", "y. zhao"], "Key Words": ["attention mechanism", "deep learning", "staggered network", "carbon emission analysis"], "Abstract": "with the development of science and technology the prediction of energy consumption and carbon emissions has become increasingly important. technological innovation is the key to achieving carbon neutrality. on a global scale the current status and challenges of carbon emissions are also issues that cannot be ignored. global carbon emissions and economic aggregates have shown a simultaneous upward trend but the growth rate has slowed down in recent years. therefore it is particularly important to conduct predictive analysis of energy consumption and carbon emissions. traditional forecasting methods have problems such as data lag and high data acquisition costs. the core idea of traditional macroeconomic forecasting methods is to discover the inherent laws of statistical data through specific models and methods and use these laws to predict the future. but validity depends heavily on the quality of the statistics used. therefore this article proposes an improved and optimized ac lstm model that takes into account spatiotemporal characteristics and can consider both the time series and spatial relationship perspectives. this is because it adds convolution operations that can extract spatial features to the lstm network that can extract temporal features. it can also improve the fine layout effect. by optimizing the attention module the fine layout effect can be improved. improve prediction accuracy. when processing long sequence data using the attention mechanism can improve the prediction accuracy of the model. obtaining the connection between global and local  the attention mechanism can establish the connection between global and local in one step. this allows for the capture of long term dependencies without being constrained by the sequence length as seen in rnn networks.", "Pub Date": "2024-01-31"}