{"Title": "Analysis of Vlog Transcripts using Topic Modeling, Summarizer, and Cluster Analysis", "Doi": "10.1109/FIE58773.2023.10343205", "Authors": ["u. singh", "t. -r. sikorski", "e. wortham", "e. shittu"], "Key Words": ["natural language processing", "topic modeling", "cluster analysis", "social innovation"], "Abstract": "this paper demonstrates the use of natural language processing  nlp  models to analyze qualitative data for engineering education research purposes. three nlp models are applied  topic modelling which identifies salient keywords in text  summarizer which extracts and concatenates sentences with unique meaning from a text  and cluster analysis which groups texts together based on similar word sequences. the study applied these techniques to short video logs or vlogs collected as part of a case study of undergraduate engineering students' exposure to a social innovation curriculum. the curriculum aimed to teach students to use their engineering skills to identify and address issues that cause suffering for marginalized communities. in the vlogs students responded to prompts asking them to describe what social issues they are passionate about how they relate to these issues and how they would propose exploring and addressing those issues. vlogs were transcribed pre processed and then examined with each technique to identify patterns within and across the prompts. widely recognized limitations of nlp techniques included the potential loss of important contextual information and the dependence on large volumes of data to produce valid and reliable results. despite these limitations the combination of three techniques was effective for locating high priority transcripts within the data corpus identifying themes within and across vlogs and supporting longitudinal analysis of student responses. previous literature has documented the utility of topic modeling and other nlp techniques to analyze large volumes of written text on for example course evaluations or student writing assignments. importantly this study demonstrates the novel and meaningful application of topic modelling summarizer and cluster analysis to analyze a relatively small corpus of transcript data. given these results we are optimistic about the potential for nlp approaches to complement other analysis techniques and make the analysis of transcript data more efficient and feasible.", "Pub Date": "2024-01-05"}