{"Title": "Analysis of Muscle Fiber Type Proportions in Surface Electromyography Signals of Athletes Using Reassigned Morlet Scalogram", "Authors": ["r. r. nair", "g. venugopal", "r. swaminathan"], "Pub Date": "2024-03-26", "Abstract": "the selection of proper measurement systems and signal processing methods is crucial while analyzing complex physiological signals like surface electromyography  semg . the reassignment technique is a powerful signal analysis method that enables efficient cross term suppression in time frequency distributions  tfds  and provides excellent time frequency resolution. in this work the fiber type proportions in the gastrocnemius lateralis  gl  of athletes  at  are analyzed using semg signals and a reassigned morlet scalogram. to compare the results signals recorded from non athletes  nat  are considered. signals are acquired during an isometric calf raise exercise with loads until fatigue and are processed using a reassigned morlet scalogram. features namely instantaneous mean frequency  imnf  instantaneous median frequency  imdf  energy spectral density  esd  and instantaneous power  ip  are extracted. a least square linear regression technique is used to study the variation of features over time and slope values are calculated. the mean percentage difference  mpd  of features from non fatigue  nf  to fatigue  f  state is computed. at demonstrates higher slope values and lower mpd for features reflecting the dominance of fast twitch fibers in their gl. features derived from the reassigned morlet scalogram exhibited higher statistical significance in differentiating the signals of nat and at when compared to previously reported fiber type sensitive semg features. esd exhibited a maximum statistical significance of p = 8.42e 07 in differentiating the signals during a nf state. thus the proposed method is found reliable for the noninvasive assessment of fast twitch fiber dominance in at. the study can be extended for the automatic identification of muscle typology in aspiring at which may find applications in sports science.", "Doi": "10.1109/TIM.2024.3376019", "Key Words": ["electromyography", "lower limb muscles", "measurement error", "muscle fatigue", "muscle fiber type analysis", "reassigned morlet scalogram", "sprinters", "time-frequency analysis"]}