{"Title": "AoI-Aware Energy-Efficient SFC in UAV-Aided Smart Agriculture Using Asynchronous Federated Learning", "Doi": "10.1109/OJCOMS.2024.3363132", "Authors": ["m. akbari", "a. syed", "w. s. kennedy", "m. erol-kantarci"], "Key Words": ["internet of things", "uav-aided mobile edge computing (uav-aided mec)", "age of information", "network function virtualization", "federated reinforcement learning"], "Abstract": "in the midst of rising global population and environmental challenges smart agriculture emerges as a vital solution by integrating advanced technologies to optimize agricultural practices. through data driven insights and automation it tackles the necessity for sustainable resource management enhancing productivity and resilience in the face of complex food security and ecological concerns. the prospects of utilizing the internet of things  iot  for smart agriculture are tremendous where many iot devices can be deployed for local environment monitoring precision farming autonomous irrigation and soil management. in some use cases like smart monitoring and agrochemical applications uav enabled mobile edge computing  mec  is proposed as an enabler to provide iot nodes with additional resources by hosting their computation functions. from the implementation perspective to flexibly manage the computation functions in uavs and or mec server the emerging network function virtualization  nfv  can be utilized. however efficient orchestration of the virtualized functions would be a challenge. in this paper we consider a decentralized uav aided mec system for smart agricultural applications in which the processing nodes benefit from the nfv technology. we aim to propose a method for efficiently orchestrating the nfvs while some important metrics are minimized i.e. the age of information  aoi  and total network energy consumption. especially we consider the case in which the network state is not fully observable to the orchestrator or the observations are exposed to uncertainties. consequently the problem is formulated as a decentralized partially observable markov decision process  dec pomdp . as the formulated problem is np complete we exploit some structural features of the proposed scheme to introduce the concept of symmetry and simplify the problem. then a novel decentralized federated learning based solution is proposed to solve the problem. simulation results show the effectiveness of the proposed approach in minimizing the total network energy consumption and achieving  $aoi$  values less than  $200\\ msec$  to support demanding real time applications.", "Pub Date": "2024-02-28"}