{"Title": "AoI-Aware Scheduling for Air-Ground Collaborative Mobile Edge Computing", "Doi": "10.1109/TWC.2022.3215795", "Authors": ["z. qin", "z. wei", "y. qu", "f. zhou", "h. wang", "d. w. k. ng", "c. -b. chae"], "Key Words": ["age of information (aoi)", "air-ground collaborative", "mobile edge computing (mec)", "task scheduling", "resource allocation", "trajectory optimization"], "Abstract": "as a way of providing users flexible computing services networks exist that can make full use of air and ground computing resources. such networks are called air ground collaborative mobile edge computing  agc mec  networks. agc mec supports numerous emerging real time applications for which timely computed results are critical. researchers have developed a novel metric ‚äúage of information  aoi ‚äù that can capture the freshness of computed results. this is the first paper to study the problem of aoi aware scheduling for air ground collaborative mobile edge computing  i.e. iace . so as to minimize the weighted aoi of all the terrestrial user equipments  ues  we have jointly optimized task scheduling computing resource allocation and unmanned aerial vehicle  uav  trajectory taking into account the constraints on the computing resources and the available energy of the uav. the formulated problem which is a challenge to solve is a mixed integer nonlinear programming  minlp  problem. to obtain an effective solution we propose an iterative algorithm based on the alternating optimization approach which entails dividing the considered problem into three subproblems. extensive simulations show that the proposed algorithm can achieve lower weighted aoi than five benchmark algorithms while satisfying the resource constraints. furthermore simulation results demonstrate two interesting insights. first the introduction of an aerial mec server facilitates a flexible offloading design of the ues which is critical to guaranteeing the freshness of computed results. second by optimizing the scheduling the proposed design can unlock performance gains especially in the resource limited regime.", "Pub Date": "2023-05-09"}