{"Title": "Applied Linguistics With Red-Tailed Hawk Optimizer-Based Ensemble Learning Strategy in Natural Language Processing", "Doi": "10.1109/ACCESS.2023.3331061", "Authors": ["h. j. alshahrani", "a. q. a. hassan", "n. s. almalki", "m. m. alnfiai", "a. s. salama", "m. a. hamza"], "Key Words": ["sentiment analysis", "natural language processing", "red-tailed hawk optimizer", "deep learning", "ensemble learning"], "Abstract": "natural language processing  nlp  is the most vital technology in currently utilized specifically caused by the huge and growing count of online texts that requires that understood for its massive value that completely asserted. nlp is create a sense of unstructured data which are created by social networks and other social data sources and is supported to organize them into an additional structured model that assists several kinds of tasks and applications. sentiment analysis  sa  a subfield of nlp contains determining the sentiment expressed or emotional tone from a piece of text. deep learning  dl  approaches are significantly advanced the field of sa permitting for more accurate and nuanced classification of sentiments from the text data. in this article we present an advanced sentiment analysis using a red tailed hawk optimizer with ensemble learning  asa rthel  strategy in nlp. the aim of asa rthel technique is to exploit the strategies of ensemble learning with a hyperparameter tuning process for sa. the asa rthel technique mainly follows an ensemble learning based classification process which combines prediction from three dl approaches convolutional neural network  cnn  gated recurrent unit  gru  and long short term memory  lstm . the ensemble process results in enhanced sa performance and decreases the risk of depending only on a single model bias or error. to boost the sa performance the hyperparameter tuning strategy is performed by the use of the rth algorithm. an extensive set of experiments were carried out for ensuring the superior sa results of asa rthel technique. the comprehensive comparison study highlighted the enhanced results of the mponlp tsa method on the recognition of various kinds of sentiments.", "Pub Date": "2023-11-30"}