{"Title": "Approximately Lossless Model Compression-Based Multilayer Virtual Network Embedding for Edge‚ÄìCloud Collaborative Services", "Doi": "10.1109/JIOT.2023.3259380", "Authors": ["z. yang", "r. gu", "h. li", "y. ji"], "Key Words": ["edge-cloud collaboration", "elastic optical networks (eons)", "hopfield neural network (hnn)", "virtual network embedding (vne)"], "Abstract": "edge‚äìcloud collaboration integrated with network virtualization is indispensable for diversified edge services. meanwhile the multilayer elastic optical network  ml eon  is a promising underlying network for virtual network requests  vnrs  customized for edge‚äìcloud collaborative services. however the joint allocation of computing resources and high dimensional ml eon resources in virtual network embedding  vne  will pose great computational complexity for online service deployment. in this article we propose an approximately lossless model compression mechanism to ease the computing burden of the vne over ml eon for edge‚äìcloud collaborative services. an integer quadratic constraint programming  iqcp  model is established for the problem. model compression based on virtual link mapping cost estimation  vlmce  is investigated to shield the variables and constraints related to ml eon. in particular the resource metric and topology metric are introduced into vlmce to cope with resource contentions among virtual links in the same vnr and improve estimation accuracy. the model solving relies on hopfield neural network  hnn  is further studied where optimizing the compressed model is losslessly converted to minimizing the energy function of hnn. the experimental results reveal that the proposed mechanism guarantees an approximately lossless algorithm performance and a high time efficiency compared with the original iqcp model. the performances of vnr cost and blocking ratio are also promoted compared with the benchmarks.", "Pub Date": "2023-07-06"}