{"Title": "Approaches to Overpower Proof-of-Work Blockchains Despite Minority", "Authors": ["h. baniata", "a. kertesz"], "Pub Date": "2023-01-11", "Abstract": "blockchain  bc  technology has been established in 2009 by nakamoto using the proof of work  pow  to reach consensus in public permissionless networks  praveen et al. 2020 . since then several consensus algorithms were proposed to provide equal  or higher  levels of security democracy and scalability yet with lower levels of energy consumption. however nakamoto‚äôs model  a.k.a. bitcoin  still dominates as the most trusted model in the described sittings since alternative solutions might provide lower energy consumption and higher scalability but they would always require deviating the system towards unrecommended centralization or lower levels of security. that is nakamoto‚äôs model claims to tolerate  up to  < 50% of the network being controlled by a dishonest party  minority  which cannot be realized in alternative solutions without sacrificing the full decentralization property. in this paper we investigate this tolerance claim and we review several approaches that can be used to undermine overpower pow based bcs even with minority. we discuss those bcs taking bitcoin as a representative application where needed. however the presented approaches can be applied in any pow based bc. specifically we technically discuss how a dishonest miner in minority can take over the network using improved brute forcing artificial intelliegence assisted mining quantum computing sharding partial pre imaging selfish mining among other approaches. our review serves as a needed collective technical reference  concluding more than 100 references  for practitioners and researchers who either seek a reliable security implementation of pow based bc applications or seek a comparison of pow based against other bcs in terms of adversary tolerance.", "Doi": "10.1109/ACCESS.2023.3234322", "Key Words": ["blockchain", "proof-of-work", "security", "quantum computing", "sharding", "machine learning"]}