{"Title": "Approaching Collateral Optimization for NISQ and Quantum-Inspired Computing (May 2023)", "Authors": ["m. c. giron", "g. korpas", "w. parvaiz", "p. malik", "j. aspman"], "Pub Date": "2023-10-19", "Abstract": "collateral optimization refers to the systematic allocation of financial assets to satisfy obligations or secure transactions while simultaneously minimizing costs and optimizing the usage of available resources. this involves assessing the number of characteristics such as the cost of funding and quality of the underlying assets to ascertain the optimal collateral quantity to be posted to cover exposure arising from a given transaction or a set of transactions. one of the common objectives is to minimize the cost of collateral required to mitigate the risk associated with a particular transaction or a portfolio of transactions while ensuring sufficient protection for the involved parties. often this results in a large scale combinatorial optimization problem. in this study we initially present a mixed integer linear programming formulation for the collateral optimization problem followed by a quadratic unconstrained binary optimization  qubo  formulation in order to pave the way toward approaching the problem in a hybrid quantum and noisy intermediate scale quantum ready way. we conduct local computational small scale tests using various software development kits and discuss the behavior of our formulations as well as the potential for performance enhancements. we find that while the qubo based approaches fail to find the global optima in the small scale experiments they are reasonably close suggesting their potential for large instances. we further survey the recent literature that proposes alternative ways to attack combinatorial optimization problems suitable for collateral optimization.", "Doi": "10.1109/TQE.2023.3314839", "Key Words": ["financial management", "mathematical programming", "optimization", "quantum annealing (qa)", "quantum computing", "simulated annealing (sa)"]}