{"Title": "ARARAT: A Collaborative Edge-Assisted Framework for HTTP Adaptive Video Streaming", "Doi": "10.1109/TNSM.2022.3210595", "Authors": ["r. farahani", "m. shojafar", "c. timmerer", "f. tashtarian", "m. ghanbari", "h. hellwagner"], "Key Words": ["http adaptive streaming (has)", "network assisted video streaming", "software-defined networking (sdn)", "network function virtualization (nfv)", "edge computing", "edge collaboration", "video transcoding"], "Abstract": "with the ever increasing demands for high definition and low latency video streaming applications network assisted video streaming schemes have become a promising complementary solution in the http adaptive streaming  has  context to improve users‚äô quality of experience  qoe  as well as network utilization. edge computing is considered one of the leading networking paradigms for designing such systems by providing video processing and caching close to the end users. despite the wide usage of this technology designing network assisted has architectures that support low latency and high quality video streaming including edge collaboration is still a challenge. to address these issues this article leverages the software defined networking  sdn  network function virtualization  nfv  and edge computing paradigms to propose a collaborative edge assisted framework for http adaptive video streaming  ararat . aiming at minimizing has clients‚äô serving time and network cost besides considering available resources and all possible serving actions we design a multi layer architecture and formulate the problem as a centralized optimization model executed by the sdn controller. however to cope with the high time complexity of the centralized model we introduce three heuristic approaches that produce near optimal solutions through efficient collaboration between the sdn controller and edge servers. finally we implement the ararat framework conduct our experiments on a large scale cloud based testbed including 250 has players and compare its effectiveness with state of the art systems within comprehensive scenarios. the experimental results illustrate that the proposed ararat methods   ${i}$   improve users‚äô qoe by at least 47%  ii  decrease the streaming cost including bandwidth and computational costs by at least 47% and  iii  enhance network utilization by at least 48% compared to state of the art approaches.", "Pub Date": "2023-03-10"}