{"Title": "Are European Initiatives Related to Local Spectrum Allocation for Private 5G Networks Ready for Use in Industrial Cases?", "Doi": "10.1109/ACCESS.2024.3356790", "Authors": ["l. m. bartol√≠n-arnau", "j. vera-p√©rez", "v. sempere-pay√°", "j. silvestre-blanes"], "Key Words": ["3gpp", "cpcs", "cloud computing", "private 5g networks", "local spectrum", "simu5g", "vertical domains"], "Abstract": "the introduction of the factory of the future has revolutionised the manufacturing sector through the integration of various technologies such as automated guided vehicles  agvs  artificial intelligence  artificial intelliegence  the industrial internet of things  iiot  cloud computing and cyber physical control systems  cpcs . these advances have created the need to develop novel communication systems to support new industrial requirements. therefore the fifth generation of mobile networks  5g  has become one of the most relevant alternatives in this field. however the current regulations in europe and the spectrum reserved for private 5g may not be sufficient to meet the requirements of some of the industrial applications for which it was conceived. therefore it is necessary to analyse the private 5g network to identify the performance thresholds according to the requirements set by the 3rd generation partnership project  3gpp  for the selected industrial scenarios. this work proposes a comprehensive analysis of the feasibility of private 5g infrastructures to meet the industrial requirements studied for different use cases proposed by 3gpp. for this purpose laboratory tests have been carried out to analyse the performance of a 5g physical network infrastructure and the results were compared with those obtained after modelling different scenarios using simu5g a 5g simulator based on the omnet++ framework. the conclusions drawn from this work have shown that although 5g technology is a key enabler for the industrial sector there are european private spectrum reservation initiatives that do not have sufficient performance to meet the more restrictive requirements for different uses defined by 3gpp and therefore need to be adapted to drive the adoption of new spectrum reservations for this type of private infrastructure in industry.", "Pub Date": "2024-02-08"}