{"Title": "Artificial Intelligence and Biosensors in Healthcare and Its Clinical Relevance: A Review", "Doi": "10.1109/ACCESS.2023.3285596", "Authors": ["r. qureshi", "m. irfan", "h. ali", "a. khan", "a. s. nittala", "s. ali", "a. shah", "t. m. gondal", "f. sadak", "z. shah", "m. u. hadi", "s. khan", "q. al-tashi", "j. wu", "a. bermak", "t. alam"], "Key Words": ["artificial intelligence", "explainable ai", "medical imaging", "domain adaptation", "biosensors", "federated learning", "big data analytics", "large language models"], "Abstract": "data generated from sources such as wearable sensors medical imaging personal health records and public health organizations have resulted in a massive information increase in the medical sciences over the last decade. advances in computational hardware such as cloud computing graphical processing units  gpus  field programmable gate arrays  fpgas  and tensor processing units  tpus  provide the means to utilize these data. consequently an array of sophisticated artificial intelligence  ai  techniques have been devised to extract valuable insights from the extensive datasets in the healthcare industry. here we present an overview of recent progress in ai and biosensors in medical and life sciences. we discuss the role of machine learning in medical imaging precision medicine and biosensors for the internet of things  iot . we review the latest advancements in wearable biosensing technologies. these innovative solutions employ ai to assist in monitoring of bodily electro physiological and electro chemical signals as well as in disease diagnosis. these advancements exemplify the trend towards personalized medicine delivering highly effective cost efficient and precise point of care treatment.furthermore an overview of the advances in computing technologies such as accelerated ai edge computing and federated learning for medical data are also documented. finally we investigate challenges in data driven ai approaches the potential issues generated by biosensors and iot based healthcare and the distribution shifts that occur among different data modalities concluding with an overview of future prospects.", "Pub Date": "2023-06-23"}