{"Title": "Artificial Intelligence-Defined Wireless Networking for Computational Offloading and Resource Allocation in Edge Computing Networks", "Doi": "10.1109/OJCOMS.2024.3382265", "Authors": ["s. d. a. shah", "m. a. gregory", "f. bouhafs", "f. d. hartog"], "Key Words": ["edge computing", "resource management", "ai", "wireless networks", "sdn", "task offloading", "5g and beyond"], "Abstract": "the advent of the internet of everything and new ultra reliable low latency communication  urllc  services has resulted in an exponential growth in data demands at the network‚äôs edge. to meet the stringent performance requirements of evolving 5g  and beyond  applications deploying dedicated resources closer to mobile users is essential. multi access edge computing  mec  is a promising technology for bringing computational resources closer to users. however the distributed and limited mec resources must be effectively optimized to maximize the number of mobile users benefiting from low latency mec services at each time slot in highly congested large scale and dynamic wireless network scenarios. in this research we propose and evaluate a novel artificial intelligence defined wireless networking  aidwn  approach that builds on conventional software defined networking  sdn  implementing a new artificial intelliegence defined application plane for computational offloading and resource allocation in mec enabled wireless networks. the aidwn approach implements a deep reinforcement learning framework and deep neural networks that dynamically adapt optimal computational offloading and wireless resource allocation decisions while considering the handover mobility and coordinated resource allocation challenges in highly dynamic and mobile multi mec server environments. compared to recent state of the art proposals the proposed aidwn demonstrates a substantial performance improvement utilizing more than 90% of mec resources per time slot across all mec servers. it also accommodates significantly more mobile users in highly congested wireless network scenarios. we identified various future research directions highlighting the potential of the aidwn approach in simplifying the management of next generation wireless networks.", "Pub Date": "2024-04-11"}