{"Title": "Artificial Intelligence in Engineering and Society: Blue Skies, Black Holes, and the Job of Requirements Engineers (Keynote)", "Doi": "10.1109/REW57809.2023.00018", "Authors": ["a. ferrari"], "Key Words": ["requirements engineering", "large language models", "artificial intelligence"], "Abstract": "the democratization of artificial intelligence  ai  has brought substantial achievements in science engineering disciplines and society as a whole. new technologies based on large language models multi modal learning embodied ai and the quest for artificial general intelligence  agi  promise to further change the world landscape as we know it. at the same time ai rapid and uncontrolled evolution also poses serious risks to society such as the concentration of power exclusion discrimination and manipulation of reality. the keynote will present some experiences in ai democratization including the usage of explainable machine learning approaches for agronomists nlp based solutions for railway engineers image processing techniques for the maintenance of riverbeds and mobile data processing in road safety assessment. the talk will outline the latest technological advancements in ai e.g. in healthcare and science and will show how large language models like chatgpt and bing chat can solve long standing requirements engineering  re  problems. for example requirements completeness can be easily checked and addressed with simple prompts and model generation from requirements becomes a one click task. the keynote will then describe the risks that current ai development poses to society. besides the increasingly convincing deep fakes and the widely discussed risks for privacy and reputation we must be aware of the uncontrolled speed of ai evolution. as ai continues to advance it will replace many jobs that require intellectual skills. this could lead to a significant number of people losing their jobs as they may not have the necessary skills to adapt to the new labour market. people and entire countries that cannot exploit technological developments will be excluded from the game and this will cause resentment and the possible emergence of new fundamentalism. the race for semiconductors is already creating hot spots and rifts between the superpowers. in this context re researchers are called to new technical and societal challenges. with pieces of code and even entire programs that can be automatically generated with large language models the craft of prompting becomes the new requirements specification and the concept of structured apis dissolves into natural language interfaces. at the societal level ai regulations are making their first steps and we are called to contribute to operationalise the norms while preventing over regulation. equipped with years of experience at the boundary of the technical and social facets of systems re researchers are pivotal subjects in the new golden age of ai.", "Pub Date": "2023-09-28"}