{"Title": "ARWGAN: Attention-Guided Robust Image Watermarking Model Based on GAN", "Authors": ["j. huang", "t. luo", "l. li", "g. yang", "h. xu", "c. -c. chang"], "Pub Date": "2023-06-28", "Abstract": "in the existing deep learning based watermarking models extracted image features for fusing with watermark are not abundant enough and more critically and essential features are not highlighted to be learned with the purpose of robust watermarking both of which limit the watermarking performance. to solve those two drawbacks this article proposes an attention guided robust image watermarking model based on a generative adversarial network  arwgan . to acquire a great deal of representational image features a feature fusion module  ffm  is devised to learn shallow and deep features effectively for multilayer fusion with watermark and meanwhile reuse of those features by the dense connection enhances robustness. to alleviate image distortion caused by embedding watermark an attention module  am  is deployed to compute the attention mask by mining the global features of the original image. specifically with the guidance of the attention mask image features representing inconspicuous regions and texture regions are enhanced for embedding the high strength of watermark and simultaneously other features are suppressed to improve the watermarking performance. furthermore the noise subnetwork is adopted for robustness enhancement by simulating various image attacks in iterative training. the discriminator is used to distinguish the encoded image from the original image for improving watermarking invisibility continuously. experimental results demonstrate that the arwgan is superior to the existing state of the art  sota  watermarking models and ablation experiments prove the effectiveness of the ffm and the am. the code is available at https //github.com river huang arwgan.", "Doi": "10.1109/TIM.2023.3285981", "Key Words": ["attention mask", "dense connection", "feature fusion", "generative adversarial network (gan)", "robust watermarking"]}