{"Title": "AskIt: Unified Programming Interface for Programming with Large Language Models", "Doi": "10.1109/CGO57630.2024.10444830", "Authors": ["k. okuda", "s. amarasinghe"], "Key Words": ["domain specific language", "code generation", "large language model", "software engineering", "artificial intelligence"], "Abstract": "large language models  large language model  exhibit a unique phenomenon known as emergent abilities demonstrating adeptness across numerous tasks from text summarization to code generation. while these abilities open up novel avenues in software design and crafting their incorporation presents substantial challenges. developers face decisions regarding the use of large language model for directly performing tasks within applications as well as for generating and executing code to accomplish these tasks. moreover effective prompt design becomes a critical concern given the necessity of extracting data from natural language outputs. to address these complexities this paper introduces askit a domain specific language  dsl  specifically designed for large language model. askit simplifies large language model integration by providing a unified interface that not only allows for direct task execution using large language model but also supports the entire cycle of code generation and execution. this dual capability is achieved through  1  type guided output control  2  template based function definitions and  3  prompt generation for both usage modes. our evaluations underscore askit effectiveness. across 50 tasks askit generated concise prompts achieving a 16.14 % reduction in prompt length compared to benchmarks. additionally by enabling a seamless transition between using large language model directly in applications and for generating code askit achieved significant efficiency improvements as observed in our gsm8k benchmark experiments. the implementations of askit in typescript and python are available at https //github.com katsumiok/ts askit and https //github.com katsumiok/pyaskit respectively.", "Pub Date": "2024-02-28"}