{"Title": "Asymptotically Optimal Circuit Depth for Quantum State Preparation and General Unitary Synthesis", "Authors": ["x. sun", "g. tian", "s. yang", "p. yuan", "s. zhang"], "Pub Date": "2023-09-19", "Abstract": "the quantum state preparation problem aims to prepare an  $n$  qubit quantum state  $|\\psi  {v}\\rangle =\\sum  {k=0}^{2^{n} 1}v {k}|k\\rangle $  from the initial state  $|0\\rangle ^{\\otimes n}$  for a given unit vector  $v= v {0}v {1}v {2}\\ldotsv {2^{n} 1} ^{t}\\in \\mathbb {c}^{2^{n}}$  with  $\\|v\\| {2} = 1$ . the problem is of fundamental importance in quantum algorithm design hamiltonian simulation and quantum machine learning yet its circuit depth complexity remains open when ancillary qubits are available. in this article we study quantum circuits when there are  $m$  ancillary qubits available. we construct for any  $m$  circuits that can prepare  $|\\psi  {v}\\rangle $  in depth  $\\tilde o {} {2^{n}}/[{m+n}] +n $  and size  $o 2^{n} $  achieving the optimal value for both measures simultaneously. these results also imply a depth complexity of  $\\theta  {}{4^{n}}/[{m+n}] $  for quantum circuits implementing a general  $n$  qubit unitary for any  $m \\le o 2^{n}/n $  number of ancillary qubits. this resolves the depth complexity for circuits without ancillary qubits. and for circuits with exponentially many ancillary qubits our result quadratically improves the currently best upper bound of  $o 4^{n} $  to  $\\tilde \\theta  2^{n} $ . our circuits are deterministic prepare the state and carry out the unitary precisely utilize the ancillary qubits tightly and the depths are optimal in a wide parameter regime. the results can be viewed as  optimal  time space tradeoff bounds which is not only theoretically interesting but also practically relevant in the current trend that the number of qubits starts to take off by showing a way to use a large number of qubits to compensate the short qubit lifetime.", "Doi": "10.1109/TCAD.2023.3244885", "Key Words": ["circuit depth", "depth-space tradeoff", "quantum circuit", "state preparation", "unitary synthesis"]}