{"Title": "Asymmetric Teacher‚ÄìStudent Feature Pyramid Matching for Industrial Anomaly Detection", "Authors": ["j. zhu", "p. yan", "j. jiang", "y. cui", "x. xu"], "Pub Date": "2023-12-22", "Abstract": "visual anomaly detection plays an important role in industrial product quality inspection but the scarcity of anomaly samples makes the training of supervised models extremely challenging. many knowledge distillation based unsupervised detection methods have been proposed recently  however these anomaly detection methods mostly use similar or identical symmetric structures to build teacher‚äìstudent  t‚äìs  models which hinders the different expression of anomalies between t‚äìs networks. to address this issue this article proposes an asymmetric t‚äìs feature pyramid matching network  atsn . this network consists of a teacher network a student network and a lightweight feature fusion module  ffm . the teacher network is constructed with resnet18 and the student network comprises a u shaped network consisting of an encoder and a decoder. in the knowledge transfer process the encoder acts as an intermediate transmitter of information and the decoder reconstructs the information transmitted by the encoder into multiscale features. the u shaped design can effectively improve the accuracy of knowledge transfer thus increasing the differences in anomalous representation via t‚äìs feature pyramid matching. additionally an ffm is used to fuse the correct information from the multiscale feature representation in the encoder and the decoder thereby compensating for the loss of key information in the decoder and further increasing the difference in anomalous representation. experiments on the mvtec ad dataset show that our proposed method surpasses the current state of the art methods.", "Doi": "10.1109/TIM.2023.3338681", "Key Words": ["anomaly detection", "asymmetric", "convolutional neural network", "knowledge distillation", "multiscale feature fusion"]}