{"Title": "Autocompletion of Chief Complaints in the Electronic Health Records using Large Language Models", "Doi": "10.1109/BigData59044.2023.10386778", "Authors": ["k. m. s. islam", "a. s. nipu", "p. madiraju", "p. deshpande"], "Key Words": ["chief complaint", "electronic health record", "text generation", "large language model", "biogpt", "prompt engineering", "lstm"], "Abstract": "the chief complaint  cc  is a crucial component of a patient‚äôs medical record as it describes the main reason or concern for seeking medical care. it provides critical information for healthcare providers to make informed decisions about patient care. however documenting ccs can be time consuming for healthcare providers especially in busy emergency departments. to address this issue an autocompletion tool that suggests accurate and well formatted phrases or sentences for clinical notes can be a valuable resource for triage nurses. in this study we utilized text generation techniques to develop machine learning models using cc data. in our proposed work we train a long short term memory  lstm  model and fine tune three different variants of biomedical generative pretrained transformers  biogpt  namely microsoft biogpt microsoft biogpt large and microsoft biogpt large pubmedqa. additionally we tune a prompt by incorporating exemplar cc sentences utilizing the openai api of gpt 4. we evaluate the models‚äô performance based on the perplexity score modified bertscore and cosine similarity score. the results show that biogpt large exhibits superior performance compared to the other models. it consistently achieves a remarkably low perplexity score of 1.65 when generating cc whereas the baseline lstm model achieves the best perplexity score of 170. further we evaluate and assess the proposed models‚äô performance and the outcome of gpt 4.0. our study demonstrates that utilizing llms such as biogpt leads to the development of an effective autocompletion tool for generating cc documentation in healthcare settings.", "Pub Date": "2024-01-22"}