{"Title": "AutoProfile: An Intelligent Profile Switching System for Smartphones", "Authors": ["w. yang", "s. chen", "z. wang", "y. xu", "l. huang"], "Pub Date": "2023-05-05", "Abstract": "smartphones have been the necessities for us due to their advanced computing capabilities and ubiquitous connectivity to our daily lives. however they also produce many negative influences such as ring noise nuisance calls which interrupt people‚äôs attention when working. it would be user friendly if smartphones can automatically sense the surroundings and dynamically work at an appropriate profile to prevent their ringing from disturbing people in some special circumstances. to address this issue in this paper we propose a novel smartphone profile switching system called autoprofile which combines the techniques of acoustic sensing walk detection and machine learning to automatically and dynamically change smartphones‚äô profiles in different scenarios. we develop a new compact ambient sound scheme for feature extraction named dwt & mfcc fingerprint which can effectively distinguish between different social scenarios and outperforms the existing method. to evaluate the performance of autoprofile we conduct experiments in 8 scenarios and take multiple influence factors into consideration. the results demonstrate that autoprofile can realize overall recognition accuracies of $91.4 \\ \\%$91.4% and $90.6 \\ \\%$90.6% when using random forest and $k$k nearest neighbors classifiers respectively. moreover since autoprofile senses the ambient sound passively it does not create additional noise compared with some active acoustic sensing schemes. in addition the power consumption of autoprofile is acceptable and thus autoprofile can be tailored as a background service of smartphones to make them become ‚äúsmarter‚äù.", "Doi": "10.1109/TMC.2022.3141205", "Key Words": ["mobile computing", "context awareness", "acoustic sensing", "smartphone notification management"]}