{"Title": "Aveiro Tech City Living Lab: A Communication, Sensing, and Computing Platform for City Environments", "Doi": "10.1109/JIOT.2023.3262627", "Authors": ["p. rito", "a. almeida", "a. figueiredo", "c. gomes", "p. teixeira", "r. rosmaninho", "r. lopes", "d. dias", "g. v√≠tor", "g. perna", "m. silva", "c. senna", "d. raposo", "m. lu√≠s", "s. sargento", "a. oliveira", "n. b. de carvalho"], "Key Words": ["connectivity management", "smart cities", "software-defined networks", "test-bed and trials", "vehicular networks"], "Abstract": "this article presents the deployment and experimentation architecture of the aveiro tech city living lab  atcll  in aveiro portugal. this platform comprises a large number of internet of things  iot  devices with communication sensing and computing capabilities. the communication infrastructure built on fiber and millimeter wave  mmwave  links integrates a communication network with radio terminals [wifi its g5 cellular vehicular to everything 5g and lora wan ] multiprotocol spread throughout 44 connected points of access in the city. additionally public transportation has also been equipped with communication and sensing units. all these points combine and interconnect a set of sensors such as mobility  radars light detection and rangings  lidars  and video cameras  and environmental sensors. combining edge computing and cloud management to deploy the services and manage the platform and a data platform to gather and process the data the living lab supports a wide range of services and applications  iot intelligent transport systems  itss  and assisted driving environmental monitoring emergency and safety and among others. this article describes the architecture implementation and deployment to make the overall platform to work and integrate researchers and citizens. moreover it showcases some examples of the performance metrics achieved in the city infrastructure the data that can be collected visualized and used to build services and applications to the cities and finally different use cases in the mobility and safety scenarios.", "Pub Date": "2023-07-25"}