{"Title": "B-Detection: Runtime Reliability Anomaly Detection for MEC Services With Boosting LSTM Autoencoder", "Doi": "10.1109/TMC.2023.3262233", "Authors": ["l. wang", "s. chen", "f. chen", "q. he", "j. liu"], "Key Words": ["anomaly detection", "boosting", "concept drift", "deep learning", "mec service", "lstm autoencoder"], "Abstract": "by pushing computing resources from the cloud to the network edge close to mobile users mobile edge computing  mec  enables low latency for a wide variety of applications. nevertheless in dynamic mec systems mec services are challenged by the risks of runtime reliability anomalies. detecting runtime reliability anomalies for mec services is challenging yet critical to ensuring the stability of mec systems. the effectiveness of existing anomaly detection methods suffers from poor performance when handling mec services‚äô large volume continuous and volatile reliability streaming data. the key is to identify significant changes in the distribution of mec services‚äô current reliability streaming data compared with their historical performance. inspired by concept drift this paper proposes b detection a boosting long short term memory  lstm  autoencoder for detecting mec services‚äô runtime reliability anomalies based on distribution dissimilarity evaluation. b detection employs a deep learning method named lstm autoencoder to characterize the mec services‚äô historical reliability data distribution. to cope with the challenge of modeling complex distribution characteristics of mec services‚äô historical reliability streaming data and guarantee the real time performance of b detection we enhance lstm autoencoder with a weight based reservoir sampling technique and an lstm boosting algorithm. the reconstruction loss of the trained lstm autoencoder model is estimated for the up to date reliability streaming data and the result is used to infer mec services‚äô runtime reliability anomalies. the performance of b detection is verified through a series of experiments conducted on a real world dataset.", "Pub Date": "2024-03-07"}