{"Title": "Balancing Performance and Energy Consumption of Bagging Ensembles for the Classification of Data Streams in Edge Computing", "Doi": "10.1109/TNSM.2022.3226505", "Authors": ["g. cassales", "h. m. gomes", "a. bifet", "b. pfahringer", "h. senger"], "Key Words": ["edge computing", "machine learning", "data stream classification", "ensembles", "energy consumption"], "Abstract": "in recent years the edge computing  ec  paradigm has emerged as an enabling factor for developing technologies like the internet of things  iot  and 5g networks bridging the gap between cloud computing services and end users supporting low latency mobility and location awareness to delay sensitive applications. an increasing number of solutions in ec have employed machine learning  ml  methods to perform data classification and other information processing tasks on continuous and evolving data streams. usually such solutions have to cope with vast amounts of data that come as data streams while balancing energy consumption latency and the predictive performance of the algorithms. ensemble methods achieve remarkable predictive performance when applied to evolving data streams due to several models and the possibility of selective resets. this work investigates a strategy that introduces short intervals to defer the processing of mini batches. well balanced our strategy can improve the performance  i.e. delay throughput  and reduce the energy consumption of bagging ensembles to classify data streams. the experimental evaluation involved six state of art ensemble algorithms  ozabag ozabag adaptive size hoeffding tree online bagging adwin leveraging bagging adaptive randomforest and streaming random patches  applying five widely used machine learning benchmark datasets with varied characteristics on three computer platforms. as a result our strategy can significantly reduce energy consumption in 96% of the experimental scenarios evaluated. despite the trade offs it is possible to balance them to avoid significant loss in predictive performance.", "Pub Date": "2023-10-09"}