{"Title": "Bandit Learning-Based Distributed Computation in Fog Computing Networks: A Survey", "Doi": "10.1109/ACCESS.2023.3314889", "Authors": ["h. tran-dang", "k. -h. kwon", "d. -s. kim"], "Key Words": ["fog computing network", "distributed computation offloading", "multi-armed bandit (mab) learning", "reinforcement learning", "non-stationary bandit", "contextual bandit", "non-contextual bandit", "resource allocation"], "Abstract": "fog computing is a decentralized computing infrastructure that extends the capabilities of cloud computing closer to the edge of the network. in a fog computing network  fcn  computing resources such as processing power storage and networking are distributed at various points in the network including edge devices fog nodes  fns  such as access points gateways and local servers. this architecture allows resource limited end devices to offload part of their computational tasks to nearby fns to achieve the reduced response delay services and energy efficiency. however the high dynamics and complicated heterogeneity of fog computing environment in many application scenarios result in the uncertainty of network information that is raised as a critical challenge to design efficient computation offloading strategies. meanwhile existing solutions such as centralized optimization matching and game theory based decentralized offloading are inadequate to be adopted in this context because they require the perfect knowledge of system parameters. considering as a promising approach to deal with the information uncertainty issues bandit learning has used recently to develop distributed computation offloading  dco  algorithms for the fcns. in this paper we aim at reviewing such of these state of the art dco solutions and elaborate their advantages and limitations. additionally we identify open research challenges and provide future directions for research in this area. our survey shows that bandit learning is a promising approach for efficient computation offloading in fog computing and we expect that future research will continue to explore its potential for improving the performance and energy efficiency of fog computing enabled systems.", "Pub Date": "2023-10-02"}