{"Title": "Basic Probability Assignment Using Intuitive Fuzzy Cloud Model for Information Fusion and Its Application in Fault Diagnosis", "Authors": ["k. zhou", "n. lu", "b. jiang"], "Pub Date": "2023-12-22", "Abstract": "multisensor information fusion technology has the capability to integrate information from multiple sources significantly enhancing system reliability and accuracy. it has been extensively used in various application domains where equipment fault diagnosis is a typical and important scenario desiring effective information fusion methods. the dempster‚äìshafer  ds  evidence theory is the most popular information fusion method which takes basic probability assignments  bpas  as its fusion elements. the precision of bpas directly affects the decision results  however it is still a challenging issue to obtain reliable bpas. this article proposes a novel approach for generating the bpas using the intuitive fuzzy cloud model  ifcm . this method allows for obtaining more precise bpas by quantifying comprehensively information uncertainty. firstly the initial single value bpas are generated based on the similarities among cloud models. since the initial bpas obtained tend to be rough intuitive fuzzy sets are subsequently introduced into the cloud models to get a more detailed partitioning of cloud models thus obtaining bpas with higher discriminability. finally the modified bpas are fused using the ds combination rules to obtain the decision results. to assess the effectiveness of the proposed bpas ifcm method comprehensive experimental verifications have been conducted. initially the proposed method is employed for fault diagnosis in railway vehicle doors providing a practical demonstration of its effectiveness. additionally the method is used to solve classification problems by using uci datasets in pattern recognition and machine learning. the experimental results compared to previous advanced methods indicate the superior performance of the proposed method.", "Doi": "10.1109/TIM.2023.3334361", "Key Words": ["basic probability assignments (bpas)", "dempster‚äìshafer (ds) evidence theory", "fault diagnosis", "information fusion", "intuitive fuzzy cloud model (ifcm)"]}