{"Title": "Bayesian-Based Classification Confidence Estimation for Enhancing SSVEP Detection", "Authors": ["y. zhang", "s. q. xie", "h. wang", "c. shi", "z. -q. zhang"], "Pub Date": "2023-06-26", "Abstract": "the brain‚äìcomputer interface  bci  enables paralyzed people to directly communicate with and operate peripheral equipment. the steady state visual evoked potential  ssvep  based bci system has been extensively investigated in recent years due to its fast communication rate and high signal to noise ratio. many present ssvep recognition methods determine the target class via finding the largest correlation coefficient. however the classification performance usually degrades when the largest coefficient is not significantly different from the rest of the values. this study proposed a bayesian based classification confidence estimation method to enhance the target recognition performance of ssvep based bci systems. in our method the differences between the largest and the other values generated by a basic target identification method are used to define a feature vector during the training process. the gaussian mixture model  gmm  is then employed to estimate the probability density functions of feature vectors for both correct and wrong classifications. subsequently the posterior probabilities of being an accurate and false classification are calculated via bayesian inference in the test procedure. a classification confidence value  ccvalue  is presented based on two posterior probabilities to estimate the classification confidence. finally the decision making rule can determine whether the present classification result should be accepted or rejected. extensive evaluation studies were performed on an open access benchmark dataset and a self collected dataset. the experimental results demonstrated the effectiveness and feasibility of the proposed method for improving the reliability of ssvep based bci systems.", "Doi": "10.1109/TIM.2023.3284952", "Key Words": ["bayesian inference", "brain-computer interface (bci)", "classification confidence estimation", "electroencephalography (eeg)", "steady-state visual evoked potential (ssvep)"]}