{"Title": "BEA-Net: Body and Edge Aware Network With Multi-Scale Short-Term Concatenation for Medical Image Segmentation", "Doi": "10.1109/JBHI.2023.3304662", "Authors": ["h. kuang", "y. wang", "y. liang", "j. liu", "j. wang"], "Key Words": ["body and edge generation", "body and edge supervision", "medical image segmentation", "multi-scale representation"], "Abstract": "medical image segmentation is indispensable for diagnosis and prognosis of many diseases. to improve the segmentation performance this study proposes a new 2d body and edge aware network with multi scale short term concatenation for medical image segmentation. multi scale short term concatenation modules which concatenate successive convolution layers with different receptive fields are proposed for capturing multi scale representations with fewer parameters. body generation modules with feature adjustment based on weight map computing via enlarging the receptive fields and edge generation modules with multi scale convolutions using sobel kernels for edge detection are proposed to separately learn body and edge features from convolutional features in decoders making the proposed network be body and edge aware. based on the body and edge modules we design parallel body and edge decoders whose outputs are fused to achieve the final segmentation. besides deep supervision from the body and edge decoders is applied to ensure the effectiveness of the generated body and edge features and further improve the final segmentation. the proposed method is trained and evaluated on six public medical image segmentation datasets to show its effectiveness and generality. experimental results show that the proposed method achieves better average dice similarity coefficient and 95% hausdorff distance than several benchmarks on all used datasets. ablation studies validate the effectiveness of the proposed multi scale representation learning modules body and edge generation modules and deep supervision.", "Pub Date": "2023-10-05"}