{"Title": "BIB-MKS: Post-Quantum Secure Biometric Identity-Based Multi-Keyword Search Over Encrypted Data in Cloud Storage Systems", "Authors": ["x. zhang", "c. huang", "d. gu", "j. zhang", "h. wang"], "Pub Date": "2023-02-06", "Abstract": "cloud computing technologies rely on powerful storage services and computing capabilities to maintain massive data for users. since many cloud storage data probably contain sensitive privacy information they are typically encrypted before outsourcing which simultaneously limits the availability due to the difficulty of encrypted data retrieval. public key encryption with keyword search  peks  contributes to searching target encrypted data with keywords. however majority of existing peks mechanisms require to manage certificates in the public key infrastructure  pki  they are also vulnerable to adversaries equipped with quantum computing devices in the near future. in this article we devise a biometric identity based multi keyword search  bib mks  mechanism from lattices over encrypted outsourced data which inherently resists quantum computing attacks. each user in bib mks is identified with her his biometric information which could be envisioned as the public key thereby avoiding complex certificate managements. particularly bib mks enables a data owner to produce an index associated with a biometric identity $bid^{\\prime }$bid' such that a user with a biometric identity $bid$bid issues multiple keywords in a single search query and retrieves corresponding encrypted data if and only if $bid$bid and $bid^{\\prime }$bid' are within a certain distance of each other as judged by some metric. bib mks narrows down the search scope and improves users search experience significantly. we define the formal security model of bib mks and prove the security of bib mks under this model. the performance evaluation demonstrates that bib mks is practical for post quantum secure cloud storage systems.", "Doi": "10.1109/TSC.2021.3112779", "Key Words": ["post-quantum security", "cloud storage systems", "lattices", "biometric identity", "multi-keyword search"]}