{"Title": "Binarized Neural Network for Edge Intelligence of Sensor-Based Human Activity Recognition", "Doi": "10.1109/TMC.2021.3109940", "Authors": ["f. luo", "s. khan", "y. huang", "k. wu"], "Key Words": ["human activity recognition", "binarized neural network", "edge computing", "edge intelligence", "radar sensors", "wearable sensors"], "Abstract": "a wide diversity of sensors has been applied in human activity recognition. these sensors generate enormous amounts of data during human activity monitoring. server based computing and cloud computing require to upload all sensor data to servers clouds for data processing and analysis. the long distance data traveling between sensors and servers increases the costs of bandwidth and latency. however human activity recognition has a high demand for real time processing. recently edge computing is surging to solve this problem by moving computation and data storage closer to the sensors rather than relying on a central server cloud. most human activity recognition is conducted by artificial intelligence which requires intensive computation and high power consumption. edge servers are usually designed for low power low cost and low computation. they do not support computation intensive deep learning algorithms or result in high latency. fortunately the development of binarized neural networks enables edge intelligence which supports artificial intelliegence running at the network edge for real time applications. in this paper we implement a binarized neural network  binarydilateddensenet  to enable low latency and low memory human activity recognition at the network edge. we applied the binarydilateddensenet on three sensor based human activity recognition datasets and evaluated it with four metrics. in comparison the binarydilateddensenet outperforms the related work and other three binarized neural networks in overall and saves $10\\times$10√ó memory and $4.5\\times$4.5√ó‚äì$8\\times$8√ó inference time compared to the fpdilateddensenet the full precision version of the binarydilateddensenet .", "Pub Date": "2023-02-03"}