{"Title": "Bio-Inspired Feature Selection in Brain Disease Detection via an Improved Sparrow Search Algorithm", "Authors": ["w. yu", "h. kang", "g. sun", "s. liang", "j. li"], "Pub Date": "2023-01-09", "Abstract": "the timely diagnosis and treatment of brain diseases have always been an essential part of saving patients with encephalopathy. at the same time medical image analysis is a significant step in diagnosing brain diseases. this article proposes a brain disease classification approach based on an improved sparrow search algorithm  issa . specifically a set of image features is first extracted to compose a pool of features for selection from five kinds of brain hemorrhage image datasets and one of the brain tumor image dataset. second we design an objective function to jointly reduce the number of the selected features and improve the classification accuracy. finally the proposed issa is utilized to solve the objective function. issa introduces three improvement mechanisms  the tent chaotic initialization a novel local search strategy and adaptive crossover operation to enhance the performance of conventional ssa. moreover a binary operator is used to solve the discrete feature selection problems. besides four machine learning algorithms which are the k nearest neighbor  knn  support vector machine decision tree and random forest are used to calculate the classification accuracy. experimental results show that the proposed issa with knn classifier eliminates about 65.9% of useless features while the classification accuracy rate reaches more than 85% which indicates that the proposed algorithm is more suitable for brain disease analysis than other comparison algorithms and other classifiers. moreover the effectiveness of the proposed improved mechanisms and the portability of different classifiers are evaluated by tests and convolutional neural networks are compared with issa to classify the brain computed tomography  ct  images.", "Doi": "10.1109/TIM.2022.3228003", "Key Words": ["bio-inspired computing", "brain diseases", "classification", "feature selection", "sparrow search algorithm (ssa)"]}