{"Title": "Bio-Inspired Feature Selection Algorithms With Their Applications: A Systematic Literature Review", "Authors": ["t. h. pham", "b. raahemi"], "Pub Date": "2023-05-10", "Abstract": "based on the principles of the biological evolution of nature bio inspired algorithms are gaining popularity in developing robust techniques for optimization. unlike gradient descent optimization methods these metaheuristic algorithms are computationally less expensive and can also considerably perform well with nonlinear and high dimensional data. objectives  to understand the algorithms application domains effectiveness and challenges of bio inspired feature selection techniques. method  a systematic literature review is conducted on five major digital databases of science and engineering. results  the primary search included 695 articles. after removing 263 duplicated articles 432 studies remained to be screened. among those 317 irrelevant papers were removed. we then excluded 77 studies according to the exclusion criteria. finally 38 articles were selected for this study. conclusion  out of 38 studies 28 papers discussed swarm based algorithms 2 papers studied genetic algorithms and 8 papers covered algorithms in both categories. considering the application domains 21 of the articles focused on problems in the healthcare sector while the rest mainly investigated issues in cybersecurity text classification and image processing. hybridization with other bias was employed by approximately 18.5% of papers and 13 out of 38 studies used s shaped transfer functions. the majority of studies used supervised classification methods such as k nn and svm for building fitness functions. accordingly we conclude that future research should focus on applying bio inspired feature selection to a diverse area of applications such as finance and social networks. and further exploration into enhancement techniques such as quantum representation rough set theory chaotic maps and l√©vy flight is necessary. additionally we suggest investigating other transfer functions besides s shaped such as v shaped and x shaped. moreover clustering and deep learning models for constructing fitness functions in bio inspired feature selection algorithms need to be investigated further.", "Doi": "10.1109/ACCESS.2023.3272556", "Key Words": ["bio-inspired optimization", "feature selection", "metaheuristics", "systematic literature review", "swarm intelligence"]}