{"Title": "BioSFQ Circuit Family for Neuromorphic Computing: Bridging Digital and Analog Domains of Superconductor Technologies", "Authors": ["v. k. semenov", "e. b. golden", "s. k. tolpygo"], "Pub Date": "2023-05-04", "Abstract": "superconductor single flux quantum  sfq  technology is attractive for neuromorphic computing due to low energy dissipation and high potentially up to 100 ghz clock rates. we have recently suggested a new family of biosfq circuits  v.k. semenov et al. ieee tas vol. 32 no. 4 1400105 2022  where information is stored as a value of current in a superconducting loop and transferred as a rate of sfq pulses propagating between the loops. this approach in the simplest case dealing with positive numbers requires single line transfer channels. in the more general case of bipolar numbers it requires dual rail transfer channels. to address this need we have developed a new comparator with a dual rail output. this comparator is an essential part of a bipolar multiplier performing an ${\\bm{x}} \\cdot {\\bm{y}}$operation on two analog currents ${\\bm{x}}$ and ${\\bm{y}}$. the multiplier has been designed fabricated and tested. we also present biosfq circuits for implementing an analog bipolar divide operation ${\\bm{y}}/{\\bm{x}}$ and a square root operation $\\surd {\\bm{x}}$. we discuss strategic advantages of the suggested biosfq approach e.g. an inherently asynchronous character of biosfq cells which do not require explicit clock signals. as a result biosfq circuits are free of racing errors and tolerant to occasional collision of propagating sfq pulses. this tolerance is due to stochastic nature of data signals generated by comparators operating within their gray zone. the circuits were fabricated in the eight niobium layer fabrication process sfq5ee developed for superconductor electronics at mit lincoln laboratory.", "Doi": "10.1109/TASC.2023.3252495", "Key Words": ["artificial neural networks", "bipolar multiplier", "electronic circuits", "neuromorphic computing", "superconductor electronics", "superconducting integrated circuits", "sfq", "rsfq"]}