{"Title": "Blockchain-Based Secure Key Management for Mobile Edge Computing", "Doi": "10.1109/TMC.2021.3068717", "Authors": ["j. li", "j. wu", "l. chen", "j. li", "s. -k. lam"], "Key Words": ["blockchain", "security", "key management", "group communication", "mobile edge computing"], "Abstract": "mobile edge computing  mec  is a promising edge technology to provide high bandwidth and low latency shared services and resources to mobile users. however the mec infrastructure raises major security concerns when the shared resources involve sensitive and private data of users. this paper proposes a novel blockchain based key management scheme for mec that is essential for ensuring secure group communication among the mobile devices as they dynamically move from one subnetwork to another. in the proposed scheme when a mobile device joins a subnetwork it first generates lightweight key pairs for digital signature and communication and broadcasts its public key to neighbouring peer users in the subnetwork blockchain. the blockchain miner in the subnetwork packs all the public key of mobile devices into a block that will be sent to other users in the subnetwork. this enables the mobile device to communicate with its peers in the subnetwork by encrypting the data with the public key stored in the blockchain. when the mobile device moves to another subnetwork in the tree network all the mobile devices of the new subnetwork can quickly verify its identity by checking its record in the local or higher hierarchy subnetwork blockchain. furthermore when the mobile device leaves the subnetwork it does not need to do anything and its records will remain in the blockchain which is an append only database. theoretical security analysis shows that the proposed scheme can defend against the 51 percent attack and malicious entities in the blockchain network utilizing proof of work consensus mechanism. moreover the backward and forward secrecy is also preserved. experimental results demonstrate that the proposed scheme outperforms two baselines in terms of computation communication and storage.", "Pub Date": "2022-12-05"}