{"Title": "Blockchain-Based Computing Resource Trading in Autonomous Multi-Access Edge Network Slicing: A Dueling Double Deep Q-Learning Approach", "Doi": "10.1109/TNSM.2023.3240301", "Authors": ["t. kwantwi", "g. sun", "n. a. e. kuadey", "g. t. maale", "g. liu"], "Key Words": ["blockchain", "resource trading", "deep reinforcement learning", "stackelberg game", "mec", "network slicing", "5g"], "Abstract": "we investigate the computing resource allocation in multi access edge network slicing  ns  in the context of revenue and multi access edge computing  mec  resource management. the significant variety of slice resource utilization levels across slice tenants  i.e. mobile virtual network operators  mvnos   challenges mec resource management in ns with mec leading to virtual machine resource  vmr   i.e. computing resource  wastage or scarcity. as a result for efficient mec resource management the infrastructure provider  inp  encourages dynamic resource sharing and trading  drst  of unutilized slice vmr quotas. nevertheless cellular network security and privacy issues deter mvnos from collaborating on effective drst. the security characteristics inherent in blockchain have recently gained much interest for secure resource trading. thus this paper proposes a unique hierarchical blockchain based inter slice computing resource trading  iscrt  scheme for peer to peer  p2p  mvnos in an autonomous multi sliced mec based 5g network. for secure iscrt transactions a consortium blockchain network with hyperledger smart contracts  sc  is designed. we model the demand and pricing problems of buyer and seller mvnos for the unutilized vmrs using a two stage stackelberg game. then to obtain the stackelberg equilibrium  se  an enhanced dueling double deep q network  d3qn  algorithm is proposed which intelligently determines the optimal demand and pricing policies of mvnos for the unutilized vmrs during iscrt transactions at negotiation intervals. simulation analysis shows that the proposed enhanced d3qn algorithm outperforms benchmark schemes in terms of the mvno slice level satisfaction and vmr utilization while reducing double spending attacks in iscrt settings by 16% and increasing both players‚äô utility.", "Pub Date": "2023-10-09"}