{"Title": "Blockchain-Aided Edge Computing Market: Smart Contract and Consensus Mechanisms", "Doi": "10.1109/TMC.2021.3140080", "Authors": ["y. du", "z. wang", "j. li", "l. shi", "d. n. k. jayakody", "q. chen", "w. chen", "z. han"], "Key Words": ["edge computing", "blockchain", "smart contract", "matching", "double auction", "proof-of-stake", "shapley value"], "Abstract": "building upon the prevailing concept of edge computing  ec  a distributed ec market requires decentralized and verified transaction management to trade computing resources. towards this goal we study a blockchain aided ec market wherein each data service operator  dso  rents a group of edge computing nodes  ecns  and leases the ecns to the user terminals  uts  to provide computation offloading services. a trustworthiness model is introduced to evaluate the quality of each network entity throughout the transactions. we develop a two level trading mechanism over smart contract to enable the automatic and efficient transactions among the network entities and provide high quality services. first we propose a smart contract based matching mechanism to establish the renting association between the dsos and ecns with the aim of maximizing the social welfare. second we propose a social welfare improved double auction  swida  mechanism to build up the leasing association between the dsos and uts and determine the pricing of the winners. we show that the proposed double auction mechanism can achieve individual rationality balanced budget truthfulness in expectation and an improved social welfare than the benchmark mechanisms. moreover we put forth a trustworthiness driven proof of stake  pos  consensus mechanism to enable verified transaction and fair allocation of block generation reward. following the principle of pos we formulate the block generation as a coalitional game wherein each stakeholder votes according to its trustworthiness and coinage and shares the reward among the coalition according to the shapley values. the simulation results show that the proposed pos consensus mechanism can reduce the wealth inequality among the network entities compared with the conventional consensus mechanisms.", "Pub Date": "2023-05-05"}