{"Title": "Blockchain-Based Secure Content Caching and Computation for Edge Computing", "Doi": "10.1109/ACCESS.2024.3383474", "Authors": ["e. bozkaya-aras"], "Key Words": ["blockchain", "content caching", "pos", "edge computing", "internet of things"], "Abstract": "the current explosion in user traffic necessitates the placement of edge servers in proximity to the internet of things  iot  devices allowing computation tasks to be offloaded to edge servers. this strategy aims to minimize the average delay of traffic requests by enabling user iot devices to locally execute time sensitive tasks or offload them to edge servers within the edge computing paradigm. this new paradigm will also allow to cache contents at edge servers but considering such an increasing number of user requests and limited storage capability of edge servers selection in edge caching decisions is challenging. in addition while there is general consensus that this technology may provide a variety of benefits there are serious questions about its security implications. this is because malicious users can manipulate the caching decisions of the edge servers by sending fake traffic requests which reduces the caching efficiency of the resource constrained edge servers. driven by these issues in this paper we propose a blockchain based content caching and computation strategy to validate the authenticity of cached content and thus prevent unauthorized requests from malicious users. specifically the proof of stake  pos  consensus mechanism is presented to handle low computational work validate the process of blocks and manage the transactions between edge servers and legitimate users. then a deep q network  dqn  based solution is proposed to intelligently develop an effective content caching and computation strategy. according to performance evaluation the proposed model significantly outperforms the conventional caching strategies. it improves the cache hit rate by up to 8.2% on average and reduces the response delay by up to 7.45% on average.", "Pub Date": "2024-04-05"}