{"Title": "Blockchain-Based Cooperative Computation Offloading and Secure Handover in Vehicular Edge Computing Networks", "Doi": "10.1109/TIV.2023.3271367", "Authors": ["p. lang", "d. tian", "x. duan", "j. zhou", "z. sheng", "v. c. m. leung"], "Key Words": ["vehicular edge computing", "blockchain", "cooperative computation offloading", "deep reinforcement learning"], "Abstract": "facing the requirements of intelligent vehicles for massive data processing vehicular edge computing  vec  utilizes computing resources deployed on the roadside infrastructure to provide proximity computing services for vehicles and forms a novel computing paradigm. thus vehicles can reduce the burden of local computing and improve computing efficiency by offloading tasks to roadside computing servers or neighboring resource idle vehicles for execution via cooperative computation offloading  co . however dynamic communication channel states and data handover among multiple vec servers caused by vehicle mobility pose challenges for co decision making and data security. this article applies blockchain to the cooperative co of vec and thus proposes a cooperative co and secure handover framework with a consensus mechanism to guarantee the efficiency of cooperative co and secure handover. in this framework models for vehicle mobility and cooperative co handover are constructed and a consensus mechanism is proposed. this mechanism ensures the synchronization and immutability of offloaded data in the co handover. a cooperative co decision optimization is also formulated considering secure handover with blockchain technology to optimize the latency of vehicular computing tasks. to solve this complex problem this optimization is transformed into a markov decision process and a cooperative co decision algorithm with multiagent deep reinforcement learning is designed thus achieving the optimal solution. extensive simulations verified the performance and effectiveness of the proposed method.", "Pub Date": "2023-08-18"}