{"Title": "Blockchain-Based Multidimensional Trust Management in Edge Computing", "Doi": "10.1109/ACCESS.2023.3329126", "Authors": ["y. wang", "z. wu"], "Key Words": ["blockchain", "edge computing", "trust evaluation", "smart contract", "probabilistic linguistic terms set"], "Abstract": "due to the resource limitations of internet of things  iot  terminals and the distributed characteristics of edge computing architecture trustworthy services management in dynamic edge computing is a very large challenge. a general and extensible blockchain based multidimensional trust management  bmdtm  model suitable for edge computing is proposed in this paper. first probabilistic linguistic terms sets  pltss  are adopted as a trust scaling method to integrate the multicriteria evaluation data of the whole domain to measure the performance of the service provider and the stability degree of each attribute performance is calculated based on information entropy theory which enables us to measure the dynamic performance accurately and precisely. second the dual characteristic of the associated criteria is utilized to filter out malicious or unprofessional evaluation information of requesting nodes and avoid malicious user collusion ensuring the credibility of trust management. third blockchain technology and smart contracts  scs  are adopted to store trust evidence share trust information across domains and execute multisource trust fusion automatically avoiding the problems of information opacity and the single point of failure of the traditional centralized trust model. the experimental results demonstrate that our model can well manage trust problems in a dynamically hostile edge computing environment. the first finding is that the introduction of the domain trust value significantly improves the quality of service  qos  compliance ratio due to an accurate description of the dynamic performance of services. the second finding is that our model performs better in attack resistance by leveraging blockchain technology and the dual characteristic of the associated criteria.", "Pub Date": "2023-11-07"}