{"Title": "Blockchain-based Collaborative Edge Intelligence for Trustworthy and Real-Time Video Surveillance", "Doi": "10.1109/TII.2022.3203397", "Authors": ["m. zhang", "j. cao", "y. sahni", "q. chen", "s. jiang", "l. yang"], "Key Words": ["collaborative edge computing", "edge blockchain", "edge intelligence", "trustworthiness", "video surveillance"], "Abstract": "trustworthy and real time video surveillance aims to analyze the live camera streams in a privacy preserving manner for the decision making of various advanced services such as pedestrian reidentification and traffic monitoring. in recent years edge computing has been identified as a promising technology for trustworthy and real time video surveillance because it keeps confidential video data locally and reduces the latency caused by massive data transmission. generally a single edge device can hardly afford the computation intensive video analytics tasks. most existing solutions incorporate cloud servers to handle the overloaded tasks. however such an edge cloud collaboration approach still suffers from unpredictable latency and privacy concerns because the remote cloud is centralized and distant from the cameras. in this work we designed a blockchain based collaborative edge intelligence  bcei  approach for trustworthy and real time video surveillance. in bcei geo distributed edge devices form a peer to peer network to maintain a permissioned blockchain and share data and computation resources to perform computation intensive video analytics tasks. the video analytics results are written on the blockchain in an immutable manner to guarantee trustworthiness. to reduce task execution time we formulate and solve a joint stream mapping and task scheduling problem to schedule video streams and machine learning models among edge devices. a pedestrian reidentification prototype is implemented and deployed based on bcei with the extensive performance evaluation indicating the superiority of bcei in latency reduction and system throughput improvement by leveraging collaboration among edge devices.", "Pub Date": "2022-12-15"}