{"Title": "Blockchain-Assisted Hierarchical Attribute-Based Encryption Scheme for Secure Information Sharing in Industrial Internet of Things", "Doi": "10.1109/ACCESS.2024.3354846", "Authors": ["a. sasikumar", "l. ravi", "m. devarajan", "a. selvalakshmi", "a. t. almaktoom", "a. s. almazyad", "g. xiong", "a. w. mohamed"], "Key Words": ["blockchain", "data encryption", "edge devices", "habe", "iiot", "user privacy"], "Abstract": "the edge devices will produce enormous quantities of data daily as the industrial internet of things  iiot  expands in scope. still most iiot data is stored in data centers making it challenging to transfer data between domains safely. smart logistic products have dramatically changed due to the prevalence of decentralized edge computing and blockchain in the industry sector. to address the need to exchange data between logistics networks we proposed a novel decentralized hierarchical attribute based encryption  habe  scheme combining edge computing and blockchain. to begin we offer an iot data encryption strategy in which edge devices can send data to a nearby cloud network for data processing while maintaining privacy. in addition we developed a blockchain integrated data sharing scheme that makes it possible for users to share data via the use of edge and cloud storage. in particular an iot device incorporates an encryption based authentication system to verify users‚äô access rights at the network‚äôs periphery in a decentralized manner. using habe we provide a blockchain integrated architecture for the iot that protects user privacy. the suggested design utilizes the edge and cloud network paradigms and habe to maintain privacy and works well with smart logistics applications. the authentication time of the proposed model is reduced by 1.5 times compared with the centralized model. the analyses and experimental findings show that the proposed blockchain integrated edge computing architecture is better than the existing schemes in terms of data sharing data privacy and security.", "Pub Date": "2024-01-26"}