{"Title": "Blockchain Based Optimized Energy Trading for E-Mobility Using Quantum Reinforcement Learning", "Authors": ["m. kumar", "u. dohare", "s. kumar", "n. kumar"], "Pub Date": "2023-04-18", "Abstract": "using microgrids to charge electric vehicles  evs  is a significant step toward achieving electric mobility. the microgrids generate electricity for self use and sell surplus energy locally in peer to peer  p2p  manner where seller and buyer meet to trade electricity directly on agreed terms without any intermediary. the energy trading decision for the microgrid is a challenging issue due to uncertainty of renewable energy yield the electric demands of evs and without knowing the offers of other competitive microgrids together makes it hard to decide the selling price of energy per unit. further there is a need to audit and verify the energy trading and store energy transactions securely in distributed manner to avoid collapse of the system in case of single point of failure. in this context this paper presents a blockchain and quantum reinforcement learning based optimized energy trading  bql et  model for e mobility. firstly a double auction mechanism is proposed to set optimal market trading price by observing the selling price of each microgrid and the demand of ev. secondly using smart contracts consortium blockchain is deployed for the evaluation of overall utility which includes energy supply demand and cost for both microgrids and evs. finally utility maximization problem is transformed into a markov decision process  mdp  and in order to develop the learning policy and maximize overall utility a qrl optimization for solving the mdp problem is proposed. convergence analysis and performance results attest that bql et convergences faster maximizes the utility of both microgrids an evs with lower transaction confirmation time and setting of the optimal market trading price compared to state of the art models.", "Doi": "10.1109/TVT.2022.3225524", "Key Words": ["blockchain", "electric vehicles", "energy trading", "microgrids", "quantum reinforcement learning"]}