{"Title": "Boosting Personalized Musculoskeletal Modeling With Physics-Informed Knowledge Transfer", "Authors": ["j. zhang", "y. zhao", "t. bao", "z. li", "k. qian", "a. f. frangi", "s. q. xie", "z. -q. zhang"], "Pub Date": "2023-01-10", "Abstract": "data driven methods have become increasingly more prominent for musculoskeletal modeling due to their conceptually intuitive simple and fast implementation. however the performance of a pretrained data driven model using the data from specific subject s  may be seriously degraded when validated using the data from a new subject hindering the utility of the personalized musculoskeletal model in clinical applications. this article develops an active physics informed deep transfer learning framework to enhance the dynamic tracking capability of the musculoskeletal model on the unseen data. the salient advantages of the proposed framework are twofold. first for the generic model physics based domain knowledge is embedded into the loss function of the data driven model as soft constraints to penalize regularize the data driven model. second for the personalized model the parameters relating to the feature extraction will be directly inherited from the generic model and only the parameters relating to the subject specific inference will be fine tuned by jointly minimizing the conventional data prediction loss and the modified physics based loss. in this article we use the synchronous muscle forces and joint kinematics prediction from surface electromyogram  semg  as the exemplar to illustrate the proposed framework. moreover convolutional neural network  cnn  is employed as the deep neural network to implement the proposed framework and the physics law between muscle forces and joint kinematics is utilized as the soft constraints. results of comprehensive experiments on a self collected dataset from eight healthy subjects indicate the effectiveness and great generalization of the proposed framework.", "Doi": "10.1109/TIM.2022.3227604", "Key Words": ["personalized musculoskeletal model", "physics-informed deep transfer learning", "surface electromyogram (semg)", "wrist muscle forces and joint kinematics estimation"]}