{"Title": "Brain-Inspired Remote Sensing Foundation Models and Open Problems: A Comprehensive Survey", "Doi": "10.1109/JSTARS.2023.3316302", "Authors": ["l. jiao", "z. huang", "x. lu", "x. liu", "y. yang", "j. zhao", "j. zhang", "b. hou", "s. yang", "f. liu", "w. ma", "l. li", "x. zhang", "p. chen", "z. feng", "x. tang", "y. guo", "d. quan", "s. wang", "w. li", "j. bai", "y. li", "r. shang", "j. feng"], "Key Words": ["brain modeling", "deep learning", "foundation model", "image analysis", "remote sensing"], "Abstract": "the foundation model  fm  has garnered significant attention for its remarkable transfer performance in downstream tasks. typically it undergoes task agnostic pretraining on a large dataset and can be efficiently adapted to various downstream applications through fine tuning. while fms have been extensively explored in language and other domains their potential in remote sensing has also begun to attract scholarly interest. however comprehensive investigations and performance comparisons of these models on remote sensing tasks are currently lacking. in this survey we provide essential background knowledge by introducing key technologies and recent developments in fms. subsequently we explore essential downstream applications in remote sensing covering classification localization and understanding. our analysis encompasses over 30 fms in both natural and remote sensing fields and we conduct extensive experiments on more than 10 datasets evaluating global feature representation local feature representation and target localization. through quantitative assessments we highlight the distinctions among various fms and confirm that pretrained large scale natural fms can also deliver outstanding performance in remote sensing tasks. after that we systematically presented a brain inspired framework for remote sensing foundation models  rsfms . we delve into the brain inspired characteristics in this framework including structure perception learning and cognition. to conclude we summarize 12 open problems in rsfms providing potential research directions. our survey offers valuable insights into the burgeoning field of rsfms and aims to foster further advancements in this exciting area.", "Pub Date": "2023-11-16"}