{"Title": "Broadband Digital Over-the-Air Computation for Wireless Federated Edge Learning", "Doi": "10.1109/TMC.2023.3304652", "Authors": ["l. you", "x. zhao", "r. cao", "y. shao", "l. fu"], "Key Words": ["federated edge learning", "over-the-air computation", "multiple access", "channel codes", "real-time implementation"], "Abstract": "this article presents the first orthogonal frequency division multiplexing ofdm  based digital over the air computation  aircomp  system for wireless federated edge learning where multiple edge devices transmit model data simultaneously using non orthogonal ofdm subcarriers and the edge server aggregates data directly from the superimposed signal. existing analog aircomp systems often assume perfect phase alignment via channel precoding and utilize uncoded analog transmission for model aggregation. in contrast our digital aircomp system leverages digital modulation and channel codes to overcome phase asynchrony thereby achieving accurate model aggregation for phase asynchronous multi user ofdm systems. to realize a digital aircomp system we develop a medium access control  mac  protocol that allows simultaneous transmissions from different users using non orthogonal ofdm subcarriers and put forth joint channel decoding and aggregation decoders tailored for convolutional and ldpc codes. to verify the proposed system design we build a digital aircomp prototype on the usrp software defined radio platform and demonstrate a real time ldpc coded aircomp system with up to four users. trace driven simulation results on test accuracy versus snr show that  1  analog aircomp is sensitive to phase asynchrony in practical multi user ofdm systems and the test accuracy performance fails to improve even at high snrs  2  our digital aircomp system outperforms two analog aircomp systems at all snrs and approaches the optimal performance when snr $\\geq$‚â• 6 db for two user ldpc coded aircomp demonstrating the advantage of digital aircomp in phase asynchronous multi user ofdm systems.", "Pub Date": "2024-04-04"}