{"Title": "BSBL-Based Auxiliary Vehicle Position Analysis in Smart City Using Distributed MEC and UAV-Deployed IoT", "Doi": "10.1109/JIOT.2022.3204986", "Authors": ["h. wang", "x. wang", "x. lan", "t. su", "l. wan"], "Key Words": ["block sparse bayesian learning (bsbl)", "distributed mobile-edge computing (mec)", "internet of things (iot)", "mutual coupling (mc)", "smart city", "vehicle positions analysis"], "Abstract": "smart city enters the new 3.0 era and internet of things  iot  perform as the urban neural network in smart city. in the industrial areas of smart city the iot focuses on industrial applications such as logistics and environmental monitoring. in this work an auxiliary position analysis framework composed of iot and distributed mobile edge computing  mec  is proposed to analyze the position of vehicles in the industrial areas of smart city. in the proposed framework iot are deployed by multiple unmanned aerial vehicles  uavs  equipped with uniform linear array  ula  which receives the signal emitted by vehicles for obtaining the direction of arrival  doa  and the distributed mec provides computing and synchronization services to auxiliary positioning. the doa estimation is a key issue for auxiliary positioning in the proposed framework. to realize doa estimation with unknown mutual coupling  mc  existing in iot nodes a novel block sparse bayesian learning  sbl  algorithm is developed. in the developed algorithm the unknown mc existing between sensors in each iot nodes is first fused with the signal by parameterizing steering vector. then a block sbl  bsbl  procedure is presented to perform doa estimation by using the inherent block sparse structure in the equivalent signal obtained after fusion. benefiting from the fusion of mc and signal the developed doa estimation algorithm does not require a separate estimation of the unknown mc and also does not cause the loss of the array aperture. based on the doa estimation information the position of vehicles in the industrial environment is effectively analyzed through weighted multiple cross locations. synthetic data set simulation is carried out to verify that the vehicle positions in smart city can be efficiently analyzed and estimated based on the presented framework and algorithm.", "Pub Date": "2023-01-05"}