{"Title": "Cache Control of Edge Computing System for Tradeoff Between Delays and Cache Storage Costs", "Doi": "10.1109/TASE.2022.3228250", "Authors": ["c. hou", "c. zhou", "q. huang", "c. -b. yan"], "Key Words": ["edge computing system", "constrained markov decision process", "cache space supply", "delay", "cache storage costs"], "Abstract": "this paper studies the edge computing system  ecs  in which caching the frequently reusable service  frs  at the edge server  es  is an effective way to reduce delays. the larger cache space available in the es  we call it es cache space  might buffer the larger scale of frs and subsequently decrease the delays while bringing higher cache storage costs. meanwhile the distribution of frs is not always known in advance. therefore how much es cache space should be supplied to make the optimal tradeoff between the delays and cache storage costs arises as an interesting issue in practice. to address this issue this paper first formulates the problem of determining the amount of es cache space supply as a constrained markov decision process  cmdp  then adopts the zipf‚äôs distribution to estimate the probability distribution of frs and finally proposes an effective cache space control algorithm  csca  guiding the es to determine the amount of es cache space supply to minimize the cache storage costs while maintaining the delays at the acceptable level. theoretical analysis simulations and field experiments document and illustrate its performance. note to practitioners‚äîthis paper addresses the interesting trade off between the delays and cache storage costs for the edge computing system that operates with limited cache storage budgets while must satisfy the required real time performances. it helps to improve the operation efficiency of the systems with edge computing setting in the area of internet of things  iot  or cyber physical systems  cps  that employ the edge server to cache the frequently reusable services arriving at the minimization of the accumulative cache storage costs while maintaining the accumulative delays at the acceptable level. theoretical analysis simulation and field experimental investigations jointly show that the solution proposed here outperforms existing solutions.", "Pub Date": "2024-01-04"}