{"Title": "Calibration Method for Wide-Field Machine Vision System Based on Laser Projection Turntable", "Authors": ["y. liu", "m. liu", "y. yan", "s. sun", "l. dong", "l. kong"], "Pub Date": "2024-04-08", "Abstract": "this article investigates the camera calibration problem in the field of computer vision which is a key technology connecting 2 d vision with 3 d world and directly affecting the accuracy of computer vision systems. in this article a camera calibration method is proposed by combining a laser projection turntable. the proposed method includes the following main contributions. first a homemade laser projection turntable is utilized and the initial poses of the turntable are calibrated using the least squares method. a coordinate transformation technique is employed to convert the encoded light spots emitted by the laser into 3 d world coordinates and the mechanical errors of the laser projection turntable are analyzed. to address the issue of light spot deformation an elliptical light spot centroid detection algorithm is proposed to obtain accurate pixel coordinates of the light spot centroids. next the projection matrix is computed using the direct linear transform  dlt  method and the camera is calibrated for distortion correction using a radial distortion model. furthermore a nonlinear optimization algorithm is employed to further optimize the projection matrix and distortion parameters. finally this method was applied to camera calibration with both slight and severe distortions and compared to three traditional calibration methods and two novel approaches. the experimental results demonstrate that the proposed method achieves higher calibration accuracy and efficiency. in conclusion the proposed camera calibration method which combines a laser projection turntable effectively overcomes issues such as distortion and deformation enabling accurate camera calibration and yielding satisfactory results in the experiments.", "Doi": "10.1109/TIM.2024.3381283", "Key Words": ["camera calibration", "laser projection turntable", "nonlinear optimization"]}