{"Title": "Can Pretrained English Language Models Benefit Non-English NLP Systems in Low-Resource Scenarios?", "Doi": "10.1109/TASLP.2023.3267618", "Authors": ["z. chi", "h. huang", "l. liu", "y. bai", "x. gao", "x. -l. mao"], "Key Words": ["language modeling", "multilinguality", "knowledge transfer"], "Abstract": "pretrained language models have achieved great success in a wide range of natural language processing  nlp  problems because they learn language representations from large scale text corpora and can adapt to downstream tasks by finetuning them on annotated task data. however such success relies on both large scale text and annotated data so the lack of training data is a major practical problem for many languages especially low resource languages. in this paper we explore whether a pretrained english language model can benefit non english nlp systems in low resource scenarios i.e. with limited text corpora or annotated data. to achieve this we first propose cross lingual knowledge transfer methods and then validate our methods in low resource scenarios. specifically our cross lingual knowledge transfer methods are applied in the training stages of language model pretraining or downstream finetuning. at the two stages the methods are designed for the transfer of upstream general knowledge or downstream task specific knowledge respectively. in the experiments we perform pretraining and finetuning with limited non english data to simulate the low resource scenarios. we evaluate our methods on ten downstream tasks over a wide range of languages and present systematic comparisons among various knowledge transfer methods. experimental results show that our methods successfully leverage a pretrained english language model to improve task performance in other languages. besides we demonstrate the multilinguality of the english language model in various application scenarios. our findings imply the possibility to improve low resource language nlp systems with large scale english language models.", "Pub Date": "2024-01-17"}