{"Title": "Capuchin Search Algorithm With Deep Learning-Based Data Edge Verification for Blockchain-Assisted IoT Environment", "Doi": "10.1109/ACCESS.2023.3346437", "Authors": ["k. h. alyoubi", "a. o. khadidos", "a. m. alshareef", "d. hamed", "a. o. khadidos", "m. ragab"], "Key Words": ["blockchain", "internet of things", "edge verification", "deep learning", "parameter selection"], "Abstract": "internet of things  iot  devices generate enormous quantities of data and ensuring the authenticity and integrity of this data is essential. blockchain  bc  serves as a transparent and secure ledger for recording each data transaction which prevents unauthorized modification and provides a trust layer for the iot ecosystem. data edge verification for bc enabled iot platforms is a fundamental aspect of ensuring data trustworthiness integrity and security in the system. in such an environment iot devices generate vast amounts of data and bc technology can be used to create a decentralized and immutable ledger that records all the transactions and data exchanges machine learning  ml  in the context of bc and the iot offers a powerful toolkit for optimizing and securing these technologies. it enables the analysis of vast and complex data generated by iot devices allowing for predictive maintenance anomaly detection and pattern recognition. ml also enhances security by developing intrusion detection systems and supporting smart contracts in bc networks. this article introduces a new capuchin search algorithm with a deep learning based data edge verification model  csadl devm  for the blockchain assisted iot platform. the purpose of the csadl devm technique is to integrate the bc with dl and hyperparameter tuning concepts for data edge verification in the iot environment. in addition iot devices comprise a considerable level of decentralized decision making ability which accomplishes a consensus on the performance of intra block transactions. in addition the csadl devm technique applies the elman recurrent neural network  ernn  model for the identification and classification of faults. moreover the hyperparameters related to the ernn model can be adjusted by the use of csa which in turn better the detection results. a comprehensive set of simulations has been conducted to exhibit the enhanced results of the csadl devm method. the obtained outcomes exhibit the superior outcome of the csadl devm algorithm.", "Pub Date": "2024-01-03"}