{"Title": "CCD Sensor Based Cameras for Sustainable Streaming IoT Applications With Compressed Sensing", "Authors": ["r. gambheer", "m. s. bhat"], "Pub Date": "2023-07-11", "Abstract": "this paper presents a comprehensive study of compressed sensing  cs  techniques applied to charge coupled device  ccd  and complementary metal oxide semiconductor  cmos  sensor based cameras. cs is a powerful technique for reducing the number of measurements required to capture high quality images while maintaining a high signal to noise ratio  snr . in this study we propose a novel cs method for ccd and cmos sensor based cameras that combines a new sampling scheme with a sparsity inducing transform and a reconstruction algorithm to achieve high quality images with fewer measurements. this paper focuses on an efficient ccd image capturing system suitable for embedded iot applications. hardware implementation has been done for proof of concept with an onboard field programmable gate array  fpga  performing the compression. this hardware module is used over a wireless network to transmit and receive images under different test conditions with both cmos and ccd sensors. for each use case peak signal to noise ratio  psnr  average power and memory usage are computed under different ambient lighting conditions from dark to very bright. the results show that a  $640\\times 480$  ccd sensor with compressed sensing with a sparsity of 0.5 provides 13% power saving and 15% memory saving compared to uncompressed sensing in no light condition resulting in 25.76 db psnr. whereas in no light condition cmos sensor does not capture any image at all. these results shows that the ccd image capturing system with compressed sensing can be conveniently used for embedded iot applications. the data recovery from wireless sensor network is done at a central office where computing time and processing power resources are not constrained. the weight of the ccd camera is approximately 100 grams with modular build approach.", "Doi": "10.1109/ACCESS.2023.3291396", "Key Words": ["ccd imager", "cmos imager", "compressive sensing", "dynamic range", "fill-factor", "global shutter", "iot", "lvds", "psnr", "quantum efficiency", "rolling shutter", "wearable camera"]}