{"Title": "CD-LwTE: Cost- and Delay-Aware Light-Weight Transcoding at the Edge", "Doi": "10.1109/TNSM.2022.3229744", "Authors": ["a. erfanian", "h. amirpour", "f. tashtarian", "c. timmerer", "h. hellwagner"], "Key Words": ["video streaming", "transcoding", "video on demand", "edge computing", "network function virtualization (nfv)"], "Abstract": "the edge computing paradigm brings cloud capabilities close to the clients. leveraging the edge‚äôs capabilities can improve video streaming services by employing the storage capacity and processing power at the edge for caching and transcoding tasks respectively resulting in video streaming services with higher quality and lower latency. in this paper we propose cd lwte a  ${c}$ ost  and  ${d}$ elay aware  ${l}$ ight  ${w}$ eight  ${t}$ ranscoding approach at the  ${e}$ dge in the context of http adaptive streaming  has . the encoding of a video segment requires computationally intensive search processes. the main idea of cd lwte is to store the optimal search results as metadata for each bitrate of video segments and reuse it at the edge servers to reduce the required time and computational resources for transcoding. aiming at minimizing the cost and delay of video on demand  vod  services we formulate the problem of selecting an optimal policy for serving segment requests at the edge server including   ${i}$   storing at the edge server  ii  transcoding from a higher bitrate at the edge server and  iii  fetching from the origin or a cdn server as a binary linear programming  blp  model. as a result cd lwte stores the popular video segments at the edge and serves the unpopular ones by transcoding using metadata or fetching from the origin cdn server. in this way in addition to the significant reduction in bandwidth and storage costs the transcoding time of a requested segment is remarkably decreased by utilizing its corresponding metadata. moreover we prove the proposed blp model is an np hard problem and propose two heuristic algorithms to mitigate the time complexity of cd lwte. we investigate the performance of cd lwte in comprehensive scenarios with various video contents encoding software encoding settings and available resources at the edge. the experimental results show that our approach   ${i}$   reduces the transcoding time by up to 97%  ii  decreases the streaming cost including storage computation and bandwidth costs by up to 75% and  iii  reduces delay by up to 48% compared to state of the art approaches.", "Pub Date": "2023-10-09"}