{"Title": "Challenges and Opportunities in Neuro-Symbolic Composition of Foundation Models", "Doi": "10.1109/MILCOM58377.2023.10356344", "Authors": ["s. jha", "a. roy", "a. cobb", "a. berenbeim", "n. d. bastian"], "Key Words": ["llms", "foundation models", "neuro-symbolic learning"], "Abstract": "trustworthy resilient and interpretable artificial intelligence  artificial intelliegence  is essential for effective operation of the internet of things  iot  in adversarial environments. such a robust and interpretable artificial intelliegence is needed to improve tactical coordination through scalability corroboration and context aware intelligence. it is crucial to have robust machine learning  ml  models with characteristics such as low supervision adaptability decision explanations and adaptive inference. pre trained large language models  large language model  and foundation models  fms  address some of these challenges but are unpredictable and cannot directly solve complex tasks in mission critical scenarios. however their generalization capabilities make them potential building blocks for high assurance artificial intelliegence ml systems that compose multiple fms and large language model. in this paper we propose combining neural foundation models  fms  using symbolic programs that results in a more effective artificial intelliegence for adversarial conditions. neuro symbolic composition of fms to solve complex tasks requires interactive and unambiguous specification of the intent task decomposition into subtasks that can be solved by individual fms program synthesis for composing fms and neuro symbolic inference that schedules inference of different fms and combines their results. we give examples of such neuro symbolic programs using foundation models to solve visual question answering tasks such as out of context detection. this position paper identifies the challenges and opportunities in the neuro symbolic composition of the large language models and foundation models.", "Pub Date": "2023-12-25"}