{"Title": "Characterizing and Utilizing the Interplay Between Quantum Technologies and Non-Terrestrial Networks", "Authors": ["h. al-hraishawi", "j. u. rehman", "m. razavi", "s. chatzinotas"], "Pub Date": "2024-04-05", "Abstract": "quantum technologies are increasingly recognized as groundbreaking advancements set to redefine the landscape of computing communications and sensing by leveraging quantum phenomena like entanglement and teleportation. quantum technologies offer an interesting set of advantages such as unconditional security large communications capacity unparalleled computational speed and ultra precise sensing capabilities. however their global deployment faces challenges related to communication ranges and geographical boundaries. non terrestrial networks  ntns  have emerged as a potential remedy for these challenges through providing free space quantum links to circumvent the exponential losses inherent in fiber optics. through the utilization of free space optical  fso  and li fi links ntns provide an effective method for transmitting quantum states over extensive distances. this paper delves into the dynamic interplay between quantum technologies and ntns to unveil their synergistic potential. we also investigate their integration challenges and the potential solutions to foster a symbiotic convergence of quantum and ntn functionalities while identifying avenues for enhanced interoperability. specifically quantum communication over ntns imposes challenges in communication channel reliability network flexibility and scalability. to enhance channel reliability multicarrier transmission techniques and spatial diversity strategies including quantum mimo  q mimo  transmission schemes can be employed. introducing the software defined networking  sdn  model facilitates flexible network configurations. in ntn based quantum infrastructure technologies like trusted relays measurement device independent  mdi  and quantum repeaters can address scalability concerns efficiently. this paper not only offers useful insights into the mutual advantages but also presents future research directions aiming to inspire additional studies and advance this interdisciplinary collaboration.", "Doi": "10.1109/OJCOMS.2024.3380508", "Key Words": ["aerial platforms", "non-terrestrial networks", "quantum communication", "quantum computing", "satellite communications", "space-based networks"]}