{"Title": "Characterizing Quantum Classifier Utility in Natural Language Processing Workflows", "Doi": "10.1109/QCE57702.2023.10286", "Authors": ["k. hamilton", "m. c. shekar", "j. gounley", "d. bharadwaj", "p. date", "e. a. c. p√©rez", "i. -s. suh", "g. tourassi"], "Key Words": ["quantum natural language processing", "quantum neural networks", "quantum machine learning"], "Abstract": "quantum natural language processing  qnlp  develops natural language processing  nlp  models for deployment on quantum computers. we explore feature and data prototype selection techniques to address challenges posed by encoding high dimensional features. our study builds quantum circuit classifiers that includes classical feature pre processing quantum embedding and quantum model training. the quantum models are built on 4 or 6 qubits and the quantum neural network  qnn  uses the established bricklayer design. we compare the dependence of model performance  in terms of accuracy and f1 scores  on feature length embedding gates and parameterized unitary design. we compare the performance of quantum machine learning models to classical convolution neural network model  cnn  on binary and multi class classification tasks using two datasets of synthetic features and labels. the first is the ecp candle p3b3 dataset a corpus of synthetically generated cancer pathology reports. the second dataset is extracted from well known benchmark dataset  madelon    features are generated with a combination of informative repeated and uninformative features. both datasets are used for binary classification and multi class classification with 3 classes. we observe robust accurate performance from all models on the binary classification tasks but multiclass classification is a challenge for the quantum models there is a notable decrease in accuracy when using 3 classes. overall the performance is comparable in terms of recall and accuracy between qnns and cnns even with large datasets. these results provide a point of comparison between quantum and classical models on real world datasets.", "Pub Date": "2023-11-30"}