{"Title": "Characterization of Liquid Scintillator-Based CNES for Deuterium‚ÄìDeuterium Neutron Emission Spectroscopy in the LHD", "Authors": ["s. sangaroon", "k. ogawa", "m. isobe", "l. liao", "m. i. kobayashi", "g. zhong", "s. toyama", "m. miwa", "s. matsuyama", "e. takada", "a. wisitsorasak", "n. poolyarat", "m. osakabe"], "Pub Date": "2023-10-30", "Abstract": "the compact neutron emission spectrometers  cness  based on conventional liquid  ej 301  scintillation detectors were characterized in this work. the cness were employed for deuterium‚äìdeuterium neutron emission spectroscopy in the large helical device  lhd . prior to the installation the ej-301 scintillation detectors were characterized at the fast neutron laboratory  fnl  of tohoku university. in order to discriminate the neutron and  $\\gamma $  ray signals the charge comparison method was used. the neutron energy spectrum was successfully unfolded from the measured recoil proton energy spectrum of the ej-301 scintillation detector using the derivative unfolding technique. the detector‚äôs energy resolution was examined. in the lhd ej 301 based cness with both tangential and perpendicular line of sight were employed for characterization. furthermore the characterization of the cnes was performed in the deuterium‚äìdeuterium experiment campaign. the operational capabilities of cness in the lhd were examined. deuterium‚äìdeuterium neutron emission spectroscopy in various approaches of neutral beam  nb  heated plasmas was conducted using cnes. because of the high energy of the injected fast ions from tangential nb injection an investigation of the doppler effect on deuterium‚äìdeuterium neutron energy was conducted. the upper and lower shifted deuterium‚äìdeuterium neutron energies were observed when the fast ions moved toward and away from the tangential cnes respectively. as expected no notable energy shift was observed from fast ions injected by the perpendicular nb injection. additionally the 5 d orbit following code delta5d which takes into account larmor motion effects and the detector‚äôs energy resolution was utilized to compute the expected deuterium‚äìdeuterium neutron energy spectrum that would be measured by the cnes. there was a concurrence between the calculations and experimental results.", "Doi": "10.1109/TIM.2023.3324350", "Key Words": ["compact neutron emission spectrometer (cnes)", "doppler effect", "large helical device (lhd)", "liquid scintillation detector", "neutral beam (nb) injection"]}