{"Title": "Characterization of Traveling-Wave Josephson Parametric Amplifiers at T = 0.3 K", "Authors": ["v. granata", "g. avallone", "c. barone", "m. borghesi", "s. capelli", "g. carapella", "a. p. caricato", "i. carusotto", "a. cian", "d. di gioacchino", "e. enrico", "p. falferi", "l. fasolo", "m. faverzani", "e. ferri", "g. filatrella", "c. gatti", "a. giachero", "d. giubertoni", "a. greco", "c. guarcello", "d. labranca", "a. leo", "c. ligi", "g. maccarrone", "f. mantegazzini", "b. margesin", "g. maruccio", "c. mauro", "r. mezzena", "a. g. monteduro", "a. nucciotti", "l. oberto", "l. origo", "s. pagano", "v. pierro", "l. piersanti", "m. rajteri", "a. rettaroli", "s. rizzato", "a. vinante", "m. zannoni"], "Pub Date": "2022-12-01", "Abstract": "the growing interest in quantum technologies from fundamental physics experiments to quantum computing demands for extremely performing electronics only adding the minimum amount of noise admitted by quantum mechanics to the input signal  i.e. quantum limited electronics . superconducting microwave amplifiers due to their dissipationless nature exhibit outstanding performances in terms of noise  quantum limited  and gain. however bandwidth and saturation power still show space for substantial improvement. within the dartwars11dartwars  detector array readout with traveling wave amplifiers  funded by italian national nuclear institute  infn  is a quantum technologies project targeted at the development of wideband superconducting amplifiers with noise at the quantum limit and the implementation of a quantum limited readout in different types of superconducting detectors and qubit. collaboration we are developing state of the art microwave superconducting amplifiers based on josephson junction arrays and on distributed kinetic inductance transmission lines. here we report the realization of a setup for the characterization of the performances of josephson traveling wave parametric amplifiers at a temperature of 300 mk. although in the final experimental setup these amplifiers will operate at a base temperature of about 20 mk their characterization at 300 mk allows to evidence the main aspects of their performances but the ultimate noise level. this represents a quick and relatively inexpensive way to test these superconductive devices that can be of help to improve their design and fabrication.", "Doi": "10.1109/TASC.2022.3214656", "Key Words": ["superconducting microwave devices", "superconducting device noise", "quantum computing", "qubit readout"]}