{"Title": "Chinese Named Entity Recognition Base on Multi-Metadata Embedding and Global Pointer", "Doi": "10.1109/EIECS59936.2023.10435487", "Authors": ["s. wang", "f. liu", "b. huang", "j. li", "p. feng"], "Key Words": ["component", "chinese named entity recognition", "natural language processing", "deep neural networks"], "Abstract": "named entity recognition  ner  aims to identify entities from unstructured text and is an important subtask in natural language processing and knowledge graph construction. existing ner methods mostly use conditional random fields  crf  as the label decoder or employ pointer networks for entity recognition. however when the number of labels is large crf based methods incur high computational costs and fail to address the issue of nested entities. pointer networks use two modules to identify the first and last entity respectively where each module can only focus on the information of either the first or the last entity lacking the ability to consider global information about the entities. furthermore recent pointer network models have neglected two important aspects that are specific to the chinese language  structure and pronunciation. these two aspects carry essential syntactic and semantic information which are crucial for language comprehension. to address these challenges the paper proposes a chinese ner model called multi embedding global pointer  megp  that incorporates radical and pinyin features to enhance performance. this model combines these features with a global pointer network to improve chinese ner. the model employs a simple feature enhancement approach by merging radical and pronunciation information into the vector representation of each character followed by entity recognition using the global pointer method. experimental results demonstrate that compared to existing mainstream models this model achieves improved f1 scores on multiple public datasets such as weibo resume and people‚äôs daily.", "Pub Date": "2024-02-21"}