{"Title": "Classification of Clothing Quality Dimension Based on Consumer Review Using BERT and RoBERTa", "Doi": "10.1109/ICoDSA58501.2023.10277164", "Authors": ["n. d. girawan", "a. alamsyah"], "Key Words": ["multi label classification", "roberta", "nlp"], "Abstract": "consumer feedback plays a crucial role in enhancing the quality of clothing products. however effectively analyzing the vast and diverse range of reviews necessitates the application of natural language processing  nlp  techniques and advanced language models. this research proposes the utilization of a fine tuned bert  bidirectional encoder representations from transformers  model and an optimized roberta  robustly optimized bert approach  model for multi label classification tasks with the objective of comprehending consumer reviews more efficiently. to conduct the study a dataset was compiled by collecting reviews from amazon.com using a dedicated scraping platform. additionally a kaggle public dataset was incorporated to augment the dataset‚äôs comprehensiveness. the fine tuned bert and optimized roberta models were employed to analyze the collected data and extract meaningful insights. the experimental results indicate that the roberta model exhibits superior performance compared to the bert model as evidenced by its macro averaged f1 score of 0.87 and micro averaged f1 score of 0.85. these results highlight the robustness and efficacy of the roberta model in effectively comprehending consumer reviews for the given task of multilabel classification. by leveraging the proposed approach which combines nlp techniques and advanced language models the study contributes to enhancing the understanding of consumer feedback and enables more efficient analysis of clothing product reviews. the findings underscore the potential of leveraging state of the art language models for improving the quality and relevance of consumer driven insights in the fashion industry.", "Pub Date": "2023-10-17"}