{"Title": "Classification of Potentially Hazardous Asteroids Using Supervised Quantum Machine Learning", "Authors": ["r. bhavsar", "n. k. jadav", "u. bodkhe", "r. gupta", "s. tanwar", "g. sharma", "p. n. bokoro", "r. sharma"], "Pub Date": "2023-07-26", "Abstract": "quantum computing  qc  and quantum machine learning  qml  are emerging technologies with the potential to revolutionize the way we approach complex problems in mathematics physics and other fields. the increasing availability of data and computing power has led to a rise in using artificial intelligence  artificial intelliegence  to solve real time problems. in space science employing artificial intelliegence based approaches to address various challenges including the potential risks posed by asteroids is becoming increasingly necessary. potentially hazardous asteroids  phas  can cause significant harm to humans and biodiversity through wind blasts overpressure shock thermal radiation cratering seismic shaking ejecta deposition and even tsunamis. machine learning  ml  algorithms have been employed to detect hazardous asteroids based on their parameters. still there are limitations to the current techniques and the results have reached a saturation point. to address this issue we propose a quantum machine learning  qml  based approach for asteroid hazard prediction employing variational quantum circuits  vqc  and pegasosqsvc algorithms. the proposed work aims to leverage the quantum properties of the data to improve the accuracy and precision of asteroid classification. our study focuses on the impact of phas and the proposed supervised qml based method aims to detect whether an asteroid with specific parameters is hazardous or not. we compared several classification algorithms and found that the proposed qml based approach employing vqc and pegasosqsvc outperformed the other methods with an accuracy of 98.11% and an average f1 score of 92.69%.", "Doi": "10.1109/ACCESS.2023.3297498", "Key Words": ["quantum computing", "quantum machine learning", "qubits", "quantum gates", "entanglement", "astronomy", "asteroid hazard prediction", "astrometry", "quantum algorithm optimization"]}