{"Title": "Cloud-Edge Collaboration-Based Distribution Network Reconfiguration for Voltage Preventive Control", "Doi": "10.1109/TII.2023.3247028", "Authors": ["d. yue", "z. he", "c. dou"], "Key Words": ["cloud-edge collaboration", "differential hybrid petri-net", "distribution network reconfiguration (dnr)", "graph convolutional neural network (gcn)", "voltage preventive control"], "Abstract": "the distribution network reconfiguration  dnr  can realize the voltage preventive control of the distribution network  dn  under alert state which solves the voltage security issues and maintains the safe operation of the dn. however since the great scale and complexity of the dn would make the traditional centralized dn reconfiguration method have a heavy computing burden a dnr method based on cloud edge collaborative architecture for voltage preventive control is proposed in this article which can reduce the huge computational pressure caused by the excessive concentration of computing tasks. in order to formulate the optimal topology reconfiguration strategy according to the specifics of voltage alerts a differential hybrid petri net model with event triggered strategy is constructed based on the cloud edge collaborative architecture to characterize the logical relations of the solution process of the reconfiguration strategy. considering the short time scale characteristic of preventive control corresponding to the solution process described by the constructed model an evaluation network based on the graph convolutional neural network  gcn  is proposed for the reachability discrimination of solutions to significantly reduce the number of candidate solutions as well as a decision network based on multilayer perceptron is proposed for the selection of the optimal solution among the reachable solutions. numerical tests are conducted on the modified ieee 33 bus and ieee 118 bus distribution systems to validate the effectiveness of the proposed method in dealing with voltage alert problems.", "Pub Date": "2023-10-19"}