{"Title": "Cloud-Edge-End Collaborative Caching Based on Graph Learning for Cyber-Physical Virtual Reality", "Doi": "10.1109/JSYST.2023.3262255", "Authors": ["j. yang", "z. guo", "j. luo", "y. shen", "k. yu"], "Key Words": ["collaborative caching", "cyber-physical systems", "graph learning", "virtual reality (vr)"], "Abstract": "virtual reality  vr  is an important landing scenario for 5g and a key enabling technology for the digital economy and the core challenge it faces is how to ensure real time interaction and content distribution efficiency. existing solutions rely on adaptive delivery overall content edge caching or asynchronous rendering in the cloud with drawbacks such as high caching and computing costs and difficulty in ensuring real time. this article is oriented to content generation and synchronization of virtual reality and aims at realizing intelligent transmission of vr content with high efficiency and low delay guarantee and carries out research on cloud edge end collaborative mechanisms. first for ai aided vr content generation a cloud edge end collaborative service architecture is constructed to support independent encoding and distribution of background and interactive content generation. second to address the issue that the mec node with limited cache space cannot meet the dynamical demands of vr user a cloud edge collaborative caching strategy based on graph neural networks is proposed to achieve optimal caching and updating of background content in which the background content is first cached mec node according to the content request with node sharing scheme then the content is updated according to a minimal cost update algorithm based on the graph neural networks  gnn  aided request prediction. finally the proposed algorithm is simulated and tested the simulation results show that the proposed caching and update algorithm achieve better quality of experiment  qoe  and higher cache hit ratio compared with comparison algorithms.", "Pub Date": "2023-12-12"}