{"Title": "Collaborative Computing Optimization in Train-Edge-Cloud-Based Smart Train Systems Using Risk-Sensitive Reinforcement Learning", "Doi": "10.1109/TVT.2023.3325674", "Authors": ["l. zhu", "s. lin", "f. r. yu", "y. li"], "Key Words": ["smart train systems", "edge intelligence (ei)", "train-edge-cloud (tec)", "collaborative computing", "quantum-inspired-optimized", "risk-sensitive reinforcement learning (rl)"], "Abstract": "with the advent of the intelligent and digital era intelligent urban rail transit systems have been a research focus. as the core part of intelligent urban rail transit systems smart trains are empowered by various intelligent applications. while improving system performance and reducing system risk intelligent applications demand a large amount of computing power. however it is challenging to provide simultaneously all intelligent applications for smart trains due to limited on board computing resources. in this article we design a train edge cloud  tec  collaborative computing framework for train intelligent computing tasks. we aim to develop a tec based collaborative computing scheme to minimize the task processing delay with edge computing resource constraints. considering the unique environment of smart train systems we design a risk sensitive reinforcement learning  rl  algorithm to realize collaborative computing optimization. we design a novel risk function in the system by jointly considering the computing load of edge intelligence  ei  servers and the characteristics of the urban rail transit systems. moreover we optimize the proposed risk sensitive rl algorithm by using quantum representation and functions to accelerate its convergence speed. we design the tec based collaborative computing framework and design the quantum inspired risk sensitive rl algorithm to formulate the strategies for task scheduling. comprehensive simulation results indicate that the algorithm adopted in this article can significantly reduce the task processing delay while satisfying ei servers' computing resource constraints. the quantum inspired optimized risk sensitive rl model dramatically improves the model convergence speed.", "Pub Date": "2024-03-13"}