{"Title": "Collaborative and Intelligent Resource Optimization for Computing and Caching in IoV With Blockchain and MEC Using A3C Approach", "Doi": "10.1109/TVT.2022.3210570", "Authors": ["x. ye", "m. li", "p. si", "r. yang", "z. wang", "y. zhang"], "Key Words": ["internet of vehicles", "mobile edge computing", "blockchain", "resource allocation", "asynchronous advantage actor-critic"], "Abstract": "recently the rise of the internet of vehicles  iov  has driven the broad development of intelligent transportation and smart cities. in order to promote the computing power of mobile vehicles and decrease the content delivery latency of suppliers mobile edge computing  mec  is recognized as a promising computational paradigm and used in vehicular networks. however there are some essential issues to be considered  1  privacy and authenticity of data transmission in iov and 2  reasonable resource allocation for collaborative computing and caching. in this paper to solve above issues blockchain technology is introduced and adopted to ensure the accuracy and reliability of data transmission and interaction. meanwhile we develop an intelligent framework of resource allocation about computing and caching for blockchain enabled mec systems in iov. through jointly considering and optimizing offloading decision of computation task carried by vehicle caching decision the number of offloaded consensus nodes block interval and block size the weighted consumption costs of energy consumption and computation overheads can be decreased and the transactional throughput of the blockchain can be increased. moreover due to the continuity and dynamic of the available resources of mobile vehicles and computing servers the optimization problem is modeled as a markov decision process  mdp . facing the large scale and dynamic characteristics of the system the asynchronous advantage actor critic  a3c  approach is introduced to deal with the optimization problem. simulation results show that our proposed scheme achieves significant advantages over other comparison schemes such as the total reward of the proposed scheme is about 14% higher than that of the deep $q$ network based scheme.", "Pub Date": "2023-02-13"}