{"Title": "Collaborative Edge Intelligence Service Provision in Blockchain Empowered Urban Rail Transit Systems", "Doi": "10.1109/JIOT.2023.3294400", "Authors": ["h. liang", "l. zhu", "f. r. yu"], "Key Words": ["blockchain", "edge intelligence (ei)", "hierarchical reinforcement learning (hrl)", "urban rail transits (urts)"], "Abstract": "with the advancement of urban rail transits  urts  the demand for artificial intelligence  ai  based urts services grows exponentially. edge intelligence  ei  leverages computing resources on the network edge to provide real time intelligent services in close proximity. as it enables fast distributed learning ei is envisioned to be a potential component of urts and ideal ei service provision is a critical concern for the intelligent development of urts. the existing ei related research concentrates on the computation offloading of general ai based tasks whereas both the edge server deployment and ai model training process are not explicitly designed for urts. the urts ai service characteristics such as model training demand priority and security are largely ignored. in this article we propose a novel collaborative ei service provision framework for urts. blockchain is used along with the ei server to construct a trusted computing infrastructure. to address the ei service credit crisis a blockchain based trust management mechanism including short term reward incentives and long term reputation evaluation is designed in the trusted computing infrastructure. an hrl based collaborative training service optimization model is proposed to improve the learning efficiency and edge resource utilization rate in urts. specifically the proposed two stage collaborative optimization model jointly considers high level service scheduling and low level task offloading. in addition we present an intelligent train control model based on the state of the art decision transformer  dt  with the training service as a case study to demonstrate the effectiveness of the proposed collaborative ei service provision. extensive simulation results show that the proposed ei service provision framework can provide trusted efficient and high quality ai training services simultaneously improving urts operational efficiency.", "Pub Date": "2024-01-08"}