{"Title": "Combining Federated Learning and Edge Computing Toward Ubiquitous Intelligence in 6G Network: Challenges, Recent Advances, and Future Directions", "Doi": "10.1109/COMST.2023.3316615", "Authors": ["q. duan", "j. huang", "s. hu", "r. deng", "z. lu", "s. yu"], "Key Words": ["federated learning", "edge computing", "ubiquitous intelligence", "6g network"], "Abstract": "full leverage of the huge volume of data generated on a large number of user devices for providing intelligent services in the 6g network calls for ubiquitous intelligence  ui . a key to developing ui lies in the involvement of the large number of network devices which contribute their data to collaborative machine learning  ml  and provide their computational resources to support the learning process. federated learning  fl  is a new ml method that enables data owners to collaborate in model training without exposing private data which allows user devices to contribute their data to developing ui. edge computing deploys cloud like capabilities at the network edge which enables network devices to offer their computational resources for supporting fl. therefore a combination of fl and edge computing may greatly facilitate the development of ubiquitous intelligence in the 6g network. in this article we present a comprehensive survey of the recent developments in technologies for combining fl and edge computing with a holistic vision across the fields of fl and edge computing. we conduct our survey from both the perspective of an fl framework deployed in an edge computing environment  fl in edge  and the perspective of an edge computing system providing a platform for fl  edge for fl . from the fl in edge perspective we first identify the main challenges to fl in edge computing and then survey the representative technical strategies for addressing the challenges. from the edge for fl perspective we first analyze the key requirements for edge computing to support fl and then review the recent advances in edge computing technologies that may be exploited to meet the requirements. then we discuss open problems and identify some possible directions for future research on combining fl and edge computing with the hope of arousing the research community‚äôs interest in this emerging and exciting interdisciplinary field.", "Pub Date": "2023-11-21"}