{"Title": "Combination of Auction Theory and Multi-Armed Bandits: Model, Algorithm, and Application", "Doi": "10.1109/TMC.2022.3197459", "Authors": ["g. gao", "s. huang", "h. huang", "m. xiao", "j. wu", "y. -e. sun", "s. zhang"], "Key Words": ["combinatorial multi-armed bandits", "auction theory", "strategic behaviors", "truthfulness", "regret bound", "applications"], "Abstract": "the multi armed bandit  mab  models have always received lots of attention from multiple research communities due to their broad application domains. the optimal selection problem with unknown rewards in advance such as ad recommendation in social networks spectrum access in the cognitive radio field etc. can be efficiently solved by using mab models. in an mab model given $n$n arms whose rewards are unknown in advance the player selects exactly one arm in each round and his goal is to maximize the cumulative rewards over a fixed horizon. further a more general model called combinatorial mab  i.e. cmab  where $k$k arms can be played simultaneously in each round is put forward. however the existing cmab models neglect the strategic behaviors of the $n$n arms which indicates that one arm might report false information to increase its own profits. in fact in many applications such as user selection in crowdsensing the arms are not the feelingless machines but the rational individuals. to this end we combine the upper confidence bound  ucb  with auction theory to develop a new algorithm called auction based ucb  aucb . we divide the auction based cmab problem into two sub problems  winning arm selection and payment computation problems. for aucb we derive an upper bound on regret and prove the truthfulness in one round individual rationality and computational efficiency. in addition we consider an extended situation that some arms may be unavailable in some rounds and the arms will bid inconsistently in different rounds. we devise another algorithm called eaucb to solve this problem. extensive simulations are conducted to show the significant performance of the proposed algorithms.", "Pub Date": "2023-10-03"}