{"Title": "Community Detection and Attention-Weighted Federated Learning Based Proactive Edge Caching for D2D-Assisted Wireless Networks", "Doi": "10.1109/TWC.2023.3249756", "Authors": ["d. li", "h. zhang", "t. li", "h. ding", "d. yuan"], "Key Words": ["proactive edge caching", "device-to-device (d2d)", "attention-weighted federated learning", "community detection", "social network"], "Abstract": "this work investigates proactive edge caching for d2d assisted wireless networks where user equipments  ues  can be selected as caching nodes to assist content delivery. the objective of this work is to achieve a trade off between the cost for providing caching services and the content transmission latency. doing so there are two challenges  1  which ues can be selected as caching nodes  2  how to place contents on these selected ues without user‚äôs privacy disclosure. to address these a novel community detection and attention weighted federated learning based proactive edge caching  caflpc  strategy is proposed. in the strategy we first group ues into different communities based on both the mobility and social properties of ues and then select important users  ius  as caching nodes for each community by considering the social importance of ues. to determine how to place the popular contents in these selected ius an attention weighted federated learning  awfl  based content popularity prediction framework is proposed. it integrates the attention weighted federated learning with bidirectional long short term memory network  awfl bilstm  to achieve a higher content popularity prediction accuracy while protecting user‚äôs privacy. considering the imbalance of ues‚äô active levels and local computing capacities an attention weighted aggregation mechanism is proposed to improve the training efficiency and prediction accuracy. simulations results show that the proposed caflpc strategy outperforms the compared existing caching strategies at about 2.2% 35.1% in terms of the transmission latency reduced by per unit cost.", "Pub Date": "2023-11-10"}