{"Title": "Comparison of Double Relaxation Oscillation SQUIDs and DC-SQUIDs of Large Stewart-McCumber Parameter", "Authors": ["b. kim", "k. -k. yu", "j. -m. kim", "y. -h. lee"], "Pub Date": "2023-05-02", "Abstract": "increasing the flux to voltage transfer coefficient of the squid output voltage is necessary to release the constraint on the preamplifier input noise. as one of the approaches to increase the transfer coefficient we have been using a double relaxation oscillation squid  dros  having a transfer coefficient of about 10 times larger than those of dc squids. traditionally dc squids were operated in the non hysteretic condition with the stewart mccumber parameter  œ≤c  less than 1. in this study we fabricated hysteretic dc squids with the œ≤c ranging from 2.5 and compared the transfer coefficient and the system noise of dc squids and dross. both dros and dc squid have the same structure and design parameters for the squid loop inductance resonance damping circuits in the squid loop and input coil. all the squids were fabricated in the same wafer using the nb alox/nb junction process. the transfer coefficients of dross were about 1 mv/œ¶0 regardless of squid parameters. for dc squids the transfer coefficients were sensitive to the œ≤c and the operating margin was narrower than that of dros. the white noise of both squids in the flux locked loop mode was around 1.5 œºœ¶0/‚àöhz at 100 hz measured with a preamplifier of input voltage noise of 1 nv/‚àöhz. dc squids had mostly a narrower operating margin against the bias current and the modulation voltage was smaller than dros. in a near optimized operating condition both dros and hysteretic dc squid showed comparable noise performance.", "Doi": "10.1109/TASC.2023.3243200", "Key Words": ["superconducting quantum interference device (squid)", "double relaxation oscillation squid (dros)", "preamplifier input noise", "squid intrinsic noise", "flux noise", "wire resistance"]}