{"Title": "Computational Imaging and Artificial Intelligence: The Next Revolution of Mobile Vision", "Doi": "10.1109/JPROC.2023.3338272", "Authors": ["j. suo", "w. zhang", "j. gong", "x. yuan", "d. j. brady", "q. dai"], "Key Words": ["artificial intelligence (ai)", "autonomous driving", "brain science", "cameras", "cloud computing", "computational imaging (ci)", "deep learning", "edge cloud", "edge computing", "machine learning", "machine vision", "mobile vision", "neural networks", "optics", "self-driving"], "Abstract": "signal capture is at the forefront of perceiving and understanding the environment  thus imaging plays a pivotal role in mobile vision. recent unprecedented progress in artificial intelligence  artificial intelliegence  has shown great potential in the development of advanced mobile platforms with new imaging devices. traditional imaging systems based on the ‚äúcapturing images first and processing afterward‚äù mechanism cannot meet this explosive demand. on the other hand computational imaging  ci  systems are designed to capture high dimensional data in an encoded manner to provide more information for mobile vision systems. thanks to artificial intelliegence ci can now be used in real life systems by integrating deep learning algorithms into the mobile vision platform to achieve a closed loop of intelligent acquisition processing and decision making thus leading to the next revolution of mobile vision. starting from the history of mobile vision using digital cameras this work first introduces the advancement of ci in diverse applications and then conducts a comprehensive review of current research topics combining ci and artificial intelliegence. although new generation mobile platforms represented by smart mobile phones have deeply integrated ci and artificial intelliegence for better image acquisition and processing most mobile vision platforms such as self driving cars and drones only loosely connect ci and artificial intelliegence and are calling for a closer integration. motivated by this fact at the end of this work we propose some potential technologies and disciplines that aid the deep integration of ci and artificial intelliegence and shed light on new directions in the future generation of mobile vision platforms.", "Pub Date": "2023-12-18"}