{"Title": "Comparison of Different Natural Language Processing Models to Achieve Semantic Interoperability of Heterogeneous Asset Administration Shells", "Doi": "10.1109/INDIN51400.2023.10218154", "Authors": ["j. beermann", "r. benfer", "m. both", "j. m√ºller", "c. diedrich"], "Key Words": ["semantic interoperability", "natural language processing", "industrie 4.0"], "Abstract": "self organizing systems represent the next level of building automation and make it possible to reduce the manual engineering effort of automation systems. for self organizing systems to be able to interact interoperable the system components must be mapped by uniform digital twins and described in a semantically interoperable manner. semantic interoperability is implemented in the current research approach of industrie 4.0 through homogeneous semantics. however given the large number of different manufacturers of technical components agreement on uniform semantics seems unlikely. this paper presents a method that extends the industrie 4.0 approach to heterogeneous semantics. semantic interoperability is realized through the automated mapping of heterogeneous vocabularies to target semantics. models from the artificial intelligence sub field natural language processing are used for automated mapping. in this paper existing models of natural language processing are compared with each other in terms of their mapping accuracy. a dataset based on the eclass standard is being developed as a basis for the comparison. this dataset is also being used to create new models that are fine tuned to the target vocabulary. the results show that the mapping accuracy of existing approaches improves through fine tuning by an average of 7.5% up to 93%. in addition to the improvement through fine tuning this work analyses the influence of the model size on the mapping accuracy by using large language models. moreover it examines the integration of structured knowledge in the form of knowledge graphs.", "Pub Date": "2023-08-22"}