{"Title": "Comparison of Analyze-Then-Compress Methods in Edge-Assisted Visual SLAM", "Doi": "10.1109/ACCESS.2023.3290901", "Authors": ["j. hofer", "p. sossalla", "c. l. vielhaus", "j. rischke", "m. reisslein", "f. h. p. fitzek"], "Key Words": ["edge computing", "feature representation", "key frame", "low latency communication", "network throughput", "visual simultaneous localization and mapping (vslam)"], "Abstract": "in edge assisted visual simultaneous localization and mapping  slam  mobile devices offload computationally intensive tasks to an edge cloud. the mobile device should transfer its input data to the edge cloud in a resource efficient way especially in visual slam systems with their very large image frame input data. most state of the art systems use a conventional analyze then compress  atc  approach that pre analyzes the captured frames on the mobile device  incurring substantial processing latencies  and transmits only the  several times smaller  pre analysis results namely only the feature representation of so called key frames  and the corresponding tracking results  to the edge. we examine two novel transmission methods  atc workflows  for ‚äúfunctional split‚äù edge assisted visual slam  feature representation every frame  fref  transmits the feature representation for every captured frame to the edge and the edge performs the key frame creation processing  including the tracking   feature representation only key frames  frokf  transmits only the feature representation of key frames without the tracking results to the edge and the edge performs the tracking. we evaluate these atc methods in terms of the required network throughput  bandwidth  as well as the latencies for transmission and processing as well as the resulting end to end latency  from frame capture at the mobile device to key frame and tracking results becoming available at the edge cloud  via testbed measurements for various computing hardware platforms. compared to the existing conventional approach our newly introduced fref method can reduce the end to end latency down to one quarter  while our frokf method can reduce the required throughput down to one fifth. additionally feature compression can reduce the required throughput  within the frokf method down to one twentieth compared to the conventional method without feature compression albeit at the expense of significantly increased processing latency for the compression.", "Pub Date": "2023-07-13"}