{"Title": "Compact Hybrid Signature for Secure Transition to Post-Quantum Era", "Authors": ["h. -y. kwon", "i. bajuna", "m. -k. lee"], "Pub Date": "2024-03-18", "Abstract": "recent advances in quantum computing technology have threatened the security of classical cryptographic algorithms. this initiated research on post quantum cryptography  pqc  and the national institute of standards and technology  nist  pqc standardization is in progress. coping with the current situation in which the security of existing cryptographic algorithms is already in question and that of new cryptographic algorithms is not yet certain there has been active research on hybrid schemes combining two algorithms such that the security of the combined scheme is based on both underlying algorithms. for digital signatures a naive solution for a hybrid scheme is to simply concatenate a classical signature and a quantum resistant signature. in this paper however we propose a compact hybrid signature construction method that combines two randomized signatures such that the size of the combined signature is shorter than that of naive concatenation. our construction allows for selective verification which provides backward compatibility and conformance with existing regulations. we demonstrate the feasibility of the proposed method by combining ecdsa p-256 and falcon 512 which are representative classical and post quantum signature schemes respectively. we prove that the combined signature is existentially unforgeable against an adaptive chosen message attack even if one of the underlying signature schemes is completely broken and only the other one remains secure. through experiments on a desktop pc and raspberry pi 3 model b we verify that the proposed method effectively reduces the combined signature size with negligible computational overhead. our experimental results demonstrate the proposed method is also applicable to pqc pqc combinations.", "Doi": "10.1109/ACCESS.2024.3374645", "Key Words": ["hybrid signature", "post-quantum cryptography", "ecdsa", "falcon"]}