{"Title": "Computational Rate Maximization for IRS-Assisted Full-Duplex Wireless-Powered MEC Systems", "Doi": "10.1109/TVT.2023.3302407", "Authors": ["p. chen", "b. lyu", "s. gong", "h. guo", "j. jiang", "z. yang"], "Key Words": ["wireless-powered mobile edge computing", "intelligent reflecting surface", "full-duplex", "irs beamforming designs"], "Abstract": "wireless powered mobile edge computing  wp mec  makes it feasible to facilitate ubiquitous computation for resource limited wireless device  wds  in the self sustainable manner. however the channels for wireless power transfer  wpt  and task offloading are hostile due to the severe signal attenuation. the conventional wp mec systems generally suffer from a dilemma caused by the trade off between wpt and task offloading since they are usually implemented during different phases. to tackle these issues we propose to reconfigure the propagation environment by deploying intelligent reflecting surface  irs  and enable simultaneous wpt and task reception at the hybrid access point  hap  by adopting the full duplex  fd  technique. two types of irs beamforming designs i.e. dynamic and static irs bemforming are considered to strike a balance between the performance and signaling overhead as well as implementation complexity. we aim to maximize the computational rate of the irs assisted fd wp mec system with finite edge computing capability. an efficient alternating optimization  ao  method is proposed to tackle the non convexity of the optimization problem. specifically the transmit power of the hap and the irs beamforming are optimized by the penalty method and successive convex approximation  sca  method respectively. the non convexity of the sub problem with respect to the system time allocation the local computing frequencies and transmit power of the wds is tackled by the variable substitution method. numerical results are provided which demonstrate the benefits of exploiting irs and fd techniques.", "Pub Date": "2024-01-16"}