{"Title": "Computational Efficiency Maximization for UAV-Assisted MEC Networks With Energy Harvesting in Disaster Scenarios", "Doi": "10.1109/JIOT.2023.3322001", "Authors": ["r. khalid", "z. shah", "m. naeem", "a. ali", "a. al-fuqaha", "w. ejaz"], "Key Words": ["computational efficiency", "disaster management", "energy harvesting (eh)", "interior-point", "linearization", "unmanned aerial vehicles (uavs)"], "Abstract": "recently unmanned aerial vehicle  uav  assisted mobile edge computing  mec  networks are considered to provide effective and efficient solutions for disaster management. however the limited size of end user devices comes with the limitation of battery lives and computational capacities. therefore offloading energy consumption and computational efficiency are significant challenges for uninterrupted communication in uav assisted mec networks. this article considers a uav assisted mec network with energy harvesting  eh . to achieve this we mathematically formulate a mixed integer nonlinear programming problem to maximize the computational efficiency of uav assisted mec networks with eh under disaster situations. a power splitting architecture splits the source power for communication and eh. we jointly optimize user association transmission power of user equipment  ue  task offloading time and uav‚äôs optimal location. to solve this optimization problem we divide it into three stages. in the first stage we adopt  $k$  means clustering to determine the optimal locations of the uavs. in the second stage we determine user association. in the third stage we determine the optimal power of ue and offloading time using the optimal uav location from the first stage and the user association indicator from the second stage followed by linearization and the use of the interior point method to solve the resulting linear optimization problem. simulation results for offloading no offloading offloading eh and no offloading eh scenarios are presented with a varying number of uavs and ues. the results show the proposed eh solution‚äôs effectiveness in offloading scenarios compared to no offloading scenarios in terms of computational efficiency bits computed and energy consumption.", "Pub Date": "2024-02-21"}