{"Title": "Comparative Analysis of BERT Models for Sentiment Analysis on Twitter Data", "Doi": "10.1109/ICSCC59169.2023.10335061", "Authors": ["a. sahoo", "r. chanda", "n. das", "b. sadhukhan"], "Key Words": ["sentiment analysis", "twitter", "text data", "bert", "deep learning"], "Abstract": "sentiment analysis is a technique in natural language processing that entails the recognition and categorization of viewpoints articulated in written or spoken language. the utilization of twitter as a prevalent medium for the expression of opinions and emotions has resulted in a significant focus on the analysis of sentiments from twitter‚äôs tweet data. bidirectional encoder representations from transformers  bert  is a preexisting deep learning model that has demonstrated exceptional proficiency in natural language processing  nlp  assignments as in sentiment analysis. the present investigation entails a comparison of three different bert models namely fine tuned bert base multilingual uncased robertuito and rubert with respect to their efficacy in performing twitter data sentiment analysis. the models were graded according to their f1 score recall accuracy and precision utilizing a manually annotated dataset of 1578627 tweets. the experimental findings indicate that the robertuito model exhibits superior in comparison to the other two models attaining an accuracy score of 83.23%. the results offer valuable perspectives on the efficacy of bert models in the context of analyzing twitter data based on how people feel thereby aiding scholars and professionals in selecting the most appropriate bert model for their sentiment analysis task. the study emphasizes that the selection of the bert model for twitter data sentiment analysis should be contingent on the evaluation metric of interest. this study contributes to an understanding of the effectiveness of bert models for sentiment analysis on twitter data which can be applied to social media monitoring and analysis.", "Pub Date": "2023-12-06"}