{"Title": "Compact and Stable Memristive Visual Geometry Group Neural Network", "Doi": "10.1109/TNNLS.2021.3104860", "Authors": ["h. ran", "s. wen", "q. li", "y. cao", "k. shi", "t. huang"], "Key Words": ["compact neural network", "edge computing", "matrix‚äìvector multiplication (mvm)", "memristive visual geometry group (mvgg)", "stable circuit"], "Abstract": "as edge computing platforms need low power consumption and small volume circuit with artificial intelligence  artificial intelliegence  we design a compact and stable memristive visual geometry group  mvgg  neural network for image classification. according to characteristics of matrix‚äìvector multiplication  mvm  using memristor crossbars we design three pruning methods named row pruning column pruning and parameter distribution pruning. with a loss of only 0.41% of the classification accuracy a pruning rate of 36.87% is obtained. in the mvgg circuit both the batch normalization  bn  layers and dropout layers are combined into the memristive convolutional computing layer for decreasing the computing amount of the memristive neural network. in order to further reduce the influence of multistate conductance of memristors on classification accuracy of mvgg circuit the layer optimization circuit and the channel optimization circuit are designed in this article. the theoretical analysis shows that the introduction of the optimized methods can greatly reduce the impact of the multistate conductance of memristors on the classification accuracy of mvgg circuits. circuit simulation experiments show that for the layer optimized mvgg circuit when the number of multistate conductance of memristors is  $2^{5}= 32$  the optimized circuit can basically achieve an accuracy of the full precision mvgg. for the channel optimized mvgg circuit when the number of multistate conductance of memristors is  $2^{2}= 4$  the optimized circuit can basically achieve an accuracy of the full precision mvgg.", "Pub Date": "2023-02-03"}