{"Title": "Computation Offloading and Beamforming Optimization for Energy Minimization in Wireless-Powered IRS-Assisted MEC", "Doi": "10.1109/JIOT.2023.3265011", "Authors": ["s. zhao", "y. liu", "s. gong", "b. gu", "r. fan", "b. lyu"], "Key Words": ["deep reinforcement learning (drl)", "intelligent reflecting surface (irs)", "mobile-edge computing (mec)", "symbiotic radio (sr)"], "Abstract": "intelligent reflecting surface  irs  has been recently exploited as a symbiotic radio  sr  technology to improve energy and spectral efficiencies in wireless systems. in this article we consider a symbiotic irs assisted mobile edge computing  mec  system that allows edge users to first harvest rf power from a hybrid access point  hap  and then offload its computational workload to the mec server associated with the hap. we aim to minimize the hap‚äôs energy consumption by jointly optimizing the users‚äô offloading schemes the hap‚äôs active beamforming and the irs‚äôs passive beamforming strategies. we propose an optimization driven hierarchical deep deterministic policy gradient  oh ddpg  framework to decompose the energy minimization problem into the optimization and the learning subproblems respectively. the outer loop ddpg learning method adapts the irs‚äôs passive beamforming strategy while the inner loop optimization deals with the other control variables with reduced dimensionality. moreover to improve the learning efficiency we extend oh ddpg to the multiagent scenario. in particular the hap first estimates the users‚äô offloading strategy by the inner loop optimization and shares it with all user agents. then each user agent refines its offloading decision using the ddpg algorithm independently. this can avoid signaling overhead among users and improve the multiuser learning efficiency. simulation results show that the proposed oh ddpg and the multiuser extension can achieve significant performance gains compared to the conventional model free learning algorithms.", "Pub Date": "2023-10-30"}