{"Title": "Computational Rate Maximization for IRS-Assisted Multiantenna WP-MEC Systems With Finite Edge Computing Capability", "Doi": "10.1109/JIOT.2023.3311916", "Authors": ["p. chen", "y. yang", "j. jiang", "b. lyu", "z. yang", "a. jamalipour"], "Key Words": ["computational rate maximization", "finite edge computing capability", "intelligent reflecting surface (irs)", "nonlinear energy harvesting (eh) model", "wireless-powered mobile edge computing (wp-mec)"], "Abstract": "the progressing development of internet of things  iot  has accelerated the emergence of resource intensive and latency sensitive mobile applications which throws out a great challenge to the battery powered wireless devices  wds  with low computing capabilities. to solve this intractable issue we investigate an intelligent reflecting surface  irs  assisted multiantenna wireless powered mobile edge computing  wp mec  system in which wds first harvest wireless energy emitted by a hybrid access point  hap  then offload their tasks to the edge server and finally download the results. in consideration of the practical scenarios the finite computing capability of edge server and the nonlinear end to end power conversion of energy harvesting  eh  circuits at wds are considered. in addition an irs is deployed to improve the efficiency of wireless power transfer  wpt  and the rate of data transmission between hap and wds. under this setup both space division multiple access  sdma  and time division multiple access  tdma  protocols are exploited and evaluated for data transmission. for each protocol we maximize the computational rate by jointly optimizing time allocation beamforming designs of hap and irs as well as offloading strategies of wds. to solve the problem formulated under the sdma protocol we propose an efficient alternating optimization  ao  algorithm. for the problem under the tdma protocol an ao algorithm with low complexity is proposed. numerical results demonstrate the high effectiveness of the proposed algorithms and the superiority of the sdma protocol over the tdma protocol.", "Pub Date": "2024-02-05"}