{"Title": "Comparative Analysis of Summarization Methods for Skin Care Product Reviews: A Study on BERT, BART, and T5 Models", "Doi": "10.1109/ICAMIMIA60881.2023.10427745", "Authors": ["n. a. maghfiroh", "f. abdurrachman bachtiar", "l. muflikhah"], "Key Words": ["natural language processing", "text summarization", "product reviews", "bert", "bart", "t5"], "Abstract": "the growth of the skin care industry is driving consumers to look for product review information. the skincare product currently widely used by women and men is facial wash products. on the female daily website the most frequently purchased facial wash products are cetaphil products. with so many purchases of this product potential buyers want to try the product by reading the reviews first. however the large number of reviews is a barrier to accessing relevant information. therefore effectively summarizing reviews can solve this problem by presenting key information more concisely and digestibly. this study aims to evaluate the effectiveness of three different summary methods namely bert bart and t5 in summarizing skin care product reviews. the stages in these three models are explained in detail. evaluation results using the rouge score method with the cetaphil facial wash product review dataset show that the bart model consistently has a higher average rouge score than the bert and t5 models. specifically the bart model achieved an average rouge-1 of 0.87718 rouge-2 of 0.80689 and rouge l of 0.87688 while the bert model achieved an average rouge-1 of 0.84591 rouge-2 of 0.77585 and rouge  l is 0.84479 and model t5 has an average rouge-1 of 0.74995 rouge-2 of 0.70048 and rouge l of 0.73023. these results suggest that the generative approach implemented by bart is more effective in addressing the diversity and complexity of skin care product reviews. therefore using the bart model is a better choice for producing skin care product review summaries that are more informative and useful for consumers. in the future these findings may contribute to developing more sophisticated product review summary systems.", "Pub Date": "2024-02-13"}