{"Title": "Computation Offloading Method Using Stochastic Games for Software-Defined-Network-Based Multiagent Mobile Edge Computing", "Doi": "10.1109/JIOT.2023.3277541", "Authors": ["g. wu", "h. wang", "h. zhang", "y. zhao", "s. yu", "s. shen"], "Key Words": ["computation offloading", "mobile edge computing (mec)", "multiagent reinforcement learning (marl)", "resource allocation", "stochastic game"], "Abstract": "in the scenario of industry 4.0 mobile smart devices  sds  on production lines have to process massive amounts of data. these computing tasks sometimes far exceed the computing capability of sds and require lots of energy and time to process. how to effectively reduce energy consumption and latency is necessary to be solved. to this end we first propose a software defined network  sdn  based mobile edge computing  mec  system. in the mec system sds can offload computation tasks to edge servers to decrease the processing latency and avoid the waste of energy. at the same time taking advantage of sdn‚äôs programmability scalability and isolation of the control plane and the data plane an sdn controller can manage edge devices within the mec system. second based on a stochastic game we study the computation offloading and resource allocation problems in the mec system and establish a stochastic game based computation offloading model. furthermore we prove that the multiuser stochastic game in this system can achieve nash equilibrium. we further consider each sd as an independent agent and design a stochastic game based resource allocation algorithm with prioritized experience replays  sgra pers  to minimize energy consumption and processing latency with multiagent reinforcement learning. experiment results demonstrate that the proposed sgra per is superior to maddpg  $q$  mix and mappo algorithms which can significantly reduce the processing delay and energy consumption with dynamic resource allocation. moreover sgra per can still keep a higher performance under the increase of sds which can be applied in a large scale mec system.", "Pub Date": "2023-10-03"}