{"Title": "Compressed Channel-Based Edge Computing for Online Motor Fault Diagnosis With Privacy Protection", "Doi": "10.1109/TIM.2023.3314827", "Authors": ["j. lu", "k. an", "x. wang", "j. song", "f. xie", "s. lu"], "Key Words": ["compressed channel attention neural network (ccann)", "deep learning", "distributed computing", "edge computing", "motor fault diagnosis"], "Abstract": "edge computing technology has been increasingly used in remote and real time motor fault diagnosis  however the majority of the diagnostic algorithm is deployed onto a single processor on the edge node. these configurations require extensive computational resources on the edge node resulting in data security and privacy problems. to address this issue this work develops a compressed channel based edge computing  ccec  framework for online motor fault diagnosis. first a compressed channel attention neural network  ccann  model based on the ccec framework is designed and trained by using the distributed motor condition signals. subsequently the well trained ccann model is split and deployed onto the distributed edge computing nodes by transferring the model parameters to those of the independent sub models. such a procedure reduces the transmitted data to one eighth and eliminates the security issues at the communication level by leveraging the black box nature of the neural networks. the effectiveness and superiority of the designed model have been validated on an edge computing system by using the data from a motor test rig and compared with the state of the art methods. the proposed method can reach 100% diagnosis accuracy in recognition of 10 types of motor statuses and the model size and inference time are 377 kb and 0.22 ms respectively. the results prove several advantages including small size high recognition accuracy strong robustness and high security with privacy protection  thus this method shows great potential in remote and real time motor fault diagnosis.", "Pub Date": "2023-09-27"}