{"Title": "Computing Resource Allocation Strategy Based on Cloud-Edge Cluster Collaboration in Internet of Vehicles", "Doi": "10.1109/ACCESS.2023.3349029", "Authors": ["x. shen", "l. wang", "p. zhang", "x. xie", "y. chen", "s. lu"], "Key Words": ["internet of vehicles", "mobile edge computing", "resource allocation", "reinforcement learning", "task offloading"], "Abstract": "edge computing plays a crucial role in the field of the internet of vehicles  iov  meeting the resource and latency requirements of time sensitive vehicle applications. however the emergence of numerous compute intensive and latency sensitive applications such as augmented reality and autonomous driving has led to a situation where traditional edge computing architectures cannot meet the increasing application demands of the iov. this paper extends the paradigm of vehicular edge computing to a collaborative cloud edge cluster resource provisioning framework. integrating compute resources from multiple edge service providers  esp  and the cloud enables horizontal and vertical collaborative computation offloading among service nodes. to facilitate resource sharing among different esps we introduce a dynamic pricing model and utilize software defined networking  sdn  to tackle this scenario‚äôs complex resource management challenges. furthermore with the optimization objectives of minimizing task computation latency and maximizing the profits of esps we establish a mathematical model. before resource allocation we employ a clustering algorithm to determine initial offloading decisions reducing the dimensionality of the action space. subsequently we employ the double deep q network  ddqn  algorithm to achieve a rational allocation of compute resources. simulation results demonstrate that compared to the deep q network  dqn  algorithm and greedy strategy the proposed approach reduces latency by 18.18% and 34.85% respectively while increasing the profits of edge service providers by 16.25% and 33.33% respectively.", "Pub Date": "2024-01-23"}