{"Title": "CompCube: A Space-Time-Request Resource Trading Framework for Edge-Cloud Service Market", "Doi": "10.1109/TSC.2023.3261553", "Authors": ["x. ren", "c. qiu", "z. chen", "x. wang", "d. niyato", "w. wang"], "Key Words": ["futures-spot resource trading", "dynamic pricing", "request intention conversion", "double auction"], "Abstract": "as the footing stone of artificial intelligence  artificial intelliegence  ubiquitous computing resource is beginning to receive interest. with this trend a new form of edge cloud service market dedicated to collecting trading and scheduling computing resources is rising. the computing participants in the service market as providers and demanders of computing resources are becoming more diversified and open. as such the intriguing economic phenomenon and the circulation mechanism have emerged. these bring inherent challenges such as a volatile market the ossification of pricing isolation and inefficiency. in this article we propose a novel space time request trading framework for the edge cloud service market namely compcube. to ensure stability compcube adopts the dual circulation futures spot trading method including space time dynamic pricing in the macro cycle request intention conversion and resource matching in the micro cycle. among this an incomplete information game model is designed to determine the long term trading pricing in the macro cycle. then to tackle the indicator isolation problem due to the inconsistency between the user requests and the computing power provider  cpp‚äôs  resources we focus on minimizing the rental cost of computing resources while satisfying diverse service level agreements  sla  of users. to address this problem a spatiotemporal scale lyapunov optimization and an alternating actor critic algorithm a2sc are developed. besides in the micro cycle a discriminatory double auction helps to determine the computing resource matching results efficiently and impersonally. we evaluate the compcube of the a2sc algorithm with realistic datasets. compared to other baselines i.e. dyreceive price preferred and random a2sc reduces the average rental cost by 30.45% 5.74% and 17.57% respectively. furthermore compcube can improve sla satisfaction as well as promote resource efficiency and social welfare compared with the traditional methods.", "Pub Date": "2023-10-09"}