{"Title": "Computation Rate Maximization for Wireless-Powered Edge Computing With Multi-User Cooperation", "Doi": "10.1109/OJCOMS.2024.3358064", "Authors": ["y. li", "x. zhang", "b. lei", "q. zhao", "m. wei", "z. qu", "w. wang"], "Key Words": ["mobile edge computing", "multi-user collaboration", "wireless power transfer", "time and data allocation", "deep learning"], "Abstract": "the combination of mobile edge computing  mec  and radio frequency based wireless power transfer  wpt  presents a promising technique for providing sustainable energy supply and computing services at the network edge. this study considers a wireless powered mobile edge computing system that includes a hybrid access point  hap  equipped with a computing unit and multiple internet of things  iot  devices. in particular we propose a novel multi user cooperation scheme to improve computation performance where collaborative clusters are dynamically formed. each collaborative cluster comprises a source device  sd  and an auxiliary device  ad  where the sd can partition the computation task into various segments for local processing offloading to the hap and remote execution by the ad with the assistance of the hap. specifically we aims to maximize the weighted sum computation rate  wscr  of all the iot devices in the network. this involves jointly optimizing collaboration time and data allocation among multiple iot devices and the hap while considering the energy causality property and the minimum data processing requirement of each device. initially an optimization algorithm based on the interior point method is designed for time and data allocation. subsequently a priority based iterative algorithm is developed to search for a near optimal solution to the multi user collaboration scheme. finally a deep learning based approach is devised to further accelerate the algorithm‚äôs operation building upon the initial two algorithms. simulation results show that the performance of the proposed algorithms is comparable to that of the exhaustive search method and the deep learning based algorithm significantly reduces the execution time of the algorithm.", "Pub Date": "2024-02-09"}