{"Title": "Comparative study on the effect of HSV Segmentation and ORB Features on Transfer Learning models for recognition of Bharatanatyam Asamyukta Mudras", "Doi": "10.1109/CICTN57981.2023.10141169", "Authors": ["d. kilari", "k. k. singh"], "Key Words": ["bharatanatyam", "mudra", "transfer learning", "neural network", "image processing", "orb", "hsv"], "Abstract": "bharatanatyam is a classical dance form that originated in the state of tamil nadu india and is widely recognized for its intricate hand gestures body movements facial expressions and background music. it is a vibrant and colorful dance style that has been passed down from generation to generation and its popularity has only grown over the years. one of the unique aspects of bharatanatyam is its use of hand gestures or mudras which are essential in telling a story through the dance. these gestures are symbolic and each mudra has a specific meaning. however due to their complex nature it can be challenging for the untrained eye to understand their significance. to address this issue researchers have recently generated a dataset of bharatanatyam hand gestures and explored ways to recognize them using transfer learning techniques. the dataset consists of 28 classes of single hand gestures used in bharatanatyam to convey a story. in this study four transfer learning models were used to classify the images into 24 different classes  vgg16 vgg19 mobilenet and resnet 50. transfer learning is a machine learning technique that uses pre trained models to accelerate the learning process for a new task. it involves using a model that has been trained on a large dataset and then fine tuning it to recognize a new set of images. the results of the study showed that deep learning algorithms achieved up to 74% accuracy in recognizing the hand gestures. this is a promising result as it demonstrates that transfer learning techniques can be effective in recognizing bharatanatyam hand gestures.the hand gestures were segmented using the hsv model which is a color space model that separates image color information into hue saturation and value components. features were then extracted using the orb model which is a feature extraction technique that detects and describes key points in an image. the study found that when hand mudras were segmented and extracted in this manner the accuracy of hand gesture recognition improved. in particular the resnet  50 model performed better than the other transfer models vgg16 vgg19 and mobilenet. this study is the first attempt to generate a dataset of bharatanatyam hand gestures and apply transfer learning techniques to recognize them. it highlights the potential of these techniques in preserving and promoting the rich cultural heritage of indian classical dance. by making bharatanatyam more accessible and understandable to a wider audience this study could help to increase appreciation and understanding of this ancient art form. it could also lead to the development of tools and applications that make it easier for people to learn and perform bharatanatyam. in conclusion the use of transfer learning techniques in recognizing bharatanatyam hand gestures is a promising development. it could have far reaching implications for the preservation and promotion of indian classical dance and it could help to ensure that this beautiful art form continues to be enjoyed for generations to come.", "Pub Date": "2023-06-07"}