{"Title": "Compact Quantum Circuit Design of PUFFIN and PRINT Lightweight Ciphers for Quantum Key Recovery Attack", "Authors": ["s. paramasivam", "j. jenitha", "s. sanjana", "m. haghparast"], "Pub Date": "2023-07-10", "Abstract": "quantum computing plays a vital role in the next generation computing platforms as researchers have achieved quantum supremacy by proving that quantum computers can outperform classical computers. these high performance computers will pose a serious threat to the security of the conventional cryptographic algorithms. the secret key of the conventional cryptographic algorithms when implemented by quantum circuits can be recovered easily with the help of grover key search algorithm. the grover‚äôs algorithm requires low cost quantum implementation of cryptographic algorithms in order to mount the quantum key recovery attack successfully. hence the low cost quantum implementation of conventional cryptographic algorithms to mount quantum key recovery attack using grover search algorithm is an active area of research. for the first time in literature this work proposes a novel quantum circuit implementation of two lightweight block ciphers namely puffin and print. inplace method is used to optimize the quantum resources in these two ciphers which helps to build compact quantum circuits without extra ancilla inputs. the performance metrics considered in this work to quantify the quantum resources of the proposed circuits are number of quantum gates quantum cost latency and number of qubits. in addition the quantum resources are also estimated to mount the quantum key recovery attacks on the proposed quantum circuit implementations of puffin and print using grover based key search algorithm.", "Doi": "10.1109/ACCESS.2023.3289764", "Key Words": ["cryptography", "grover‚äôs search algorithm", "lightweight cipher", "puffin", "print", "quantum computing", "quantum circuit", "quantum cost", "quantum key recovery attack"]}