{"Title": "Configurable Harris Hawks Optimisation for Application Placement in Space-Air-Ground Integrated Networks", "Doi": "10.1109/TNSM.2024.3361176", "Authors": ["n. akhter", "r. mahmud", "j. jin", "j. but", "i. ahmad", "y. xiang"], "Key Words": ["application placement", "harris hawks optimisation (hho)", "space-air-ground integrated network (sagin)"], "Abstract": "space air ground integrated network  sagin  has recently emerged as a viable solution for reliable transmission high data rates and seamless connectivity with extensive coverage. however the characteristics of the computation and communication devices located at various levels of sagin make application placement within such environments a challenging task. real time service expectations and resource requirements of applications further intensify this issue and push the domain to operate beyond its capacity resulting in uneven delays and significant overhead. taking these constraints into account sagin‚äôs application placement problem can be expressed as a multiobjective optimisation problem. this paper aims to solve such a problem using a dynamic weight configurable harris hawks optimisation  dw hho  algorithm considering diverse application contexts such as deadlines resource usage and the number of application activities. it simultaneously minimises application total service time and host resource overhead with a robust global search. the performance of the proposed solution is compared with benchmark metaheuristic solutions such as pso nsga ii greedy and random. experimental results demonstrate that dw hho outperforms other benchmark metaheuristic solutions in optimising resource utilisation and service delivery time of applications in sagin environments. the proposed dw hho demonstrates notable improvements over existing methods. specifically when evaluating the total service time for pso nsga ii greedy and random dw hho outperforms these methods by 7.28% 9.07% 13.01% and 14.97% respectively.", "Pub Date": "2024-04-15"}