{"Title": "Constrained Federated Learning for AoI-Limited SFC in UAV-Aided MEC for Smart Agriculture", "Doi": "10.1109/TMLCN.2023.3311749", "Authors": ["m. akbari", "a. syed", "w. s. kennedy", "m. erol-kantarci"], "Key Words": ["internet of things", "network function virtualization", "age of information", "uav-aided mobile edge computing (uav-aided mec)", "constraint mdp", "federated reinforcement learning"], "Abstract": "for a wide range of smart agriculture use cases the prospects of utilizing the internet of things  iot  are immense. many iot devices can be deployed for precision farming soil management automated irritation information gathering or performing some local processing to provide various services. due to the computational capacity limitation of iot devices and their limited power uav aided mobile edge computing  mec  is proposed to provide iot nodes with additional resources by hosting their computation functions and making smart agriculture use cases more operational. on the other hand from the implementation viewpoint network function virtualization  nfv  is an emerging approach recently proposed for flexible management of such computation functions in uavs and mec server. however efficient orchestration of the virtualized functions is a challenge. in this paper we consider a decentralized uav aided mec system in which the nfv enabled processing nodes manage the computational tasks. to be more specific we consider the smart agriculture use cases that need live streaming analysis such as surveillance or environmental monitoring. in such a network we propose a method for orchestrating the nfvs efficiently while the network energy consumption throughout the network is minimized. this problem becomes even more crucial when considering a strict condition on the instantaneous aoi values. therefore the problem is first formulated as a decentralized constrained multi agent markov decision process  dec cmmdp . as the formulated problem is nexp in the next step we exploit some structural features of the considered network and introduce the concept of symmetry to simplify the problem. then inspired by augmented lagrangian dual optimization a novel decentralized federated learning based solution is proposed to solve the problem. simulation results show the effectiveness of the proposed approach in minimizing the total network energy consumption minimizing the average aoi and satisfying the strict condition of aoi  $ < 100$  msec for supporting real time applications in our network parameter settings.", "Pub Date": "2023-10-09"}