{"Title": "Continuous Blood Pressure Monitoring Using Nonpulsatile Photoplethysmographic Components for Low-Frequency Vascular Unloading", "Authors": ["t. panula", "j. -p. sirki√§", "m. kaisti"], "Pub Date": "2023-05-05", "Abstract": "continuous blood pressure  bp  monitoring gives a better understanding of a person‚äôs cardiovascular health status than single bp measurements. the existing measurement techniques are often highly complex and expensive or suffer from inaccuracies. we propose a simple yet effective technique for continuous bp monitoring. our method is based on the finding that the nonpulsatile  dc  component of the photoplethysmograph  ppg  correlates with bp. by keeping the infrared  ir  ppg dc component constant by altering the applied external pressure using a feedback mechanism the bp can be measured continuously. this way the pressure reading from the pressure sensor follows the mean intraarterial bp. we call this low frequency vascular unloading. we propose a method for assessing the measurement error introduced by changes in vasomotor tone. green ppg was used for the vasomotor compensation method. we packaged the technology into a wearable finger worn device similar to a pulse oximeter probe. we measured over 90 min of continuous bp data from a total of seven subjects. the subjects were asked to perform different bp altering maneuvers during the measurement. the ability to track bp changes was verified by continuous mean arterial pressure  map  readings measured with the reference device  cnsystems cnap 500  and our device resulting in the correlation of  $r=0.894$  and [ $ \\text {mean} \\pm \\text {sd} $  mmhg] of  $ 0.3 \\pm 4.3 $  mmhg for map. without vasomotor tone compensation  vmc  the results were slightly less accurate   $r=0.83$   $  1.4 \\pm 5.1 $  mmhg. the proposed technology performed well compared to the traditional vascular unloading technique  vut  while requiring significantly less complex control logic and no fast switching pneumatics. the proposed technique is a simple yet effective low cost solution and it can be constructed from off the shelf components and miniaturized into a wearable form factor. the technique has potential in the field of health wearables and remote continuous bp monitoring for personalized health applications.", "Doi": "10.1109/TIM.2023.3267378", "Key Words": ["biomedical monitoring", "hypertension", "medical instruments", "photoplethysmography", "pressure sensors"]}