{"Title": "CooCo: A Collaborative Offloading and Resource Configuration Algorithm in Edge Networks", "Doi": "10.1109/JIOT.2023.3327392", "Authors": ["x. zhao", "j. zhang", "j. zhang", "p. yuan", "h. jin", "x. li"], "Key Words": ["collaborative edge computing (ec)", "distributed alternating direction multiplier method (admm)", "network delay", "resource allocation", "system energy consumption"], "Abstract": "when offloading computing tasks of sensory data to the edge network it is necessary to consider whether the idle resources such as cpu frequency and memory meet the task processing requirements. however even if edge collaboration is used to improve offloading performance most studies assume homogeneity in hardware configuration across all edge servers discarding the impact of the differentiated resource allocation among heterogeneous edge servers. therefore resource allocation and offloading decisions in a collaborative heterogeneous edge network are comprehensively considered in this study. first the offloading problem of heterogeneous edge servers is expressed as a joint optimization problem associated with delay and energy consumption constrained by cpu frequency and storage resources. second dynamic collaboration clusters are constructed based on distance position and workload correlation to identify distinct collaboration regions and balance the load within edge servers. and then a distributed alternating direction multiplier method  admm  based on constraint projection and variable splitting is proposed to solve the optimization problem. additionally a cooperative path selection algorithm which takes into account length and throughput of return paths is proposed to alleviate network congestion and minimize energy consumption loss. finally the proposed algorithm for collaborative offloading and resource configuration  cooco  is demonstrated to be effective and rapidly converging based on a real data set from shanghai telecom. the simulation results also show that compared to the distributed resource allocation optimization algorithm no cooperation single hop and other state of the art collaborative algorithm cooco can significantly reduce the sum of the system costs by 26% 35%11% and 8% respectively.", "Pub Date": "2024-03-08"}