{"Title": "Cooperative UAV Resource Allocation and Task Offloading in Hierarchical Aerial Computing Systems: A MAPPO-Based Approach", "Doi": "10.1109/JIOT.2023.3240173", "Authors": ["h. kang", "x. chang", "j. mi≈°iƒá", "v. b. mi≈°iƒá", "j. fan", "y. liu"], "Key Words": ["hierarchical aerial computing", "multiagent proximal policy optimization (mappo)", "multidimensional resource allocation", "task offloading"], "Abstract": "this article investigates a hierarchical aerial computing system where both high altitude platforms  haps  and unmanned aerial vehicles  uavs  provision computation services for ground devices  gds . different from the existing works which ignored uav task offloading to haps and suffered long transmission delay between haps and gds in our system uavs are responsible for collecting the tasks generated by gds. considering limited resources and constrained coverage uavs need to cooperatively allocate their resources  including spectrum caching and computing  to gds. after collecting gd tasks uavs are allowed to offload part of these tasks to the hap in order to minimize task processing delay and then better satisfy gd delay requirement. our objective is to maximize the amount of computed tasks while satisfying tasks‚äô heterogeneous quality of service  qos  requirements through the joint optimization of uav resource allocation and task offloading. to this end a joint optimization problem is first formulated as a partially observable markov decision process  pomdp  under the constraints of available resources uav energy and collision avoidance. then we design a multiagent proximal policy optimization  mappo  based algorithm to solve the optimization problem. by introducing the centralized training with decentralized execution framework uavs acting as agents can cooperatively make decisions on gds association resource allocation and task offloading according to their local observations. in addition state normalization and action mask are also adopted to improve training efficiency. experimental results verify the efficiency of the proposed algorithm and the system performance is also analyzed by the numerical results.", "Pub Date": "2023-06-01"}