{"Title": "CoopEdge+: Enabling Decentralized, Secure and Cooperative Multi-Access Edge Computing Based on Blockchain", "Doi": "10.1109/TPDS.2022.3231296", "Authors": ["l. yuan", "q. he", "s. tan", "b. li", "j. yu", "f. chen", "y. yang"], "Key Words": ["blockchain", "cooperative multi-access edge computing", "distributed consensus", "multi-access edge computing", "peer offloading"], "Abstract": "multi access edge computing  mec  has emerged as a new distributed computing paradigm for its ability to offer low latency services to users. suffering from constrained computational resources because of their limited physical sizes edge servers usually cannot handle all the incoming compute tasks on time when they operate independently. thus they need to cooperate by peer offloading. incentive and trust are the two major challenges towards to cooperative computing among edge servers operating in a distrusted environment. another specific challenge in the mec environment is to facilitate incentive and trust in a decentralized manner. this article proposes coopedge+ a novel blockchain based decentralized platform to drive and support cooperative multi access edge computing to tackle these challenges in a systematic manner. on coopedge+ an edge server can publish a compute task for other edge servers to contend for. a winner is selected from candidate edge servers as the task executor based on their reputation to perform the compute task. after that coopedge+ employs a random leader election scheme to elect a task recorder without revealing its leadership until its consensus epoch. the task recorder will coordinate a consensus among edge servers to record the task executor performance on blockchain. we implement coopedge+ based on hyperledger fabric and evaluate it experimentally against a baseline implementation and three state of the art implementations in a simulated mec environment. the results validate the usefulness of coopedge+ and demonstrate its performance.", "Pub Date": "2023-01-26"}