{"Title": "Cooperative Beamforming With Artificial Noise Injection for Physical-Layer Security", "Authors": ["g. jang", "d. kim", "i. -h. lee", "h. jung"], "Pub Date": "2023-03-09", "Abstract": "in the sixth generation  6g  communications how to deploy and manage massively connected internet of things  iot  nodes will be one of the key technical challenges because 6g is expected to provide 10 times higher connection compared to 5g. at the same time due to the sharp growth in connected devices and newly adopted technologies learning based attacks and big data breaches are expected to occur more frequently. with the advances of quantum computing in the future conventional cryptography based security protocols may be obsolete in the future wireless networks which makes physical layer security  pls  an attractive alternative or complement for secure communications. in this context cooperative beamforming  cb  based pls schemes are known to be effective solutions to guarantee high secrecy rate with iot devices which have limited power and hardware complexity. however the existing cb based pls algorithms suffer from extremely low secrecy rate in case that eavesdroppers are close to the intended receiver. to overcome such critical issue in this paper we propose a cb based pls with artificial noise  an  injection which can be realized in a fully distributed manner to minimize the overhead in the iot networks with a large number of devices. we analyze the array factor using the virtual antenna array  vaa  created by the proposed pls algorithm. then the secrecy rate is derived in a closed form expression which can be used to optimize the performance for given system parameters in both the absence and presence of channel state information  csi  error. the proposed scheme provides considerably higher secrecy rate compared to the conventional cb based pls schemes when an eavesdropper exists near to the intended receiver. furthermore through simulation and numerical results we show that the secrecy rate of the proposed scheme can be maximized by adjusting the ratio between the data beamformer and an injection beamformer components. as a result the proposed method shows a performance improvement of up to two times compared to the conventional cb based pls schemes in terms of the secrecy rate. such performance gain increases as the angular location of eve becomes closer to that of bob which corresponds to the most vulnerable situation of the conventional cb based pls algorithms.", "Doi": "10.1109/ACCESS.2023.3252503", "Key Words": ["physical layer security", "distributed beamforming", "cooperative beamforming", "artificial noise"]}