{"Title": "Cooperative Resource Management in Quantum Key Distribution (QKD) Networks for Semantic Communication", "Authors": ["r. kaewpuang", "m. xu", "w. y. b. lim", "d. niyato", "h. yu", "j. kang", "x. shen"], "Pub Date": "2024-01-24", "Abstract": "the increasing focus on privacy and security in 6g networks which are intelligence native necessitates the use of quantum key distribution secured semantic information communication  qkd sic  to protect confidential data. in qkd sic systems edge devices connected via quantum channels can efficiently encrypt semantic information from the semantic source and securely transmit the encrypted semantic information to the semantic destination. in this article we consider an efficient resource  i.e. quantum key distribution  qkd  and km wavelengths  sharing problem to support qkd sic systems under the uncertainty of semantic information generated by edge devices. in such a system qkd service providers offer qkd services with different subscription options to the edge devices. the qkd services are envisioned to follow cloud computing that has the subscription in the reservation and on demand options i.e. for long and short  immediate  terms respectively. as such to reduce the cost for the edge device users we propose a qkd resource management framework for the edge devices communicating semantic information. the framework is based on a two stage stochastic optimization model to achieve optimal qkd deployment. moreover to reduce the deployment cost of qkd service providers qkd resources in the proposed framework can be utilized based on efficient qkd sic resource management including semantic information transmission among edge devices secret key provisioning and cooperation formation among qkd service providers. in detail the formulated two stage stochastic optimization model can achieve the optimal qkd sic resource deployment while meeting the secret key requirements for semantic information transmission of edge devices. moreover to share the cost of the qkd resource pool among cooperative qkd service providers forming a coalition in a fair and interpretable manner the proposed framework leverages the concept of shapley value from cooperative game theory as a solution. experimental results demonstrate that the proposed framework can reduce the deployment cost by about 40% compared with existing noncooperative baselines.", "Doi": "10.1109/JIOT.2023.3301033", "Key Words": ["cooperative resource management (crm)", "game theory", "quantum key distribution (qkd)", "semantic information communication (sic)", "stochastic programming (sp)"]}