{"Title": "Correlation-Diversified Portfolio Construction by Finding Maximum Independent Set in Large-Scale Market Graph", "Authors": ["r. hidaka", "y. hamakawa", "j. nakayama", "k. tatsumura"], "Pub Date": "2023-12-22", "Abstract": "correlation diversified portfolios can be constructed by finding the maximum independent sets  miss  in market graphs with edges corresponding to correlations between two stocks. the computational complexity of finding the mis increases exponentially as the size of the market graph increases making the mis selection in a large scale market graph difficult. here we construct a diversified portfolio through solving the mis problem for a large scale market graph with a combinatorial optimization solver  an ising machine  based on a quantum inspired algorithm called simulated bifurcation  sb  and investigate the investment performance of the constructed portfolio using long term historical market data at the tokyo stock exchange. comparisons using stock universes of various sizes  topix 100 nikkei 225 topix 1000 and topix which includes approximately 2000 constituents  show that the sb based solver outperforms conventional mis solvers in terms of computation time and solution accuracy. by using the sb based solver we optimized the parameters of a mis portfolio strategy through iteration of the backcast simulation that calculates the performance of the mis portfolio strategy based on a large scale universe covering more than 1700 japanese stocks for a long period of 10 years. it has been found that the best mis portfolio strategy  sharpe ratio = 1.16 annualized return risk = 16.3%/14.0%  outperforms the major indices such as topix  0.66 10.0%/15.2%  and msci japan minimum volatility index  0.64 7.7%/12.1%  for the period from 2013 to 2023. factor analyses reveal that the selection of small capitalization and low correlation stocks results in the portfolio performance with not only the relatively low risk  the diversification effect as expected  but also the relatively high return.", "Doi": "10.1109/ACCESS.2023.3341422", "Key Words": ["portfolio construction", "market graph", "maximum independent set", "combinatorial optimization", "fpga", "ising machine", "simulated bifurcation", "quantum-inspired"]}