{"Title": "CorrectNet+: Dealing With HW Non-Idealities in In-Memory-Computing Platforms by Error Suppression and Compensation", "Authors": ["a. eldebiky", "g. l. zhang", "g. b√∂cherer", "b. li", "u. schlichtmann"], "Pub Date": "2024-01-19", "Abstract": "the last decade has witnessed the breakthrough of deep neural networks  dnns  in many fields. with the increasing depth of dnns hundreds of millions of multiply and accumulate  mac  operations need to be executed. to accelerate such operations efficiently analog in memory computing platforms based on emerging devices e.g. resistive ram  rram  have been introduced. these acceleration platforms rely on analog properties of the devices and thus suffer from process variations. consequently weights in neural networks configured into these platforms can deviate from the nominal trained values which may lead to feature errors and a significant degradation of the inference accuracy. besides additional hw aspects represent key controlling factors for such computing platforms namely the limited rram cell programmable conductance levels which limits the number of bits stored in one rram cell the adc noise converting analog values to digital domain and the adc power scaling with the number of bits of its output. to address these points in this article we propose a framework to enhance the robustness of neural networks under variations. first an enhanced lipschitz constant regularization is adopted during neural network training to suppress the amplification of errors propagated through network layers. additionally the quantization setting of a nn model is optimized considering robustness against weight variations and total adc power consumption. afterward error compensation is introduced at necessary locations determined by reinforcement learning  rl  to rescue the feature maps with remaining errors. experimental results demonstrate that inference accuracy of neural networks can be recovered from as low as 1.69% under variations back to more than 95% of their original accuracy at the highest level of variations and reducing total adc power consumption by 55% while the training and hardware cost are negligible.", "Doi": "10.1109/TCAD.2023.3313089", "Key Words": ["emerging devices", "error correction", "in-memory computing", "neural networks robustness", "neuromorphic computing", "rram crossbars", "variations and non-idealities"]}