{"Title": "Cost-Effective Data Placement in Edge Storage Systems With Erasure Code", "Doi": "10.1109/TSC.2022.3152849", "Authors": ["h. jin", "r. luo", "q. he", "s. wu", "z. zeng", "x. xia"], "Key Words": ["edge computing", "erasure code", "data placement", "approximation algorithm"], "Abstract": "edge computing as a new computing paradigm brings cloud computing‚äôs computing and storage capacities to network edge for providing low latency services for users. the networked edge servers in a specific area constitute edge storage systems  esss  where popular data can be stored to serve the users in the area. the novel esss raise many new opportunities as well as unprecedented challenges. most existing studies of esss focus on the storage of data replicas in the system to ensure low data retrieval latency for users. however replica based edge storage strategies can easily incur high storage costs. it is not cost effective to store massive replicas of large size data especially those that do not require real time access at the edge e.g. system upgrade files popular app installation files videos in online games. it may not even be possible due to the constrained storage resources on edge servers. in this article we make the first attempt to investigate the use of erasure codes in cost effective data storage at the edge. the focus is to find the optimal strategy for placing coded data blocks on the edge servers in an ess aiming to minimize the storage cost while serving all the users in the system. we first model this novel erasure coding based edge data placement  ec edp  problem as an integer linear programming problem and prove its $\\mathcal {np}$np hardness. then we propose an optimal approach named ec edp o based on integer programming. another approximation algorithm named ec edp v is proposed to address the high computation complexity of large scale ec edp scenarios efficiently. the extensive experimental results demonstrate that ec edp o and ec edp v can save an average of 68.58%  and up to 81.16% in large scale scenarios  storage cost compared with replica based storage approaches.", "Pub Date": "2023-04-07"}