{"Title": "CoTEV: Trustworthy and Cooperative Task Execution in Internet of Vehicles", "Doi": "10.1109/TMC.2023.3267602", "Authors": ["s. pratap", "p. dass", "s. misra"], "Key Words": ["coalitional game", "iov", "cooperative game", "trust", "task offloading", "task execution"], "Abstract": "due to the increasing number of service requests from the vehicles the load at the road side units  rsus  increases which affects the delay sensitive vehicle services. in internet of vehicles  iov  the vehicles can communicate directly with other vehicles and take help from the vehicles to cooperatively accomplish a task. however it is very challenging to cooperatively execute a task in an iov environment with high traffic and dynamic vehicle movements. furthermore it is difficult for a task vehicle to choose trustworthy and cooperative vehicles. in this article we propose algorithms for cooperative task execution by taking the help of trusted vehicles when it is not possible to complete a deadline specified task through the rsus. we propose a hedonic coalition formation game based approach to form distributed coalitions of cooperative vehicles. we consider the trust score of the vehicles along with their computational capabilities and journey routes. after each task execution the service feedback is reflected in the trust score of each cooperative vehicle in the coalition. our proposed algorithms allow the cooperative vehicles to autonomously choose the coalitions and select vehicle tasks to maximize their payoffs. to satisfy the task deadlines in multiple coalitions we design the merging of vehicle coalitions. we consider the simulation of urban mobility  sumo  tool to generate the mobility traces of the vehicles in a real road network of berlin city which considers the traffic junctions and vehicle density on the roads. through extensive simulations we show that the proposed algorithms significantly increase the service rate of delay sensitive task requests by at least $30.5 \\%$30.5% and the trust score by at least $20.61 \\%$20.61% compared to the benchmark schemes.", "Pub Date": "2024-03-07"}