{"Title": "CPU‚ÄìGPU Heterogeneous Computation Offloading and Resource Allocation Scheme for Industrial Internet of Things", "Doi": "10.1109/JIOT.2023.3332748", "Authors": ["z. he", "y. sun", "b. wang", "s. li", "b. zhang"], "Key Words": ["cpu‚äìgpu", "dynamic resource allocation", "heterogeneous computing", "multiaccess edge computing (mec)", "task offloading"], "Abstract": "the computing process of tasks in industrial internet of things  iiot  environments is becoming increasingly complex due to the development of 5g and artificial intelligence. leading devices are increasingly relying on heterogeneous platforms that integrate different types of processing units such as cpus gpus and other resources to meet the requirements of delay sensitive and computing intensive tasks. however compared to conventional general proposed cpu computing cpu‚äìgpu heterogeneous computing typically involves three processes i.e. task preprocessing hybrid computing and result aggregation. these processes are associated with particular computing resources which increases the difficulty of task offloading and computing resource allocation under task specific resource and delay constraints. in this article we first propose a three stage heterogeneous computing  tshc  model to practically describe the computing process of parallelizable tasks. considering the heterogeneous computing resources device queue backlogs and collaboration of multiple edge servers the joint task offloading and heterogeneous resource allocation  jcohra  problem is formulated to minimize the long term average delay of tasks. then the lyapunov optimization method is adopted to simplify the long term queue stability constraint to a single slot dynamic optimization problem which is then modeled as a markov decision process  mdp . owing to the tight coupling between decision variables and enormous action space we propose the multihead proximal policy optimization  mh ppo  based jcohra algorithm which is enabled by elaborate constraint transformation and reward function design. simulation results demonstrate that the jcohra scheme achieves better performance than baseline methods in minimizing the long term average delay of tasks.", "Pub Date": "2024-03-08"}