{"Title": "Cross-System Data Integration Based on Rule-Based NLP and Node2Vec", "Doi": "10.1109/DSC59305.2023.00088", "Authors": ["j. xiao", "w. dut", "z. xu", "y. qian"], "Key Words": ["data integration", "nlp", "graph embedding", "electricity industry", "computing methodologies", "artificial intelligence", "naturallanguage processing", "information extraction", "computing methodologies", "machine learning", "machine learning approaches", "learning latent representations"], "Abstract": "in the era of big data a growing number of enterprises are paying attention to data governance and data services. large enterprises  e.g. state grid corporations  have numerous information systems which have caused issues such as inconsistent data standards and different data storage methods. this makes it very difficult to share data information among different enterprises and departments. in this situation enterprises have begin to use various methods to integrate data across different systems. in this study we select the power industry and design a cross system data fusion framework. specifically there are many types of power grid equipment and the topology data equipment data and operation data associated with them are stored in different ways. for cross system data we first use equipment name information and design a ruled based natural language processing  nlp  technique to match the same data between different systems. however the equipment names in different systems do not follow a strict and unified naming standard which leads to a set of equipment nodes that cannot be accurately matched. to solve this issue we use network structure information about equipment and design a node representation technique based on node2vec. based on the node representation we further optimize the results of equipment matching. for evaluation we use a cross system dataset from a state grid corporation in china. through experiments we show that the proposed framework performs very well in cross system data integration.", "Pub Date": "2024-01-08"}