{"Title": "Cross-Layer Alignment Network With Norm Constraints for Fault Diagnosis Under Varying Working Conditions", "Authors": ["x. yang", "x. yuan", "t. ye", "q. xu", "y. song", "j. jin"], "Pub Date": "2023-09-22", "Abstract": "the changes in rotating speed and load of mechanical systems cause the varying working conditions of gearboxes or bearings so deep learning based fault diagnosis models face inconsistent distribution of training and test sets resulting in a great reduction in diagnosis accuracy. to solve this problem various effective transfer learning based fault diagnosis methods are proposed in the literature  however the majority of current works still suffer the following drawbacks  first they usually align the distribution at the same level layer of the parameter shared feature extractor but in fact the same level fault features may distribute in different level layers of the feature extraction network. second the model trained under supervised information of the source domain cannot guarantee discriminability for the target domain samples. to address the above issues a novel unsupervised adaptive cross layer alignment network with norm constraints  aclan nc  framework is developed in this article which aligns the same level fault features among the same level and different level model layers. by using those cross layer pairs we can align the fault features at a fine grained level and reduce inappropriate knowledge transfer. the batch nuclear norm minimization and maximization technique is moreover used to restrict the prediction output of the source domain and target domain ensuring the discriminability and diversity of the model. to demonstrate the effectiveness of aclan nc for fault diagnosis under varying working conditions extensive experiments are conducted to manifest the superior performance of our proposed aclan nc framework.", "Doi": "10.1109/TIM.2023.3312751", "Key Words": ["batch nuclear norm", "cross-layer alignment", "intelligent fault diagnosis (ifd)", "unsupervised domain adaptation (uda)", "varying working conditions"]}