{"Title": "Cryogenic In-Memory Computing for Quantum Processors Using Commercial 5-nm FinFETs", "Authors": ["s. s. parihar", "s. thomann", "g. pahwa", "y. s. chauhan", "h. amrouch"], "Pub Date": "2023-09-19", "Abstract": "cryogenic cmos circuits that efficiently connect the classical domain with the quantum world are the cornerstone in bringing large scale quantum processors to reality. the major challenges are however the tight power budget  in the order of milliwatts  and small latency  in the order of microseconds  requirements that such circuits inevitably must fulfill when operating at cryogenic temperatures. in memory computing  imc  is rapidly emerging as an attractive paradigm that holds the promise of performing computations efficiently where the data does not need to move back and forth between the cpu and the memory. hence it overcomes the fundamental bottleneck in classical von neumann architectures which provides considerable savings in power and latency. in this work for the first time we propose and implement an end to end approach that investigates sram based imc for cryogenic cmos. to achieve that we first characterize commercial 5 nm finfets from 300 k down to 10 k. then we employ the first cryogenic aware industry standard compact model for the finfet technology  bsim cmg  to empower spice to accurately capture how cryogenic temperatures alter the electrical characteristics of transistors  e.g. threshold voltage carrier mobility sub threshold slope etc. . our key contributions span from  1  carefully calibrating the cryogenic aware bsim cmg against commercial 5 nm finfet measurements in which spice simulations come with an excellent agreement with the experimental data  2  exploring how the robustness of sram cells against noise  during the hold read and write operations  changes at extremely low temperatures  3  investigating how the behavior of sram based imc circuits changes at 10 k compared to 300 k and  4  modeling the error probabilities of imc circuits that are used to calculate the hamming distance which is one of the essential similarity calculations to perform classifications.", "Doi": "10.1109/OJCAS.2023.3309478", "Key Words": ["modeling", "in-memory computing"]}