{"Title": "CTLE-Ising: A Continuous-Time Latch-Based Ising Machine Featuring One-Shot Fully Parallel Spin Updates and Equalization of Spin States", "Authors": ["j. bae", "w. oh", "j. koo", "c. yu", "b. kim"], "Pub Date": "2023-12-28", "Abstract": "recently hardware accelerators based on the ising model have gained ever increasing interest by demonstrating their capabilities of solving complex decision and optimization problems that are intractable using classical computers [cpus graphics processing units  gpus ]. the problems are translated into combinatorial optimization problems  cops  and mapped to the ising machine comprised of artificial spins interacting and naturally finding their optimal states. recent discrete time ising machines operating at room temperatures have demonstrated solving small scale cops while consuming orders of magnitude lower energy than prior quantum annealers  however they have several limitations due to their discrete time operations bulky spins and lack of compact random number generators. in this work we propose a novel ising machine with compact latch based spin circuits operating in a continuous time. the proposed continuous time ising machine finds solutions to cops with fully parallel spin operations  couplings between latches  significantly reducing computing latency and energy consumption. besides the latch based spins randomize or superpose their initial spin states to find better solutions with the lower ising hamiltonian  i.e. a key performance indicator  kpi  of the ising machine . a  $a 0.656 0.680$  mm2 test chip with a  $a 40 36$  latch based spin array is fabricated using a 65 nm cmos process. the proposed continuous time latch based spin with equalization  ctle  ising achieves  $1000\\times $  speedup compared to the discrete time ising machine operating at 1 ghz when solving max cut cops while consuming 0.2‚äì3 nj using 0.75‚äì1.05 v core supply voltage.", "Doi": "10.1109/JSSC.2023.3318586", "Key Words": ["cmos latch", "combinatorial optimization problems (cops)", "continuous-time operation", "ising hamiltonian", "ising model", "max-cut problem", "time-to-solution (tts)"]}