{"Title": "DAKRS: Domain Adaptive Knowledge-Based Retrieval System for Natural Language-Based Vehicle Retrieval", "Doi": "10.1109/ACCESS.2023.3260149", "Authors": ["s. v. -u. ha", "h. d. -a. le", "q. q. -v. nguyen", "n. m. chung"], "Key Words": ["contrastive representation learning", "text-to-image retrieval", "vehicle retrieval", "semi-supervised learning", "domain adaptation", "background subtraction"], "Abstract": "given natural language  nl  text descriptions nl based vehicle retrieval aims to extract target vehicles from a multi view multi camera traffic video pool. solutions to the problem have been challenged by not only inherent distinctions between textual and visual domains but also by the complexities of the high dimensionality of visual data the diverse range of textual descriptions a major lack of high volume datasets in this relatively new field alongside prominently large domain gaps between training and test sets. to deal with these issues existing approaches have advocated computationally expensive models to separately extract the subspaces of language and vision before blending them into the same shared representation space. through our proposed domain adaptive knowledge based retrieval system  dakrs  we show that by taking advantage of multi modal information in a pretrained model we can better focus on training robust representations in the shared space of limited labels rather than on robust extraction of uni modal representations that comes with increased computational burdens. our contributions are threefold   i  an efficient extension of contrastive language image pre training  clip ‚äôs transfer learning into a baseline text to image multi modular vehicle retrieval framework   ii  a data enhancement method to create pseudo vehicle tracks from the traffic video pool by leveraging the robustness of baseline retrieval model combined with background subtraction  and  iii  a semi supervised domain adaptation  ssda  scheme to engineer pseudo labels for adapting model parameters to the target domain. experimental results are benchmarked on cityflow nl to obtain 63.20% mrr with 150.0 m of parameters illustrating our competitive effectiveness and efficiency against state of the arts without ensembling.", "Pub Date": "2023-08-31"}