{"Title": "Data Integrity Verification in Mobile Edge Computing With Multi-Vendor and Multi-Server", "Doi": "10.1109/TMC.2023.3310532", "Authors": ["y. zhao", "y. qu", "f. chen", "y. xiang", "l. gao"], "Key Words": ["mobile edge computing", "edge data integrity", "smart contract", "corruption localization", "inspection algorithm"], "Abstract": "the emerging mobile edge computing  mec  paradigm reforms the way of data caching by motivating app vendors to store latency sensitive data on distributed edge servers. in volatile mec environments ensuring edge data integrity  edi  is a major concern for app vendors. existing edi solutions only consider the scenario with a single app vendor and multiple edge servers neglecting more complex multi vendor and multi server cases. if multiple app vendors check their data replicas cached on the same edge server simultaneously integrity verification efficiency will drop exponentially. to mitigate this challenge we make the first attempt to develop a smart inspection algorithm  sia  to pre select unreliable data replicas for different app vendors in each verification round by jointly considering cache services‚äô qos  quality of service  and data replicas‚äô unverified time. by implementing this approach edge servers can merely verify the selected data replicas greatly reducing computation and communication overheads in edi verification. theoretically sia can achieve $\\mathcal {o} n $o n  expected time complexity. supported by sia we expand the edi problem in multi vendor and multi server mec environments  referred to as the mvms edi problem  and propose a smart contract based approach entitled mvms sc to tackle the problem efficiently and impartially. we provide a rigorous theoretical analysis of the correctness security and efficiency of mvms sc. both large scale and small scale experiments with real world datasets are correspondingly performed on a single machine and a real platform to validate the superiority of mvms sc in terms of computation and communication efficiencies.", "Pub Date": "2024-04-04"}