{"Title": "Data-Driven Participant Selection and Bandwidth Allocation for Heterogeneous Federated Edge Learning", "Doi": "10.1109/TSMC.2023.3276329", "Authors": ["a. albaseer", "m. abdallah", "a. al-fuqaha", "a. erbad"], "Key Words": ["data diversity", "edge computing", "federated edge learning (feel)", "imbalanced data distribution", "participants‚äô selection", "resource allocation"], "Abstract": "federated edge learning  feel  is a rapidly growing distributed learning technique for next generation wireless edge systems. smart systems across various application domains face challenges such as data heterogeneity limited wireless resources and device heterogeneity which necessitate intelligent participant selection schemes that accelerate convergence rates. consequently this article presents joint participant selection and bandwidth allocation schemes to address these challenges. first we formulate an optimization problem that considers communication and computation latencies as well as imbalanced data distribution while meeting round deadlines and bandwidth constraints. to address the combinatorial problems of participant selection we employ a relaxation method followed by a proposed priority selection algorithm to select near optimal participants. the proposed algorithm initially prioritizes participants with larger datasets effective channel states and better cpu speeds. to address data heterogeneity we propose a randomized deadline controlling algorithm that diversifies updates by allowing the edge server to include different participants with fewer data samples in training rounds. the proposed algorithms offer near optimal performance compared to the brute force method. experiments demonstrate that our proposed scheme accelerates the convergence rate by up to 55% under extensive non iid settings compared to benchmarks. furthermore the deadline controlling algorithm improves performance at high levels of data heterogeneity resulting in faster feel systems.", "Pub Date": "2023-08-17"}