{"Title": "DCNN Model for Automatic Detection of Polyps using UNet", "Doi": "10.1109/ICCCI56745.2023.10128240", "Authors": ["b. devananda rao", "t. bhavana", "t. madhu babu", "l. neha chouhan"], "Key Words": ["colorectal cancer", "polyp", "dcnn", "u-net", "post-processing", "segmentation", "augmentation."], "Abstract": "colon cancer is one of the most common types of malignant cancer. it initially grows as a polyp which is essentially an outgrown from the colon‚äôs surface. thus early detection of polyps and cancers is one of the major goals of endoscopy and colonoscopy. dcnn methodologies based on u net architecture is used so that it could significantly improve the robustness and effectiveness of colorectal cancer screening as well as improve segmentation accuracy lesion detectability and histological characterization accuracy. data augmentation is used to increase the size of our dataset which helps u net to have more information resulting in precise detection. photos of polyps obtained during colonoscopy and endoscopy have non uniform polyp presence uniform colour pattern effect of reflections. this can lead to over and under segmentation. taking these factors into account segmentation method is proposed based on a model of a polyp‚äôs presence which is described as a prominent shape enclosed within a polyp. the existence of edges and valleys can be used to identify an area. to improve polyp detection accuracy post processing methods such as morphological transformations to smooth the segmentation boundaries and combining nearby objects that originally belonged to a large polyp in the output segmentation chart. each pixel is divided into a polyp and non polyp instances. this enables the polyp will be identified more easily quickly and accurately by the clinician. automated polyp segmentation can be beneficial in the creation of a cadx  computer aided diagnosis  system. therefore we are putting forth an efficient u net strategy for dcnn design and approach for automated detection of polyps.", "Pub Date": "2023-05-24"}