{"Title": "Decentralized Scheduling and Dynamic Pricing for Edge Computing: A Mean Field Game Approach", "Doi": "10.1109/TNET.2022.3204698", "Authors": ["x. wang", "j. ye", "j. c. s. lui"], "Key Words": ["edge computing", "decentralized scheduling", "mean field game", "dynamic pricing"], "Abstract": "edge computing provides a platform facilitating edge servers to contribute to computation offloading while economizing their resources. traditional offloading solutions are mostly centralized which are unscalable for large scale edge computing networks due to complex interactions among many edge servers. meanwhile dynamic pricing for an operator is equally if not more important to accommodate users‚äô time varying demands for computing services. in this paper we develop a decentralized online optimization framework to jointly minimize the server‚äôs cost of workload scheduling while maximizing the operator‚äôs utility of service pricing. specifically we employ the mean field game to model the collective scheduling behavior of all edge servers thereby enabling optimal decision making only based on the server‚äôs local information. considering the service price in practice is not adjusted as frequently as the scheduling process we establish a two timescale optimization framework where workload scheduling at a small timescale is tightly embedded into service pricing at a large timescale. using mean field approximation we derive the closed form expression for the minimum scheduling cost and the approximation error is  $o\\left  {\\frac {1}{\\sqrt {m}}}\\right $  which declines as the number of edge servers  $m$  increases. by characterizing the influence of workload scheduling on dynamic pricing we transform the complex service utility maximization into a succinct but equivalent problem and thus we can make use of lyapunov optimization to determine the optimal price over time. extensive evaluations validate the effectiveness and optimality of our scheduling and pricing schemes.", "Pub Date": "2023-06-15"}