{"Title": "Decentralized DNN Task Partitioning and Offloading Control in MEC Systems With Energy Harvesting Devices", "Doi": "10.1109/JSTSP.2022.3221850", "Authors": ["f. wang", "s. cai", "v. k. n. lau"], "Key Words": ["computation offloading", "deep neural network (dnn) inferencing", "energy harvesting", "lyapunov optimization", "multi-access edge computing (mec)", "parametric online learning"], "Abstract": "in this paper we study a decentralized deep neural network  dnn  task partitioning and offloading control problem for a multi access edge computing  mec  system with multiple wireless devices  wds  powered by renewable energy sources. instead of generic computational tasks we focus on the case when the wds and the mec systems are computing dnn inferencing tasks. for each wd we build a virtual local computing cpu workload queue and an energy queue to model the dnn computation dynamics and the battery energy dynamics respectively. we first introduce a new lyapunov function based on the dnn tasks' cumulative execution latency and the total energy consumptions of the entire mec system. using a lyapunov optimization approach the dnn task partitioning and offloading control at the wds are formulated as a lyapunov drift minimization problem. to facilitate a distributed implementation we exploit the linear structure of the cumulative latency and the independency of each wd local computing cpu rate and we decompose the centralized lyapunov drift minimization problem into multiple distributed subproblems each of which is associated with a single wd. next we develop a parametric online learning algorithm such that each sub lyapunov drift minimization problem is solved locally at its associated wd. the proposed solution is completely decentralized in the sense that the sequential offloading and dnn task segmentation control at each wd is determined by its local battery energy queue state information  eqsi  the channel state information  csi  and the dnn inferencing task workload queue state information  tqsi . numerical results reveal that the proposed online learning algorithm can achieve significant performance gain over various state of the art baselines.", "Pub Date": "2023-02-22"}