{"Title": "DeepMist: Toward Deep Learning Assisted Mist Computing Framework for Managing Healthcare Big Data", "Doi": "10.1109/ACCESS.2023.3266374", "Authors": ["s. bebortta", "s. s. tripathy", "s. basheer", "c. l. chowdhary"], "Key Words": ["deep learning", "mist computing", "heart disease prediction", "performance evaluation", "latency", "energy efficiency"], "Abstract": "the prevalence of heart disease has remained a major cause of mortalities across the world and has been challenging for healthcare providers to detect early symptoms of cardiac patients. to this end several conventional machine learning models have gained popularity in providing precise prediction of heart diseases by taking into account the underlying conditions of patients. the drawbacks associated with these methods are a lack of generalization and the convergence rate of these methods being much slower. as the healthcare data associated with these systems scale up leading to healthcare big data issues a cloud fog computing based paradigm is necessary to facilitate low latency and energy efficient computation of the healthcare data. in this paper a deepmist framework is suggested which exploits deep learning models operating over mist computing infrastructure to leverage fast predictive convergence low latency and energy efficiency for smart healthcare systems. we exploit the deep q network  dqn  algorithm for building the prediction model for identifying heart diseases over the mist computing layer. different performance evaluation metrics like precision recall f measure accuracy energy consumption and delay are used to assess the proposed deepmist framework. it provided an overall prediction accuracy of 97.6714% and loss value of 0.3841 along with energy consumption and delay of 32.1002 mj and 2.8002 ms respectively. to validate the efficacy of deepmist we compare its outcomes over the heart disease dataset in convergence with other benchmark models like q reinforcement learning  qrl  and deep reinforcement learning  drl  algorithms and observe that the proposed scheme outperforms all others.", "Pub Date": "2023-05-05"}