{"Title": "Deep Dual-Domain United Guiding Learning With Global‚ÄìLocal Transformer-Convolution U-Net for LDCT Reconstruction", "Authors": ["z. wu", "x. zhong", "t. lyv", "d. wang", "r. chen", "x. yan", "g. coatrieux", "x. ji", "h. yu", "y. chen", "x. mai"], "Pub Date": "2023-11-14", "Abstract": "due to the potential harmful risks caused by the excessive x ray radiation dose low dose has emerged as one of the major rules of computed tomography  ct  for clinical applications. however reducing radiation dose severely leads to degraded reconstructed ct image quality with noises and artifacts and it may seriously hamper clinical diagnosis. currently model driven deep learning  dl  based dual domain learning with expert knowledge can reconstruct ct images from projections acquired in nonideal conditions and they have been demonstrated with inspired performance in low dose ct  ldct  reconstruction. however because of domain progressive strategy these dual domain methods are prone to produce seriously secondary artifacts and suffer from subtle structural degeneration. in this article we propose a novel deep dual domain united guiding learning framework i.e. dugl net. first we put forward a domain guiding strategy. the projection domain network plays the guiding role on image domain network to effectively enhance overall network stability and powerfully avoid secondary artifacts. second we elaborately design a global‚äìlocal transformer convolution u net i.e. gl tcunet as the base network in both projection domain and image domain for reinforcing dual domain model learning. this efficiently leverages the advantages of swin transformer and convolutional neural network  cnn  to suppress noises and artifacts. finally the proposed dugl net is evaluated on the 2016 nih aapm mayo clinic ldct grand challenge dataset and real data and our results validate that the proposed method outperforms the state of the art  sota  competing methods. this efficient accurate and reliable ldct denoising technique has great potential for clinical applications.", "Doi": "10.1109/TIM.2023.3329200", "Key Words": ["convolution neural network", "deep learning (dl)", "dual domain", "low-dose computed tomography (ldct)", "swin transformer"]}