{"Title": "Deep Learning Based Anomaly Detection for Fog-Assisted IoVs Network", "Doi": "10.1109/ACCESS.2023.3246660", "Authors": ["s. yaqoob", "a. hussain", "f. subhan", "g. pappalardo", "m. awais"], "Key Words": ["fog computing", "smooth communication", "internet of vehicles", "anomaly detection", "fog-assisted iovs"], "Abstract": "internet of vehicles  iovs  allows millions of vehicles to be connected and share information for various purposes. the main applications of iovs are traffic management emergency messages delivery e health traffic and temperature monitoring. on the other hand iovs lack in location awareness and geographic distribution which is critical for some iovs applications such as smart traffic lights and information sharing in vehicles. to support these topographies fog computing was proposed as an appealing and novel term which was integrated with iovs to extend storage computation and networking. unfortunately it is also challenged with various security and privacy hazards which is a serious concern of smart cities. therefore we can formulate that fog assisted iovs  fa iovs  are challenged by security threats during information dissemination among mobile nodes. these security threats of fa iovs are considered as anomalies which is a serious concern that needs to be addressed for smooth fa iovs network communication. here smooth communication refers to less risk of important data loss delay communication overhead etc. this research work aims to identify research gaps in the fa iovs network and present a deep learning based dynamic scheme named caadet  convolutional autoencoder aided anomaly detection  to detect anomalies. caadet exploits convolutional layers with a customized autoencoder for useful feature extraction and anomaly detection. performance evaluation of the proposed scheme is done by using the f1 score metric where experiments are carried out by exploiting a benchmark dataset named nsl kdd. caadet also observes the behavior of fog nodes and hidden neurons and selects the best match to reduce false alarms and improve f1 score. the proposed scheme achieved significant improvement over existing schemes for anomaly detection. identified research gaps in fa iovs can give future directions to researchers and attract more attention to this new era.", "Pub Date": "2023-03-01"}