{"Title": "Deep-Deterministic Policy Gradient Based Multi-Resource Allocation in Edge-Cloud System: A Distributed Approach", "Doi": "10.1109/ACCESS.2023.3249153", "Authors": ["a. qadeer", "m. j. lee"], "Key Words": ["edge cloud computing", "wireless networks", "deep deterministic policy gradient", "resource allocation", "smart city", "iot", "beyond 5g", "distributed training", "heuristic priority experience replay"], "Abstract": "edge cloud  ec  empowers the beyond 5g  b5g  wireless networks to cope with large scale and real time traffics of internet of things  iot  by minimizing the latency and providing compute power at the edge of the network. due to a limited amount of resources at the ec compared to the back end cloud  bc  intelligent resource management techniques become imperative. this paper studies the problem of multi resource allocation  mra  in terms of compute and wireless resources in an integrated ec and bc environment. machine learning based approaches are emerging to solve such optimization problems. however it is challenging to adopt traditional discrete action space based methods due to their high dimensionality issue. to this end we propose a deep deterministic policy gradient  ddpg  based temporal feature learning attentional network  tflan  model to address the mra problem. tflan combines convolution gated recurrent unit and attention layers together to mine local and long term temporal information from the task sequences for excellent function approximation. a novel heuristic based priority experience replay  hper  method is formulated to accelerate the convergence speed. further a pruning principle helps the tflan agent to significantly reduce the computational complexity and balance the load among base stations and servers to minimize the rejection rate. lastly data parallelism technique is adopted for distributed training to meet the needs of a high volume of iot traffic in the ec environment. experimental results demonstrate that the distributed training approach suites well to the problem scale and can magnify the speed of the learning process. we validate the proposed framework by comparing with five state of the art rl agents. our proposed agent converges fast and achieves up to 28% and 72% reduction in operational cost and rejection rate and achieves up to 32% gain in the quality of experience on average compared to the most advanced ddpg agent.", "Pub Date": "2023-03-02"}