{"Title": "Deep-Sentiment: An Effective Deep Sentiment Analysis Using a Decision-Based Recurrent Neural Network (D-RNN)", "Doi": "10.1109/ACCESS.2023.3320738", "Authors": ["p. durga", "d. godavarthi"], "Key Words": ["sentiment analysis", "bert-large-cased (blc)", "stochastic gradient descent (sgd)", "bag-of-words (bow)", "deep sentiment analysis (dsa)"], "Abstract": "sentiment analysis is a sub domain in opinion mining that extracts sentiments from the users‚äô opinions from text messages. opinions from e commerce websites blogs online social media etc. and these opinions are in the form of text suggestions and comments. this paper describes the new sentiment analysis model to predict sentiments effectively that can be used to improve product quality and sales. the proposed approach is an integrated model combining several techniques such as the pre trained model bert large cased  blc  for training the dataset. blc model contains 24 layer 1024 hidden 16 heads 340m parameters. optimization algorithms can fine tune pre trained models such as bert for sentiment analysis tasks. fine tuning involves training the pre trained model on a specific sentiment analysis task to improve performance. stochastic gradient descent  sgd  is the optimized algorithm that helps to analyze the sentiments effectively from the given datasets. the next step is the combination of pre processing techniques such as tokenization stop word removal etc. the next step focused on bag of words  bow  and word embedding techniques like word2vec used to extract the features from the datasets. the deep sentiment analysis  dsa  based classification is designed to classify the sentiments based on aspect and priority model to achieve better results. the proposed model combines aspect and priority based sentiment analysis with a decision based recurrent neural network  d rnn . the experiments are conducted using twitter restaurant and laptop datasets available publicly on kaggle‚äîthe proposed model‚äôs performance is analyzed using a confusion matrix. the proposed approach addresses various challenges in analyzing the sentiment analysis. python programming language with several libraries such as keras pandas and others extracts the sentiments from given datasets. the comparison between the existing and proposed models shows the effectiveness of the sentiment outputs.", "Pub Date": "2023-10-09"}