{"Title": "Deep Reinforcement Learning Based Cooperative Partial Task Offloading and Resource Allocation for IIoT Applications", "Doi": "10.1109/TNSE.2022.3167949", "Authors": ["f. zhang", "g. han", "l. liu", "m. mart√≠nez-garc√≠a", "y. peng"], "Key Words": ["cooperative partial offloading", "iiot", "improved soft actor-critic", "resource allocation"], "Abstract": "the industrial internet of things  iiot  has been regarded as one of the pillars supporting the conceptual paradigm of the industry 4.0. compared with traditional cloud computing schemes edge computing provides an effective solution towards easing congestion in backhaul links and core networks while meeting real time security and reliability demands of compute intensive and delay sensitive iiot applications. many existing studies only optimize end edge cloud cooperative task offloading and neglect the optimization of the communication and computation resource allocation. in this paper the cooperative partial task offloading and resource allocation  cptora  framework is designed which jointly considers cooperation among various iiot devices local edge computing servers  ecss  non local ecss and cloud computing servers ‚äì for balancing the workload of the ecss and increasing the resource utilization rate. then considering the complex dynamics and unpredictability in iiot environments the joint optimization problem is modeled as a constrained markov decision process. furthermore we propose an improved soft actor critic based cptora  isac cptora  algorithm able to make task offloading and resource allocation decisions for each iiot device. this algorithm innovatively introduces the idea of distributional reinforcement learning to the soft actor critic which can effectively reduce q value overestimations or underestimations. meanwhile this algorithm employs the prioritized experience replay to enhance its learning efficiency. extensive laboratory experiments indicate that our cptora framework and isac cptora algorithm efficiently decrease the total system costs  i.e. latency costs and energy costs  in contrast to various baseline frameworks and algorithms.", "Pub Date": "2023-09-20"}