{"Title": "Deep Learning and Self-Powered Sensors Enabled Edge Computing Platform for Predicting Microclimate at Urban Blocks", "Doi": "10.1109/JSEN.2022.3210224", "Authors": ["x. geng", "y. zou", "l. meng"], "Key Words": ["climate prediction", "deep learning", "edge computing (ec) platform", "microclimate", "urban blocks"], "Abstract": "with the development of urban construction and the continuous innovation of science and technology the progress of smart cities is imperative. urban local climate prediction is very important in the construction of a smart city but the existing climate prediction methods cannot accurately predict the urban local climate. therefore this work provides accurate climate references for people‚äôs travel and outdoor activities thus improving the accuracy of local climate prediction in the city. first the current situation of climate prediction is discussed and the main indexes of climate prediction and the basic algorithm of climate index prediction are determined. then the deep learning algorithm is introduced and applied to the edge computing  ec  platform and self powered sensors are integrated to predict the microclimate index of urban blocks. using self powered sensors can achieve zero contact work and improve research efficiency. finally experiments are carried out in two sample cities and the prediction results are compared with the actual detection results to verify the performance of the prediction model. the results show that the error value of the microclimate index predicted by the deep learning model under the ec platform is ‚àí6~5 and the climate index with the largest error is the air age. the air age error of city a is about ¬±5 s and that of city b is ‚àí6~4 s. the practice has proved that deep learning technology has achieved ideal results in the microclimate index prediction of urban blocks on the ec platform and is practical. this work provides technical support for the prediction of urban block climate indicators and helps to improve the accuracy of climate prediction. note to practitioners‚äîin this work we have tested the microclimate using a lot of different kinds of sensors and collected massive temperature data using these sensors. due to our carelessness the temperature data in this article was from an air temperature sensor instead of a black globe temperature sensor which lead to the missing and error of the raw data for the radiant temperature in the prediction model. the deep learning model in this article will be trained and tested based on the collected temperature data to obtain the optimal parameters so that the microclimate prediction model will be incorrect or inaccurate in this case. moreover equation  12  is not precisely expressed. these errors made us lose confidence in our results and they cannot be ignored in the published version.we suggest this paper should not be referenced by readers for any purpose.", "Pub Date": "2023-09-14"}