{"Title": "Delay-Optimal Computation Offloading in Large-Scale Multi-Access Edge Computing Using Mean Field Game", "Doi": "10.1109/TWC.2023.3291198", "Authors": ["d. wang", "w. wang", "h. gao", "z. zhang", "z. han"], "Key Words": ["multi-access edge computing (mec)", "mean field game (mfg)", "generative adversarial networks (gan)"], "Abstract": "in large scale multi access edge computing  mec  networks each device should make the computation offloading decision distributively. in this paper we target on a delay optimal computation offloading problem in large scale mec systems where each task has two properties  data size and computation amount. because the detailed state information of massive devices are huge in large scale systems we propose a distributed computation offloading algorithm using the mean field game  mfg . to design the distributed computation offloading algorithm we first formulate the delay optimal computation offloading problem as a markov decision process  mdp  and derive the hamilton jaccobi bellman  hjb  equation with the unknown task allocation proportion where the combined influence from other devices and mec servers should be estimated. based on mfg we obtain the fokker planck kolmogorov  fpk  equation to describe the evolution of the system‚äôs collective behavior with the influence from other devices and mec servers formulated as the mean field. to solve the large scale problem with the unknown allocation proportion we propose a optimal computation offloading algorithm based on the generative adversarial networks  gan  structure. for the generator we generate the unknown task allocation proportion due to its non calculability and insufficient dataset. for the discriminator we train the value function and propose a water filling algorithm to prioritize the task offloading. finally the simulation results evaluate the performance of the proposed algorithm and show the performance gain compared to conventional algorithms.", "Pub Date": "2024-03-11"}