{"Title": "Dementia Speech Dataset Creation and Analysis in Indic Languages‚ÄîA Pilot Study", "Doi": "10.1109/ACCESS.2023.3334790", "Authors": ["s. vekkot", "n. n. v. s. prakash", "t. s. e. reddy", "s. r. sripathi", "s. lalitha", "d. gupta", "m. zakariah", "y. a. alotaibi"], "Key Words": ["dementia", "indic speech", "pitch", "silences", "jitter", "shimmer", "pearson correlation", "cosine similarity"], "Abstract": "the paper describes the creation analysis and validation of a multilingual dementia speech dataset for indic languages. three popular indian languages viz. telugu tamil and hindi are considered for the pilot study. dementia and associated alzheimers disease affect a large section of asian population. though there are promising studies in dementia detection focussed on western ethnicity the absence of a clinical dementia dataset for indian languages forms the primary motivation for this study. this pilot study aims to overcome the challenges associated with data collection and validation in a clinical setting and deal with situations wherein clinical data is not readily available. the indic dementia dataset is an enacted non clinical dataset created from the manual translations of the benchmark clinical english dementiabank dataset. the dataset created is validated using features extracted from the benchmark. the feature evaluation revealed a similarity of 92.6% for silences 92% for mean pitch  hz  84.7% for jitter and 90.3% for shimmer. subjective evaluation was also conducted based on clarity and similarity of utterances with dementiabank data. an average mos of 3.9 for clarity of speech and 3.76 for similarity with respect to dementiabank was obtained across all three languages. a baseline classification using state of art deep network architecture gave a maximum of 78% accuracy in dementia detection using the indic dementia dataset. the pilot experimentation in this work gives promising insights into the development of a multilingual dataset for analysis of clinical speech patterns in early dementia in the indian population.", "Pub Date": "2023-11-28"}