{"Title": "Dependency Tasks Offloading and Communication Resource Allocation in Collaborative UAV Networks: A Metaheuristic Approach", "Doi": "10.1109/JIOT.2022.3233667", "Authors": ["l. x. nguyen", "y. k. tun", "t. n. dang", "y. m. park", "z. han", "c. s. hong"], "Key Words": ["collaborative unmanned aerial vehicles (uavs) network", "communication resource allocation", "directed acyclic graph (dag) tasks", "discrete whale optimization algorithm (d-woa)", "offloading dependency subtasks"], "Abstract": "nowadays unmanned aerial vehicles  uavs  assisted mobile edge computing  mec  systems have been exploited as a promising solution for providing computation services to mobile users outside of terrestrial networks. however it remains challenging for standalone uavs to meet the computation requirement of numerous users due to their limited computation capacity and battery lives. therefore we propose a collaborative scheme among uavs to share the workload between them. furthermore this work is the first to consider the task topology of offloading in mec enabled uavs networks while restricting their power consumption. we study the task topology in which a task consists of a set of subtasks and each subtask has dependencies upon other subtasks. in the real world subtasks with dependencies must wait for their preceding subtasks to complete before being executed and this affects the offloading strategy. next we formulate an optimization problem to minimize the average latency of users by jointly controlling the offloading decision for dependent tasks and allocating the communication resources of uavs. the formulated problem is np hard and cannot be solved in polynomial time. therefore we divide the problem into two subproblems  1  offloading decision problem and 2  communication resource allocation problem. then a metaheuristic method is proposed to find the suboptimal solution to the former problem while the latter problem is solved by using convex optimization. finally we conduct simulation experiments to prove that our proposed offloading technique outperforms several benchmark schemes in minimizing the average latency of users for dependency tasks and achieving higher uplink transmission rates.", "Pub Date": "2023-05-05"}