{"Title": "Deployment of Artificial Intelligence Models on Edge Devices: A Tutorial Brief", "Doi": "10.1109/TCSII.2023.3336831", "Authors": ["m. ≈ªyli≈ñski", "a. nassibi", "i. rakhmatulin", "a. malik", "c. m. papavassiliou", "d. p. mandic"], "Key Words": ["artificial intelligence", "edge computing", "learning automata", "in-memory computing", "neural networks"], "Abstract": "artificial intelligence  artificial intelliegence  on an edge device has enormous potential including advanced signal filtering event detection optimization in communications and data compression improving device performance advanced on chip process control and enhancing energy efficiency. in this tutorial we provide a brief overview of artificial intelliegence deployment on edge devices and describe the process of building and deploying a neural network model on a digital edge device. the primary challenge when deploying an artificial intelliegence model in circuits is to fit the model within the constraints of the limited resources as the restricted memory capacity on iot circuits and the finite computational power impose constraints on the utilization of deep neural networks on iot. we address this issue by elucidating methods for optimizing neural network models. part of the tutorial also covers the deployment of deep neural network on logic circuits as significantly enhanced computational speed can be attained by transitioning the artificial intelliegence paradigm from neural networks to learning automata algorithms. this shift involves a move from arithmetic based calculations to logic based approaches. this transformation facilitates the deployment of artificial intelliegence onto field programmable gate arrays  fpgas . the last part of the tutorial covers the emerging topic of in memory computation of the multiply accumulate operation. transferring computations to analog memories has the potential to improve speed and energy efficiency compared to digital architectures potentially achieving improvements of several orders of magnitude. it is our hope that this tutorial will assist researchers and engineers to integrate artificial intelliegence models on edge devices facilitating rapid and reliable implementation.", "Pub Date": "2024-03-05"}