{"Title": "Design and Analysis of Digital Communication Within an SoC-Based Control System for Trapped-Ion Quantum Computing", "Authors": ["n. irtija", "j. plusquellic", "e. e. tsiropoulou", "j. goldberg", "d. lobser", "d. stick"], "Pub Date": "2023-02-20", "Abstract": "electronic control systems used for quantum computing have become increasingly complex as multiple qubit technologies employ larger numbers of qubits with higher fidelity target. whereas the control systems for different technologies share some similarities parameters such as pulse duration throughput real time feedback and latency requirements vary widely depending on the qubit type. in this article we evaluate the performance of modern system on chip  soc  architectures in meeting the control demands associated with performing quantum gates on trapped ion qubits particularly focusing on communication within the soc. a principal focus of this article is the data transfer latency and throughput of several high speed on chip mechanisms on xilinx multiprocessor socs including those that utilize direct memory access  dma . they are measured and evaluated to determine an upper bound on the time required to reconfigure a gate parameter. worst case and average case bandwidth requirements for a custom gate sequencer core are compared with the experimental results. the lowest variability highest throughput data transfer mechanism is dma between the real time processing unit  rpu  and the programmable logic where bandwidths up to 19.2 gb s are possible. for context this enables the reconfiguration of qubit gates in less than 2 $\\mu$s comparable to the fastest gate time. though this article focuses on trapped ion control systems the gate abstraction scheme and measured communication rates are applicable to a broad range of quantum computing technologies.", "Doi": "10.1109/TQE.2023.3238670", "Key Words": ["quantum computing", "qubits", "system-on-chip (soc)-based field-programmable gate arrays (fpga) control system", "trapped ion"]}