{"Title": "Design of English Translation Intelligent Recognition Model Based on Markov Model", "Doi": "10.1109/ICEDCS60513.2023.00134", "Authors": ["w. dong"], "Key Words": ["markov model", "english translation", "intelligent recognition"], "Abstract": "the method of english machine translation based on syntactic analysis cannot solve the problem of low accuracy of machine translation caused by partial structural ambiguity of massive english languages in intelligent identification technology. therefore based on the analysis of the application of intelligent machine translation tools in english translation an english machine translation model based on modern intelligent recognition technology is designed and implemented. polysemy is common in natural language which makes it very difficult for machines to process natural language. word sense disambiguation is a key problem in the field of natural language processing. the goal of word sense disambiguation is to enable the machine to automatically judge the exact meaning of ambiguous words in a specific context. it plays an important role in information retrieval topic tracking text classification and machine translation. aiming at the problems of complex working process and low scoring accuracy of oral english examination scoring system an oral english examination scoring system based on hidden markov model is constructed. the speech recognition module and scoring process are designed. the speech recognizer and hidden markov scoring model are used to realize the recognition error judgment and scoring of oral english pronunciation and the final score of oral english is obtained by changing the hundred mark system. through direct maximum entropy model training the relevant parameters are obtained to obtain the best combination of different english language features solve the problem of partial structural ambiguity in a large number of english languages and improve the accuracy of english machine translation.", "Pub Date": "2023-12-22"}