{"Title": "Design and Simulation of an Edge Compute Architecture for IoT-Based Clinical Decision Support System", "Doi": "10.1109/ACCESS.2024.3380906", "Authors": ["r. h. kumar", "b. rajaram"], "Key Words": ["edge computing", "smart healthcare", "vital sign monitoring", "internet of things", "clinical decision support system"], "Abstract": "clinical decision support systems  cdss  have revolutionized healthcare by leveraging modern technologies such as internet of things  iot  artificial intelligence  ai  predictive analysis nano medicine and virtual & augmented reality. iot based cdss is of interest in particular. in a hospital scenario a patient‚äôs vital signs like heart rate blood pressure respiration rate ecg eeg etc. are monitored with the use of embedded sensor devices also called smart medical devices. these devices collect real time data which is relayed to a compute device where several algorithms are employed to perform computations on said data to arrive at a prognosis e.g. real time onset of hypotension can be detected by running predictive algorithms on real time blood pressure data. the computation in iot based cdss is done predominantly on the cloud wherein the real time data collected is relayed to a centralized cloud server. however latency is a major drawback in a cloud based monitoring system. increased latency is of greater concern in healthcare applications as the decision making process is time sensitive. edge computing can potentially overcome this drawback wherein computation is done on edge network devices rather than the cloud. while edge computing for iot based cdss has been explored in literature there are gaps in their implementations. a majority of literature dealing with edge computing for iot based healthcare only demonstrates a single application and does not address the varying data acquisition rates for different vital signs. each prognosis or diagnosis requires different subsets of vital signs and the underlying algorithm uses different sizes of data e.g. detecting arrhythmia requires processing of ecg data which is a time series data and detecting cardiovascular disease requires blood pressure cholesterol and certain habits of the patient which are mostly single points of data. this paper explores the use of edge computing in cdss quantifies its performance with respect to number of devices sense time interval or intertransmission rate and the size of data and proposes a unified iot edge gateway architecture to combine multiple patterns of data and computation algorithms to achieve reduced latency and network utilization. simulation results show that edge computing reduces the latency of decision by approximately 87 times and the network utilization by 1.5 times. the results show the efficacy of edge computing for implementing iot based cdss and also demonstrate scalability with regard to the number of devices and the size and intertransmission rate of data.", "Pub Date": "2024-03-29"}