{"Title": "Design and Analysis of a 4.2 mW 4 K 6‚Äì8 GHz CMOS LNA for Superconducting Qubit Readout", "Authors": ["a. caglar", "s. van winckel", "s. brebels", "p. wambacq", "j. craninckx"], "Pub Date": "2023-05-25", "Abstract": "this article proposes a cryogenic inverter based low noise amplifier  lna  for qubit readout. its input impedance matching is realized by a high  $q$  on chip gate inductor and capacitive load through the gate to drain feedback capacitance of the input transistors. cascode transistors are used to optimize the impedance matching which results in a larger gate inductor and smaller load capacitor and hence a higher passive and inverter gain. owing to the high passive gain and  $q$  factor of the gate inductor at 4 k the noise of the active stages is substantially suppressed with a negligible noise contribution of the gate inductor. moreover with the current re use in the inverter topology less power consumption is achieved for the given transconductance of transistors. the input impedance gain and noise analyses of the proposed lna are performed for room temperature  rt  operation and its noise optimization is done by taking the cryogenic operation of the devices into account. we demonstrate with the circuit analysis and measurement results that the input impedance of the lna has a low sensitivity to variations on device parameters at cryogenic temperatures. the lna is implemented in a 28 nm cmos technology. it achieves 0.4‚äì0.7 db noise figure  nf  with 4.2 mw power consumption at 4 k and its operating frequency is between 6‚äì8 ghz. the lna consumes very low power compared to the state of the art cryogenic cmos lnas while providing similar nf performance at 4 k which makes it suitable for dilution refrigerators.", "Doi": "10.1109/JSSC.2022.3219060", "Key Words": ["capacitive feedback", "cascode", "cryogenic cmos", "high-q on-chip inductor", "inverter-based low-noise amplifier (lna)", "low power", "quantum computing"]}