{"Title": "Detecting Security Requirements in GitHub Issues -Novel Dataset and SmallBERT-based model", "Doi": "10.1109/CloudCom59040.2023.00058", "Authors": ["p. minina", "a. sadovykh", "v. ivanov"], "Key Words": ["security requirements", "github issues", "nlp", "classification", "dataset", "machine learning", "deep learning", "bert"], "Abstract": "cloud application security initiates with the analysis of security requirements in devops. this involves gathering managing and tracking requirements within integrated issue tracking systems found in repositories like github. devops offers advantages in cloud app development such as accelerated deployment improved collaboration and enhanced reliability. in devops while many security verification tools are automated security requirements analysis often relies on manual procedures. user feedback plays a pivotal role in shaping cloud application requirements and the industry actively seeks automation solutions to expedite development. prior research has demonstrated the limited performance of conventional nlp models trained on established datasets such as promise when employed in the context of github issues. recent studies have explored the integration of deep learning particularly leveraging modern large language models and transfer learning architectures to address requirements engineering challenges. however a significant issue persists   the transferability of these models. while these models excel when applied to datasets similar to those they were trained on their performance often drastically falls when dealing with external domains.in our paper we introduce an automated method for classifying requirements within issue trackers. this method utilizes a novel dataset comprising 12000 security and non security issues collected from open github repositories. we employed a smallbert based model for training and conducted a series of experiments. our research reaffirms the challenge related to the transferability of nlp models. simultaneously our model yields highly promising results when applied to github issues even in challenging scenarios involving issues from projects that were not part of the training dataset and structured requirements texts from the promise dataset. in summary our approach significantly contributes to enhancing devops practices within cloud applications by automating security requirements analysis.", "Pub Date": "2024-03-25"}