{"Title": "Detection of Fake News with RoBERTa Based Embedding and Modified Deep Neural Network Architecture", "Doi": "10.1109/ICCIT60459.2023.10441206", "Authors": ["m. a. rakib mollah", "m. m. j. kabir", "m. kabir", "m. s. reza"], "Key Words": ["natural language processing", "transformers", "fake news", "roberta", "bidirectional encoder"], "Abstract": "the spread of fake news has emerged as a critical challenge in the era of information and digital connectivity. the consequences of misinformation can be profound affecting public opinion policy decisions and even public health. therefore detecting and reducing the spread of fake news is an essential issue that requires reliable and precise solutions. historically the field of fake news detection has witnessed notable advancements but several shortcomings have persisted. many earlier approaches struggled to attain the requisite levels of accuracy. another formidable obstacle that these earlier approaches encountered was the dynamic and ever evolving nature of the tactics employed by those who spread fake news. they employ sensational language which uses phrases with high emotional content to attract readers and elicit a strong emotional response. recognizing these deficiencies we present an innovative solution that leverages the state of the art roberta model and a meticulously modified deep neural network architecture. our approach stands out by not only recognizing the urgency of the fake news detection problem but also by proposing architectural enhancements. it specifically targets the inadequacies of prior methods. we introduce attention mechanisms designed to identify subtle cues indicative of misinformation. the feature extraction techniques capture the nuanced patterns that fake news articles often follow. these architectural refinements make our model extremely effective and achieve an accuracy of 99.76%. the comprehensive evaluations demonstrate that our roberta based model consistently outperforms previous state of the art fake news detection models emphasizing the crucial role of advanced language models in combating misinformation.", "Pub Date": "2024-02-27"}