{"Title": "Determining the Best Weightage Feature in Parameterization Process of GCCD Model for Clone Detection in C-Based Applications", "Doi": "10.1109/ICSECS58457.2023.10256395", "Authors": ["n. s. zaidi", "a. f. mubarak-ali", "a. s. fakhrudin", "r. n. romli"], "Key Words": ["code clone", "gccd", "c-based applications", "computational intelligence"], "Abstract": "the term ‚äúcode clone‚äù relates to code that has been replicated many times in a program. primarily type 1 type 2 type 3 and type 4 serve as the four distinct categories for the classification of code clones. distinct code clone approaches and tools have been implemented for identifying code clones over the years. to overcome the limitation of generalization in recognizing all types of clones generic code clone detection  gccd  model is developed. the five procedures that make up the gccd model foundational structure are pre processing transformation parameterization categorization and match detection. however the preceding gccd model can only detect all types of code clone in java applications. in light of this limitation the study proposes a code clone detection model based on the gccd model which has the capability to support other programming languages in various applications. the primary objective of this proposed research is to enhance the process in generic code clone detection  gccd  model that can improve the code clone detection result specifically in c based applications. to achieve the desired objective some enhancements in the gccd model have been recommended which are to propose a constant and weightage for pre processing and parameterization process in gccd model. the proposed work will be tested in a case study involving four c applications. as determined by the code clone detection results from the proposed enhancement void with its weightage is the preeminent constant and weightage for the generic code clone detection model in c based applications.", "Pub Date": "2023-09-26"}