{"Title": "Developing an Integrated IoT Cloud Based Predictive Conservation Model for Asset Management in Industry 4.0", "Doi": "10.23919/JSC.2023.0011", "Authors": ["k. shanmugam", "k. satyam", "t. r. s. reddy"], "Key Words": ["industry 4.0", "predictive maintenance", "golden search optimization", "multilayer hybrid convolution neural network", "data cleaning"], "Abstract": "with the advent of industry 4.0  i4.0  predictive maintenance  pdm  methods have been widely adopted by businesses to deal with the condition of their machinery. with the help of i4.0 digital transformation information techniques computerised control and communication networks large amounts of data on operational and process conditions can be collected from multiple pieces of equipment and used to make an automated fault detection and diagnosis all with the goal of reducing unscheduled maintenance improving component utilisation and lengthening the lifespan of the equipment. in this paper we use smart approaches to create a pdm planning model. the five key steps of the created approach are as follows   1  cleaning the data  2  normalising the data  3  selecting the best features  4  making a decision about the prediction network and  5  producing a prediction. at the outset pdm related data undergo data cleaning and normalisation to get everything in order and within some kind of bounds. the next step is to execute optimal feature selection in order to eliminate unnecessary data. this research presents the golden search optimization  gso  algorithm a powerful population based optimization technique for efficient feature selection. the first phase of gso is to produce a set of possible solutions or objects at random. these objects will then interact with one another using a straightforward mathematical model to find the best feasible answer. due to the wide range over which the prediction values fall machine learning and deep learning confront challenges in providing reliable predictions. this is why we recommend a multilayer hybrid convolution neural network  mlh cnn . while conceptually similar to vggnet this approach uses fewer parameters while maintaining or improving classification correctness by adjusting the amount of network modules and channels. the projected perfect is evaluated on two datasets to show that it can accurately predict the future state of components for upkeep preparation.", "Pub Date": "2023-09-05"}