{"Title": "Device-Specific QoE Enhancement Through Joint Communication and Computation Resource Scheduling in Edge-Assisted IoT Systems", "Doi": "10.1109/JIOT.2023.3332401", "Authors": ["q. wang", "q. wang", "h. zhao", "h. zhang", "h. zhu", "x. wang"], "Key Words": ["proximal policy optimization (ppo)", "quality of experience (qoe)", "resource scheduling"], "Abstract": "with rapid adoption in vertical industries and further assistance of edge computing internet of things  iot  applications are experiencing phenomenal growth. however the concurrence of heterogeneous iot devices limited system resources and varying network conditions poses an ultimate challenge to resource scheduling for meeting the increasingly diverse requirements of iot applications. most existing resource scheduling techniques are achieved using common performance indicators for all devices as the optimization objective which may lose effectiveness when dealing with the diverse requirements across heterogeneous iot devices. toward this end we focus on enhancing iot device specific quality of experience  qoe  through jointly optimizing communication and computation resources. first a three layer qoe assessment model is constructed to characterize the general correlation between resource provisioning and device specific qoe. then to maximize the overall qoe among iot devices a two stage resource scheduling scheme is proposed to realize the simultaneous optimization of iot devices and the edge system. specifically during stage i a distributed resource scheduling algorithm with low complexity is designed for each iot device to optimize the local computing rate by considering its resource constrained nature. during stage ii a proximal policy optimization  ppo  based online learning approach is proposed on the edge system to schedule communication bandwidth and optimize computational rate. finally extensive experiments demonstrate that our proposal outperforms the existing works from the perspective of qoe performance.", "Pub Date": "2024-04-09"}