{"Title": "DIANA: An End-to-End Hybrid DIgital and ANAlog Neural Network SoC for the Edge", "Doi": "10.1109/JSSC.2022.3214064", "Authors": ["p. houshmand", "g. m. sarda", "v. jain", "k. ueyoshi", "i. a. papistas", "m. shi", "q. zheng", "d. bhattacharjee", "a. mallik", "p. debacker", "d. verkest", "m. verhelst"], "Key Words": ["algorithm-to-hw mapping", "analog in-memory computing (aimc)", "deep neural network (dnn) acceleration", "machine learning processing", "mixed-signal computing", "reduced instruction set computer - five (risc-v)", "system-on-chip (soc)"], "Abstract": "digital analog  diana  a heterogeneous multi core accelerator combines a reduced instruction set computer   five  risc v  host processor with an analog in memory computing  aimc  artificial intelligence  artificial intelliegence  accelerator and a digital reconfigurable deep neural network  dnn  accelerator in a single system on chip  soc  to support a wide variety of neural network  nn  workloads. aimc cores can bring extreme computational parallelism and efficiency at the expense of accuracy and dataflow flexibility. digital artificial intelliegence co processors on the other hand guarantee accuracy through deterministic compute but cannot achieve the same computational density and efficiency. diana exploits this fundamental tradeoff by integrating both types of cores in a shared and optimized memory system to enable seamless execution of the workloads on the parallel cores. the system‚äôs performance benefits further from pipelined parallel execution across both accelerator cores and enhanced aimc spatial unrolling techniques leading to drastically reduced execution latency and reduced memory footprints. the design has been implemented in a 22 nm technology and achieves peak efficiencies of 600 top s/w for the aimc core  i w/o  7/1.5/6 bit  and 14 top s/w  i w/o  8/8/8 bit  for the digital accelerator respectively. end to end performance evaluation of cifar-10 and imagenet classification workloads is carried out on the chip reporting 7.02 and 5.56 top s/w respectively at the system level.", "Pub Date": "2022-12-27"}