{"Title": "Digital Twin-Assisted, SFC-Enabled Service Provisioning in Mobile Edge Computing", "Doi": "10.1109/TMC.2022.3227248", "Authors": ["j. li", "s. guo", "w. liang", "q. chen", "z. xu", "w. xu", "a. y. zomaya"], "Key Words": ["mobile edge computing", "service function chain", "digital twin", "reliable service provisioning", "approximation algorithm", "online algorithm", "resource allocation and optimization"], "Abstract": "mobile edge computing  mec  has been identified as a desirable computing paradigm that provides efficient and effective services for various applications while meeting stringent service delay requirements. orthogonal to the mec computing paradigm network function virtualization  nfv  technology is another enabling technology that provides the network resource management with great flexibility and scalability where the instances of virtual network functions  vnfs  are deployed in edge servers as service function chains  sfcs  for sfc enabled services. although reliable service provisioning in mec environments is fundamentally important the deployed vnf instances usually are not reliable which can be affected by their software implementation their execution duration the workload among edge servers and so on. empowered by digital twin techniques the states of vnf instances can be maintained by their digital twins in a real time manner and their reliability can be accurately predicted through their digital twins. in this paper we study digital twin assisted sfc enabled reliable service provisioning in mec networks by exploiting the dynamics of vnf instance reliability. we concentrate on two novel optimization problems of reliable service provisioning  the service cost minimization problem and the dynamic service admission maximization problem. we first show their np hardness. we then formulate an integer linear program  ilp  solution and devise an approximation algorithm with a constant approximation ratio for the service cost minimization problem. we third provide an ilp solution to the offline version of the dynamic service admission maximization problem. built upon this offline ilp solution we also develop an online algorithm with a provable competitive ratio for the problem by adopting the primal dual dynamic updating technique. we finally evaluate the performance of the proposed algorithms via simulations. simulation results demonstrate that the proposed algorithms outperform their comparison benchmarks and improve the performance of their comparison counterparts by no less than $10.2 \\%$10.2%.", "Pub Date": "2023-12-05"}