{"Title": "Distributed Hybrid Precoding for Edge-Computing-Assisted Cell-Free Massive MIMO Systems With Local CSI", "Doi": "10.1109/JIOT.2023.3327680", "Authors": ["j. luo", "j. fan", "j. zhang"], "Key Words": ["cell-free massive multiple--input multiple-output (mimo)", "distributed hybrid precoding", "edge computing", "resource allocation"], "Abstract": "precoding technology is very promising in edge computing assisted cell free massive multiple input‚äìmultiple output  ecf mmimo  systems because it can eliminate interference and thus improve performance. however it is challenging to design a computationally efficient hybrid precoding scheme to maximize the achievable rate when only the local channel state information  csi  is known. to maximize the achievable rate and minimize the computational energy consumption within the tolerable computational latency we propose a novel optimization framework for joint design of distributed hybrid precoding and computational offloading decision in ecf mmimo systems. the joint optimization problem is modeled as maximizing the sum of the ratio of the achievable rate to the computational energy consumption. since it is difficult to directly solve the joint optimization problem with nonconvex and fractional constraints we first use the quadratic transform method to remove the fractional constraint and perform an equivalent transformation of the original problem. next we decompose the equivalent optimization problem into three subproblems and propose an alternate optimization algorithm. specifically we successively adopt a local block diagonalization hybrid precoding scheme and a game based power allocation algorithm to maximize the total rate and a computational resource allocation scheme to minimize computational offloading energy consumption under the constraint of computational latency. numerical simulation results illustrate that the performance obtained by our proposed scheme with only local csi is 93% of that as compared to the full csi case. besides we also prove the convergence of the alternate optimization algorithm theoretically.", "Pub Date": "2024-03-08"}