{"Title": "Distributed Machine Learning for UAV Swarms: Computing, Sensing, and Semantics", "Doi": "10.1109/JIOT.2023.3341307", "Authors": ["y. ding", "z. yang", "q. -v. pham", "y. hu", "z. zhang", "m. shikh-bahaei"], "Key Words": ["distributed inference (di)", "distributed learning (dl) satellite communications", "semantic communications", "split learning (sl)", "unmanned aerial vehicle (uav) swarms"], "Abstract": "the unmanned aerial vehicle  uav  swarms have shown great potential to serve next generation communication networks with their extraordinary flexibility affordability and the ability to collaboratively and autonomously provide line of sight  los  services. however autonomous collaboration under wireless dynamics is challenging. distributed learning  dl  provides a chance for the uav swarms to operate intelligently under sophisticated dynamics such that they can be applied to wireless communication service scenarios as well as applications including multidirectional remote surveillance and target tracking. in this survey we first introduce several popular dl frameworks that are capable of managing a uav swarm these include federated learning  fl  multiagent reinforcement learning  marl  distributed inference  di  and split learning  sl . we also present a comprehensive overview of how these dl frameworks manage uav swarms in regard to trajectory design power control wireless resource allocation user assignment perception and satellite‚äìdrone integration. then we present several state of the art applications of uav swarms in wireless communication systems such as reconfigurable intelligent surfaces  riss  virtual reality  vr  and semantic communications  semcoms  and discuss the problems and challenges that dl enabled uav swarms can solve in these applications. finally we describe open problems of using dl in uav swarms and future research directions of dl enabled uav swarms. in summary this survey provides a concise survey of various dl applications for uav swarms in extensive scenarios.", "Pub Date": "2024-02-21"}