{"Title": "Distributed Communication and Computation Resource Management for Digital Twin-Aided Edge Computing With Short-Packet Communications", "Doi": "10.1109/JSAC.2023.3310087", "Authors": ["d. van huynh", "v. -d. nguyen", "s. r. khosravirad", "g. k. karagiannidis", "t. q. duong"], "Key Words": ["digital twin", "distributed optimization", "industrial internet of things", "edge computing", "ultra-reliable", "low latency communications"], "Abstract": "for future networks it is highly demanding to satisfy a wide range of time sensitive and computation intensive services. this is a very challenging task since it requires a combination of aspects from information communication and computation in order to establish a digital representation of the real network environment. this paper introduces a fairness aware latency minimisation  falm  framework in the digital twin  dt  aided edge computing with ultra reliable and low latency communications  urllc  which jointly optimises various communication and computation parameters namely bandwidth allocation transmission power task offloading portions and processing rate of user equipments  ues  and edge servers  ess . the formulated problem is highly complicated due to non convex constraints and strong coupling among optimisation variables. to deal with this problem we develop both centralised and distributed optimisation approaches. in particular we first resort to successive convex approximation  sca  method to develop a low complexity iterative algorithm and solve the problem in a centralised manner. combining tools from sca and alternating direction method of multipliers  admm  we develop an efficient distributed solution with parallel computation processing at ess under global consensus in each iteration and strong theoretical performance guaranteed. numerical results are provided to validate the proposed solutions in terms of convergence speed and overall latency as well as improving fairness among all ues.", "Pub Date": "2023-10-26"}