{"Title": "Distributed Design of Wireless Powered Fog Computing Networks With Binary Computation Offloading", "Doi": "10.1109/TMC.2021.3115348", "Authors": ["h. li", "k. xiong", "y. lu", "b. gao", "p. fan", "k. b. letaief"], "Key Words": ["fog computing", "binary offloading", "wireless power transfer", "power minimization", "successive convex approximation", "alternating direction method of multipliers"], "Abstract": "this paper investigates a multi user wireless powered fog computing  fc  network where multiple energy limited wireless sensor devices  wsds  first harvest energy from a nearby hybrid access point  hap  and then compute their tasks locally  i.e. the local computing  lc  mode  or offload the tasks to the hap  i.e. the fc mode  via a binary offloading policy. in order to pursue the green computing network design an optimization problem is formulated to minimize the transmit power at the hap by jointly optimizing the time allocation ratio and the computing mode selection vector under the energy causality constraints and the wsds‚äô computing rate requirements constraints. to efficiently solve the formulated non convex problem in a distributed manner it is first transformed into an approximate form and then an alternating direction method of multipliers  admm  based algorithm is designed to solve the transformed problem based on which the successive convex approximation  sca  is adopted to improve the approximating precision in an iterative way. with the proposed admm based distributed algorithm each wsd is able to optimize its computing mode and offloading time with local channel state information  csi  which thus is more suitable for large scale networks. for comparison a channel sorting based  csb  centralized algorithm with global csi is also presented and the computational complexities of the proposed admm based algorithm and the csb algorithm are analyzed. simulation results show that the proposed distributed algorithm achieves a comparable performance with the csb centralized algorithm and the exhaustive search method. it is also observed that to minimize the transmit power at the hap the wsds with the better channel quality are inclined to select the lc mode which is much different from traditional sum computation rate maximization design.", "Pub Date": "2023-03-07"}