{"Title": "DocFlow: A Visual Analytics System for Question-Based Document Retrieval and Categorization", "Doi": "10.1109/TVCG.2022.3219762", "Authors": ["r. qiu", "y. tu", "y. -s. wang", "p. -y. yen", "h. -w. shen"], "Key Words": ["biomedical systematic review", "evidence-based-practice", "human-in-the-loop information retrieval", "question-based document categorization", "question-based document retrieval"], "Abstract": "a systematic review  sr  is essential with up to date research evidence to support clinical decisions and practices. however the growing literature volume makes it challenging for sr reviewers and clinicians to discover useful information efficiently. many human in the loop information retrieval approaches  hir  have been proposed to rank documents semantically similar to users‚äô queries and provide interactive visualizations to facilitate document retrieval. given that the queries are mainly composed of keywords and keyphrases retrieving documents that are semantically similar to a query does not necessarily respond to the clinician need. clinicians still have to review many documents to find the solution. the problem motivates us to develop a visual analytics system docflow to facilitate information seeking. one of the features of our docflow is accepting natural language questions. the detailed description enables retrieving documents that can answer users‚äô questions. additionally clinicians often categorize documents based on their backgrounds and with different purposes  e.g. populations treatments . since the criteria are unknown and cannot be pre defined in advance existing methods can only achieve categorization by considering the entire information in documents. in contrast by locating answers in each document our docflow can intelligently categorize documents based on users‚äô questions. the second feature of our docflow is a flexible interface where users can arrange a sequence of questions to customize their rules for document retrieval and categorization. the two features of this visual analytics system support a flexible information seeking process. the case studies and the feedback from domain experts demonstrate the usefulness and effectiveness of our docflow.", "Pub Date": "2024-01-02"}