{"Title": "DocToModel: Automated Authoring of Models from Diverse Requirements Specification Documents", "Doi": "10.1109/ICSE-SEIP58684.2023.00024", "Authors": ["a. rajbhoj", "p. nistala", "v. kulkarni", "s. soni", "a. pathan"], "Key Words": ["meta-model", "automated model authoring", "model extraction", "document parser", "nlp", "meta-model pattern", "pattern interpreter"], "Abstract": "early stages of software development life cycle  sdlc  namely requirement elicitation and requirements analysis have remained document centric in the industry for market driven complex large scale business applications and products. the documentation typically runs into hundreds of natural language  nl  text documents which requirements engineers need to sift looking for the relevant information and also maintain these documents in sync over time ‚äì a time consuming and error prone activity. much of this difficulty can be overcome if the information is available in a structured form that is amenable to automated processing. purposive models offer a way out. however for easy adoption by industry practitioners these models must be populated from nl text documents in a largely automated manner. this task is characterized by high variability with several documents containing different information conforming to different structures and styles. as a result purposive information extractors need to be developed for each project/ product. moreover being an open ended space there is no upper bound on the information extractors that need to be developed. to overcome this difficulty we propose a document structure agnostic and meta model agnostic tool doctomodel for the automated authoring of models from nl text documents. it provides a pattern mapping language to specify a mapping of structured and unstructured document information to meta model elements and a pattern interpreter to automate model authoring. the configurable and extensible architecture of doctomodel makes it generic and amenable to easy repurposing for other nl documents. this paper describes the approach and illustrates its utility and efficacy on multiple real world case studies.", "Pub Date": "2023-07-11"}