{"Title": "Does Qubit Connectivity Impact Quantum Circuit Complexity?", "Authors": ["p. yuan", "j. allcock", "s. zhang"], "Pub Date": "2024-01-19", "Abstract": "some physical implementation schemes of quantum computing can apply two qubit gates only on certain pairs of qubits. these connectivity constraints are commonly viewed as a significant disadvantage. for example compiling an unrestricted  $n$  qubit quantum circuit to one with poor qubit connectivity such as a 1 d chain usually results in a blowup of depth by  $o n^{2} $  and size by  $o n $ . it is appealing to conjecture that this overhead is unavoidable‚äîa random circuit on  $n$  qubits has  $\\theta  n $  two qubit gates in each layer and a constant fraction of them act on qubits separated by distance  $\\theta  n $ . while it is known that almost all  $n$  qubit unitary operations need quantum circuits of  $\\omega  4^{n}/n $  depth and  $\\omega  4^{n} $  size to realize with all to all qubit connectivity in this article we show that all  $n$  qubit unitary operations can be implemented by quantum circuits of  $o 4^{n}/n $  depth and  $o 4^{n} $  size even under 1 d chain qubit connectivity constraint. we extend this result and investigate qubit connectivity in three directions. first we consider more general connectivity graphs and show that the circuit size can always be made  $o 4^{n} $  as long as the graph is connected. for circuit depth we study  $d$  dimensional grids complete  $d$  ary trees and expander graphs and show results similar to the 1 d chain. second we consider the case when ancillary qubits are available. we show that with ancilla the circuit depth can be made polynomial and the space depth trade off is not impaired by connectivity constraints unless we have exponentially many ancillary qubits. third we obtain nearly optimal results on special families of unitaries including diagonal unitaries 2 by 2 block diagonal unitaries and quantum state preparation  qsp  unitaries the last being a fundamental task used in many quantum algorithms for machine learning and linear algebra.", "Doi": "10.1109/TCAD.2023.3311734", "Key Words": ["circuit depth", "circuit size", "general unitary synthesis (gus)", "quantum state preparation (qsp)", "qubit connectivity"]}