{"Title": "DriftGLY: A Low-Cost IoT-Based Ecosystem for Monitoring Agrochemical Spray Drifts", "Authors": ["j. aira", "t. olivares", "f. m. delicado"], "Pub Date": "2024-01-18", "Abstract": "agrochemicals are to be blamed for the poisoning of millions of human beings worldwide with acute and chronic exposure to such substances causing thousands of deaths. the presence of agrochemicals in the air is caused by drift‚äîa phenomenon that originates from ground and aerial spraying applied in lands used for agribusiness. drift refers to the spread and wind driven transport of agrochemicals that have been volatilized during spraying and which can easily reach towns and cities. actively monitoring agrochemical drift is essential to protect the health of citizens and the environment. many of the systems used for monitoring agrochemicals are currently analog while those with some degree of digitalization are expensive complex and not easily scalable. therefore new cost effective stand alone reliable easy to implement and citizen oriented technological tools need to be designed and developed. this article introduces ‚äúdriftgly‚äù an innovative low cost internet of things  iot  early warning system that utilizes a digital traffic light to continuously and automatically monitor the presence of agrochemicals in the air both individually and in cocktail form. the key innovation of driftgly lies in the close relationship between the configuration of its digital traffic light and the precise calculation of the quantity of agrochemicals deposited in spray tanks. this configuration is specifically based on the parameter of the dose rate expressed in liters per hectare of these contaminants. driftgly incorporates an original collection system that allows for the indirect detection of agrochemicals in their particulate gaseous and unlike traditional systems liquid forms. in this manner driftgly displays pollution risk levels through its digital traffic light transmitting them to an iot platform via various connectivity options such as wifi lorawan and gsm gprs and posts them on the social network x  formerly known as twitter . the aim of this action is to democratize information and promote the necessary changes for citizens to enjoy a healthy and balanced environment.", "Doi": "10.1109/TIM.2024.3350146", "Key Words": ["agriculture", "agrochemicals", "air pollution", "environmental monitoring", "internet of things (iot)", "low-power wide-area network (lpwan)", "persistent organic pollutants (pops)", "smart cities"]}