{"Title": "DRL-Based Computation Offloading With Queue Stability for Vehicular-Cloud-Assisted Mobile Edge Computing Systems", "Doi": "10.1109/TIV.2022.3225147", "Authors": ["g. ma", "x. wang", "m. hu", "w. ouyang", "x. chen", "y. li"], "Key Words": ["computation offloading", "deep reinforcement learning", "intelligent vehicles", "mobile edge computing"], "Abstract": "computation offloading is considered as a promising method to improve computation performance of intelligent vehicles  ivs  where ivs can offload resource hungry applications to mobile edge computing  mec  servers. however due to the dynamic environment of intelligent transportation systems it challenging to develop an effective offloading scheme that ensures stable operation of the system. furthermore ivs only offload tasks to mec servers or parked vehicles how to take full advantage of resources in a random traffic flow is a main challenge. in this paper we propose a vehicular cloud assisted mec network in urban cities to fully explore the idle resources and ensure the stability of task queue. specifically we develop a novel virtual platform based on deep neural network that predicts vehicles trajectory and creates vehicular cloud to integrate computation resources. we then design a vehicular cloud assisted offloading scheme that aims to maximize task throughput in continuous time slots subject to multi constraint. to address the coupling among multiple variables and different time slots we put forward a lightweight framework to apply the lyapunov optimization in combination with deep reinforcement learning. in particular we apply lyapunov drift plus penalty approach to decompose the initial problem into per slot subproblems and control the long term task queue stability. to further reduce the computation complexity we decouple the subproblem into three processes and the deep q network is put forward to solve it. extensive simulations demonstrate that under different task arrivals our proposed scheme can achieve the task queue stability within 10 time slots with a low transmission power.", "Pub Date": "2023-05-22"}