{"Title": "DRL-Based Offloading for Computation Delay Minimization in Wireless-Powered Multi-Access Edge Computing", "Doi": "10.1109/TCOMM.2023.3237854", "Authors": ["k. zheng", "g. jiang", "x. liu", "k. chi", "x. yao", "j. liu"], "Key Words": ["multi-access edge computing", "wireless power transfer", "deep reinforcement learning", "computation delay"], "Abstract": "wireless power transfer  wpt  and edge computing have been validated as effective ways to solve the energy limited problem and computation capacity limited problem of wireless devices  wds  respectively. this paper studies the wireless powered multi access edge computing  wp mec  network where wds conduct either local computing or task offloading for their individable computation tasks. we aim to minimize total computation delay  tcd  when each wd has a computation task to execute referred to as the total computation delay minimization  tcdm  problem by jointly optimizing the offloading decision wpt duration and transmission durations of offloading wds. the tcdm problem is a mixed integer programming  mip  problem that is challenging to efficiently obtain the optimal or near optimal solution. to tackle this challenge we decompose the tcdm problem into the sub problem of optimizing the wpt duration and transmission durations and the top problem of optimizing the offloading decision. for the nonconvex sub problem we design a worst wd adjusting  wda  algorithm to efficiently obtain its optimal solution. for the top problem under the time varying channel conditions traditional optimization methods are hard to determine the optimal or near optimal offloading decision within the channel coherence duration. to fast obtain the near optimal offloading decision we propose a deep neural networks  dnn  based deep reinforcement learning  drl  model which takes the sub problem solving as one component for utility evaluation. finally numerical results demonstrate that the proposed online drl based offloading algorithm achieves the near minimal tcd with low computational complexity and is suitable for the fast fading wp mec network.", "Pub Date": "2023-03-16"}