{"Title": "DRL-Based Computation Rate Maximization for Wireless Powered Multi-AP Edge Computing", "Doi": "10.1109/TCOMM.2023.3325905", "Authors": ["s. zhang", "s. bao", "k. chi", "k. yu", "s. mumtaz"], "Key Words": ["edge computing", "wireless power transfer", "resource allocation", "computation rate maximization"], "Abstract": "in the ongoing 5g and upcoming 6g eras the intelligent internet of things  iot  network will take increasingly important responsibility for industrial production daily life and so on. the iot devices with limited battery size and computing ability cannot meet many applications brought out by the data driven artificial intelligence technique. the combination of wireless power transfer  wpt  and edge computing is regarded as an effective solution to this dilemma. iot devices can collect radio frequency energy provided by hybrid access points  haps  to process data locally or offload data to the edge servers of haps. however how to efficiently make offloading decisions and allocate resource is challenging especially for the networks with multiple haps. in this paper we consider the sum computation rate maximization problem for a wpt empowered iot network with multiple haps and iot devices. the problem is formulated as a mixed integer nonlinear programming problem. to solve this problem efficiently we decompose it into a top problem of optimizing offloading decisions and a sub problem of optimizing time allocation under the given offloading decisions. we propose a deep reinforcement learning  drl  based algorithm to output the near optimal offloading decision and design an efficient algorithm based on lagrangian duality method to obtain the consequent optimal time allocation. simulations verified that the proposed drl based algorithm can achieve more than 95 percent of the maximal computation rate with low complexity. compared with the common actor critic algorithm the proposed algorithm has the substantial advantage in convergence speed achieved computation rate and running time.", "Pub Date": "2024-02-15"}