{"Title": "DSC-Net: A Novel Interactive Two-Stream Network by Combining Transformer and CNN for Ultrasound Image Segmentation", "Authors": ["k. hu", "y. zhu", "t. zhou", "y. zhang", "c. cao", "f. xiao", "x. gao"], "Pub Date": "2023-10-24", "Abstract": "ultrasound imaging is one of the most widely used medical imaging techniques for visualizing human tissue due to its economical convenient practical and safe advantages. automatic segmentation of regions of interest  rois  in ultrasound images is of great significance in improving the clinical efficiency of ultrasound images and the accuracy of disease diagnosis. however this task has been challenging due to speckle noise low contrast and blurred boundaries in ultrasound images. to address these problems this article proposes an interactive two stream network based on detail screening and compensation called dsc net for ultrasound image segmentation. unlike previous ultrasound image segmentation methods our dsc net combines the transformer and convolutional neural network  cnn  to perform accurate ultrasound image segmentation. specifically dsc net uses a transformer stream to obtain multiscale detailed features and a cnn stream to extract body features with less noise. then the body features guide multiscale detailed features to filter out noise through the detail screening module. the filtered detail features are applied to the detail compensation module to supplement rich details for the cnn stream. with such interactions dsc net ensures that more noise free details are extracted. extensive experiments on three datasets including two publicly available datasets and one private dataset demonstrate that the proposed dsc net achieves higher performance and superior robustness than state of the art ultrasound image segmentation methods. our code is publicly available at https //github.com mlmip/dsc net.", "Doi": "10.1109/TIM.2023.3322993", "Key Words": ["convolutional neural network (cnn)", "deep learning", "interactive two-stream network", "transformer model", "ultrasound image segmentation"]}