{"Title": "DTN-Assisted Dynamic Cooperative Slicing for Delay-Sensitive Service in MEC-Enabled IoT via Deep Deterministic Policy Gradient With Variable Action", "Doi": "10.1109/JIOT.2023.3241925", "Authors": ["l. li", "l. tang", "q. liu", "y. wang", "x. he", "q. chen"], "Key Words": ["cooperation", "deep reinforcement learning (drl)", "digital twin network (dtn)", "multiaccess edge computing (mec)", "radio access network (ran) slicing"], "Abstract": "network slicing  ns  provides customized services to users of the internet of things  iot  by creating logical virtual networks and ns combined with multiaccess edge computing  mec  can significantly minimize the latency for delay sensitive service. therefore it is important to research how to employ ns to achieve low latency for delay sensitive service in mec enabled iot. in this article we propose a paradigm of dynamic cooperative slicing based on the digital twin network  dtn  to achieve low latency for delay sensitive service. specifically we first build a dtn for the mec enabled iot and build basic models and function models including prediction and decision making in dtn. then we realize dynamic cooperative slicing through the built basic models and function models. second with the assistance of the ubiquitous computing resources in mec enabled iot based on dtn we construct joint optimization problem of communication resources computing resources and collaboration proportion with the objective of ensuring low delay of delay sensitive service while maximizing the long term utility of operators. third considering that the different mec servers participating in the cooperation in each time slot lead to different action spaces in different time slots we propose a deep deterministic policy gradient algorithm with variable action space called vaddpg which draws on the idea of action masking and introduces the action adjustor to realize the hard control of action space. finally a large number of simulations demonstrate that the proposed algorithm outperforms the benchmark algorithms in terms of both the long term utility of operators and the delay obtained by slicing.", "Pub Date": "2023-06-01"}