{"Title": "Dual Attribute-Based Auditing Scheme for Fog Computing-Based Data Dynamic Storage With Distributed Collaborative Verification", "Doi": "10.1109/TNSM.2023.3267235", "Authors": ["k. gu", "w. zhang", "x. wang", "x. li", "w. jia"], "Key Words": ["distributed data storage", "integrity auditing", "attribute", "dynamic operations", "fog computing"], "Abstract": "compared with cloud computing based data storage distributed data storage in fog computing is more vulnerable to malicious attacks. so it is very necessary to provide a secure distributed auditing mechanism with protecting the identity privacy of data owners and controlling the identities of auditors under fog computing based data storage. in this paper we propose a dual attribute based auditing scheme for fog computing based data dynamic storage. our auditing scheme can protect the identity privacy of data owners and provide an attribute based access control for corresponding audits with a distributed collaborative verification between related fog servers. in our scheme a data owner can securely upload his divided and blinded file blocks with corresponding block authenticators  related with his attribute set  to related fog servers. to prevent malicious auditors from consuming system resources by abusing audit requests the data owner can provide an attribute based access control for corresponding audits where the data owner specifies the attribute set of corresponding auditors who have the right to check the integrity of related data. further a distributed collaborative verification mechanism between related fog servers is constructed to reduce the disadvantages of centralized verification where the shamir‚äôs secret sharing method is used to decompose the picked blinding factor as the shared sub secrets sent to each fog server respectively. compared with cloud computing based data storage our collaborative verification mechanism can implement distributed auditing consent of stored data between multiple fog servers. our auditing scheme can further audit out specific suspicious fog servers. additionally we provide a dynamic data operation mechanism to efficiently support the updating of users‚äô data under fog computing based data storage. furthermore related theoretical analysis and experimental evaluation show our scheme is secure and efficient.", "Pub Date": "2023-12-12"}