{"Title": "Dynamic Transmission and Computation Resource Optimization for Dense LEO Satellite Assisted Mobile-Edge Computing", "Doi": "10.1109/TCOMM.2023.3253721", "Authors": ["c. ding", "j. -b. wang", "m. cheng", "m. lin", "j. cheng"], "Key Words": ["lyapunov optimization", "mobile edge computing", "mimo", "resource allocation", "dense satellite"], "Abstract": "a dense satellite terrestrial integrated mobile edge computing network  satimecn  architecture is developed to meet the computing demands for next generation networks. we formulate an average weighted sum energy consumption minimization problem by jointly considering task ratio allocation of computing or offloading at local and the gateway  gw  ground user terminal  gut  satellite association relation gut multiple input and multiple output  mimo  precoding and computation resource allocation at local and the gw. due to the stochastic property of the optimization problem we adopt lyapunov optimization theory to transform it into a deterministic one. then we decompose the optimization problem into four subproblems and solve each one iteratively. specifically task ratio allocation of computing or offloading at local and the gw is obtained in a closed form expression using the delay constraint. then the binary gut satellite association subproblem is solved by the weighted minimum mean squared error and quadratic transform based fractional programming  qtfp  methods. moreover the mimo precoding subproblem is solved by qtfp and interior point methods. finally the computation resource allocation subproblem for local and edge computing is derived in closed form expressions. simulation results demonstrate that the tradeoff between the average weighted sum energy consumption and the average queue length can be realized by adjusting the lyapunov control parameter. moreover the proposed mimo communication and frequency reuse schemes for dense satellite network can realize efficient computation offloading with relative low cost.", "Pub Date": "2023-05-17"}