{"Title": "Dynamic Multi-Time Scale User Admission and Resource Allocation for Semantic Extraction in MEC Systems", "Doi": "10.1109/TVT.2023.3290546", "Authors": ["y. zheng", "t. zhang", "j. loo"], "Key Words": ["semantic extraction task", "resource allocation", "mec", "dynamic optimization"], "Abstract": "this article investigates the semantic extraction task oriented dynamic multi time scale user admission and resource allocation in mobile edge computing  mec  systems. amid prevalence artificial intelligence applications in various industries the offloading of semantic extraction tasks which are mainly composed of convolutional neural networks of computer vision is a great challenge for communication bandwidth and computing capacity allocation in mec systems. considering the stochastic nature of the semantic extraction tasks we formulate a stochastic optimization problem by modeling it as the dynamic arrival of tasks in the temporal domain. we jointly optimize the system revenue and cost which are represented as user admission in the long term and resource allocation in the short term respectively. to handle the proposed stochastic optimization problem we decompose it into short time scale subproblems and a long time scale subproblem by using the lyapunov optimization technique. after that the short time scale optimization variables of resource allocation including user association bandwidth allocation and computing capacity allocation are obtained in closed form. the user admission optimization on long time scales is solved by a heuristic iteration method. then the multi time scale user admission and resource allocation algorithm is proposed for dynamic semantic extraction task computing in mec systems. simulation results demonstrate that compared with the benchmarks the proposed algorithm improves the performance of user admission and resource allocation efficiently and achieves a flexible trade off between system revenue and cost at multi time scales and considering semantic extraction tasks.", "Pub Date": "2023-12-18"}