{"Title": "Dynamic Reliability Management of Multigateway IoT Edge Computing Systems", "Doi": "10.1109/JIOT.2022.3185082", "Authors": ["k. ergun", "r. ayoub", "p. mercati", "t. ≈†. rosing"], "Key Words": ["computation offloading", "constrained devices", "device management", "edge computing", "optimization and control"], "Abstract": "the emerging paradigm of edge computing envisions to overcome the shortcomings of cloud centric internet of things  iot  by providing data processing and storage capabilities closer to the source of data. accordingly iot edge devices with the increasing demand of computation workloads on them are prone to failures more than ever. hard failures in hardware due to aging and reliability degradation are particularly important since they are irrecoverable requiring maintenance for the replacement of defective parts at high costs. in this article we propose a novel dynamic reliability management  drm  technique for multigateway iot edge computing systems to mitigate degradation and defer early hard failures. taking advantage of the edge computing architecture we utilize gateways for computation offloading with the primary goal of maximizing the battery lifetime of edge devices while satisfying the quality of service  qos  and reliability requirements. we present a two level management scheme which work together to 1  choose the offloading rates of edge devices  2  assign edge devices to gateways  and 3  decide multihop data flow routes and rates in the network. the offloading rates are selected by a hierarchical multitimescale distributed controller. we assign edge devices by solving a bottleneck generalized assignment problem  bgap  and compute optimal flows in a fully distributed fashion leveraging the subgradient method. our results based on real measurements and trace driven simulation demonstrate that the proposed scheme can achieve a similar battery lifetime and better qos compared to the state of the art approaches while satisfying reliability requirements where other approaches fail by a large margin.", "Pub Date": "2023-02-20"}