{"Title": "Dynamic Secure Access Control and Data Sharing Through Trusted Delegation and Revocation in a Blockchain-Enabled Cloud-IoT Environment", "Doi": "10.1109/JIOT.2022.3217087", "Authors": ["s. alshehri", "o. bamasaq", "d. alghazzawi", "a. jamjoom"], "Key Words": ["access delegation", "blockchain", "edge computing", "internet of things (iot)", "practical byzantine fault tolerance (pbft) consensus", "revocation", "secure data sharing"], "Abstract": "the internet of things  iot  is vulnerable to leakage of private information during data sharing. to avoid this problem access control and secure data sharing have been introduced in iot  however many challenges are faced because of centralized access control and single delegator selection. additionally blockchain is integrated into iot to enhance the security of the environment. for that purpose this research proposes dynamic secure access control using the blockchain  dsa block  model which performs secure access control and data sharing. initially the iot device attributes and user attributes are registered at a local domain authority  lda  for generating private and public keys using the hyperelliptic curve cryptography  hecc  algorithm which ensures the legitimacy of the users and devices. then the iot devices send a request message to the edge nodes  ens  via a gateway which performs request filtration by validating the user‚äôs authenticity. the filtered requests are sent to the edge server to perform access delegation using rock hyraxes swarm optimization  rhso  which selects a set of delegator nodes. the access control decision is made by using the trusted practical byzantine fault tolerance  pbft  consensus algorithm. the iot data are stored in the cloud server for secure storage in which the data are secured using a differential privacy mechanism. finally dual revocations such as user attribute revocation and user revocation are used to maintain security. the performance of dsa block is evaluated and the results demonstrate that the proposed dsa block model achieves superior performance compared to previous works.", "Pub Date": "2023-02-21"}