{"Title": "EarHear: Enabling the Deaf to Hear the World via Smartphone Speakers and Microphones", "Doi": "10.1109/JIOT.2023.3323631", "Authors": ["z. hao", "y. wang", "z. zhang", "x. dang"], "Key Words": ["acoustic sensing", "chinese sign language recognition (cslr)", "chinese sign language translation (cslt)", "human‚äìcomputer interaction"], "Abstract": "sign language plays a vital role in communication and learning for individuals with hearing and speech disabilities serving as a common language for the deaf. current state of the art sign language recognition methods primarily rely on computer vision techniques but they have certain limitations including susceptibility to light interference and privacy concerns. ubiquitous acoustic sensing provides new possibilities for sign language recognition leveraging its high resistance to interference and cost effectiveness. however existing methods face challenges in achieving satisfactory results due to environmental interference and the complexity of sign language recognition contexts. in this work we propose earhear a robust contactless chinese sign language recognition and translation system. earhear adopts a differential doppler data preprocessing method to cleverly mitigate the interference caused by the environment. to further identify differences in the morphology speed and direction of sign language actions and distinguish similar gestures we propose the vision transformer for sign language recognition which is able to model the context dependence of long range features and output indeterminate long sign language sequences using an attention mechanism. as a result computational speed and recognition accuracy are improved. moreover we explore a large scale language model based sign language translation which enables sign language recognition results to follow natural language standards thus realizing a true sense of sign language recognition. the evaluation results based on 15 chinese sentences show that our system achieves an average recognition rate of 93.38% and a bleu-1 score of 80.73% for sign language translation reaching the most advanced level in terms of accuracy and robustness.", "Pub Date": "2024-03-08"}