{"Title": "ECE: Exactly Once Computation for Collaborative Edge in IoT Using Information-Centric Networking", "Doi": "10.1109/JIOT.2023.3275179", "Authors": ["q. wang", "b. lee", "n. murray", "y. qiao"], "Key Words": ["collaborative edge computing", "exactly once computation", "information-centric networking (icn)", "internet of things (iot)"], "Abstract": "exactly once data processing delivery can be guaranteed in traditional big data processing systems e.g. apache flink. checkpoint is commonly used as the solution. each operator in these systems can restart from the last successfully saved state whenever a failure happens. it is not necessary to restore the logical job graph onto the same device s  in traditional datacenter scenarios with powerful servers close to each other. however the datacenter oriented solutions are not suitable for iot collaborative edge computing scenarios. the logical job graph is tightly coupled to the physical topology in iot networks. data processing task s  cannot be placed at a random edge device to recover from a network failure as it needs to evaluate the benefits of transmitting data versus processing aggregating the data. to address the above challenges this article proposes an information centric networking based solution and correspondent protocols to provide exactly once computation for the collaborative edge in iot  ece . it contains a job execution scheme to deliver iot jobs with exactly once data computation guarantee and a recovery procedure to dynamically change the iot job execution graph while experiencing link failures. the protocol also provides a checking procedure on data state  received unreceived and computed uncomputed  to prevent any data loss or duplicated data processing due to the updated job graph. a data identification approach based on the job graph is devised to support the ece functionality. a testbed has been developed on ndnsim and the simulation results have verified the feasibility and scalability of ece design. it also evaluates the overhead incurred by the ece protocol to guarantee exactly once data computation.", "Pub Date": "2023-09-22"}