{"Title": "Edge Technologies for Disaster Management: A Survey of Social Media and Artificial Intelligence Integration", "Doi": "10.1109/ACCESS.2023.3293035", "Authors": ["m. aboualola", "k. abualsaud", "t. khattab", "n. zorba", "h. s. hassanein"], "Key Words": ["crowd management", "event prediction", "emergency detection", "response to emergency", "machine learning", "deep learning", "artificial intelligence", "social media", "big data", "edge computing"], "Abstract": "within the paradigm of smart cities smart devices can be considered as a tool to enhance safety. edge sensing internet of things  iot  big data social media analytics edge computing and artificial intelligence are key technologies that can be applied through smart devices to create emergency aware systems. the use of these technologies could make emergency management tasks such as visualizing analyzing and predicting disasters easier to perform. the aim of this paper is to conduct a review of recent activities in literature about disaster and emergency management and showing the role of different edge technologies used in this regard and through the different stages of dealing with a disaster situation. special importance is given to two main technologies  social media analytics and artificial intelligence due to their exceptional impact on emergency situations. social media represents a rich source of data while artificial intelligence stands out as the mechanism to deal with the huge amount of data generated by smart devices and thus needed to tackle all sources of data in order to predict detect manage information and for authorities to respond to emergency situations. this survey is a comprehensive review for the recent literature on the related topics providing the reader with a clear overview of the current status and classifying the papers into groups with relations among them. the structuring of the recent literature into four phases makes it easier for the reader to realize the current state of the art. for completeness this survey ends with a section on open issues and research trends in disaster and emergency management systems.", "Pub Date": "2023-07-25"}