{"Title": "Edge-Aware Cloud-Native Service for Enhancing Back Situation Awareness in 5G-Based Vehicular Systems", "Doi": "10.1109/TVT.2023.3304172", "Authors": ["n. slamnik-krije≈°torac", "f. z. yousaf", "g. m. yilma", "r. halili", "m. liebsch", "j. m. marquez-barja"], "Key Words": ["mec", "5g", "multi-domain back situation awareness", "nfv orchestration", "vehicular communications", "public safety"], "Abstract": "in the public safety sector 5g offers immense opportunities for enhancing mission critical services by provisioning virtualized service functions at the network edge which enables achieving high reliability and low latency. one of these mission critical services is back situation awareness  bsa  that supports emergency vehicles  emvs  by increasing awareness about them on the roads. in this article we introduce an on demand bsa application service which has been developed for multi domain multi access edge computing  mec  systems enabling early notification for vehicles on the estimated time of arrival  eta  of an approaching emv. the state of the art approaches inform civilian vehicles about emvs only when they are in a close proximity  up to 300 m . however in some situations  e.g. in congested areas  this may not be enough for the civilian vehicles to safely and timely maneuver out of the lane of an emv. our approach is to the best of our knowledge a unique way to significantly extend this awareness by creating an orchestrated 5g based mec deployment of bsa application service on optimally selected edges thereby stretching over multiple edge domains and even countries. while consuming the real time location speed and heading of an emv such application service affords the drivers with sufficient time to create a clear corridor allowing the emv to pass through unhindered in a safe manner thereby increasing the mission success. the detailed design and the performance analysis of the bsa application service that has been created following modern cloud native principles based on docker and kubernetes is presented in terms of the impact of emergency scale on the mec system resources and service response time. moreover we also introduce a metric called panic indicator which depicts how the proposed bsa service can potentially help in enabling drivers to calmly maneuver out of the path of an emv thereby increasing road safety.", "Pub Date": "2024-01-16"}