{"Title": "EdgeCooper: Network-Aware Cooperative LiDAR Perception for Enhanced Vehicular Awareness", "Doi": "10.1109/JSAC.2023.3322764", "Authors": ["g. luo", "c. shao", "n. cheng", "h. zhou", "h. zhang", "q. yuan", "j. li"], "Key Words": ["cooperative communication", "collaborative perception", "network-aware", "edge computing", "positioning"], "Abstract": "autonomous driving vehicle  adv  that is ready to transform our society and economy is in desperate need of precise positioning over itself as well as surrounding environments. however it is still a challenging issue for adv to retrieve real time positioning knowledge over road participants and dynamic surrounding environments due to unsatisfied perception accuracy caused by sparse observations and limited perception range. cooperative perception which advocates cooperatively disseminating perception data among vehicles has the potential to overcome the above limitations. to this end this article proposes a novel edge assisted multi vehicle perception system to enhance vehicles‚äô awareness over surrounding environments which is termed as edgecooper. edgecooper first schedules vehicles to share complementarity enhanced and redundancy minimized raw sensor data with an edge server using multi hop cooperative 5g v2x communications. then edgecooper merges vehicles‚äô individual views to form a holistic view with a higher resolution thus enhancing perception robustness and enlarging perception range. we formulate multi vehicle multi hop cooperative data sharing as a minimum cost flow problem with conflict and further prove that there exists no polynomial time approximation algorithm with a constant performance ratio unless p = np. furthermore a two dimension graph coloring algorithm with guaranteed performance is proposed to eliminate conflict. we evaluate edgecooper by building a comprehensive simulation platform through a joint manipulation of sumo carla ns3 and pytorch. the experiment results show that compared to a single vehicle‚äôs perception edgecooper performs effective and efficient in enhancing vehicular awareness e.g. extending up to 3.6 times detection range and improving perception accuracy by 20%.", "Pub Date": "2023-12-18"}