{"Title": "Edge Learning for B5G Networks With Distributed Signal Processing: Semantic Communication, Edge Computing, and Wireless Sensing", "Doi": "10.1109/JSTSP.2023.3239189", "Authors": ["w. xu", "z. yang", "d. w. k. ng", "m. levorato", "y. c. eldar", "m. debbah"], "Key Words": ["artificial intelligence (ai)", "deep learning (dl)", "edge learning (el)", "federated learning (fl)", "multi-agent reinforcement learning (marl)", "communication optimization", "internet-of-everything (ioe)", "beyond 5g (b5g)"], "Abstract": "to process and transfer large amounts of data in emerging wireless services it has become increasingly appealing to exploit distributed data communication and learning. specifically edge learning  el  enables local model training on geographically disperse edge nodes and minimizes the need for frequent data exchange. however the current design of separating el deployment and communication optimization does not yet reap the promised benefits of distributed signal processing and sometimes suffers from excessive signalling overhead long processing delay and unstable learning convergence. in this paper we provide an overview on practical distributed el techniques and their interplay with advanced communication optimization designs. in particular typical performance metrics for dual functional learning and communication networks are discussed. also recent achievements of enabling techniques for the dual functional design are surveyed with exemplifications from the mutual perspectives of ‚äúcommunications for learning‚äù and ‚äúlearning for communications.‚äù the application of el techniques within a variety of future communication systems are also envisioned for beyond 5g  b5g  wireless networks. for the application in goal oriented semantic communication we present a first mathematical model of the goal oriented source entropy as an optimization problem. in addition from the viewpoint of information theory we identify fundamental open problems of characterizing rate regions for communication networks supporting distributed learning and computing tasks. we also present technical challenges as well as emerging application opportunities in this field with the aim of inspiring future research and promoting widespread developments of el in b5g.", "Pub Date": "2023-02-22"}