{"Title": "Edge Resource Pricing and Scheduling for Blockchain: A Stackelberg Game Approach", "Doi": "10.1109/TSC.2022.3177438", "Authors": ["s. huang", "h. huang", "g. gao", "y. -e. sun", "y. du", "j. wu"], "Key Words": ["blockchain", "edge computing", "game theory", "resource pricing", "resource scheduling", "propagation delay"], "Abstract": "blockchain came to prominence as the distributed ledger underneath bitcoin which protects the transaction histories in a fully connected peer to peer network. the blockchain mining process requires high computing power to solve a proof of work  pow  puzzle which is hard to implement on users‚äô mobile devices. so these miners may leverage the edge cloud service providers  esps csp  to calculate the pow puzzle. the existing edge assisted blockchain networks assumed that all esps have a uniform propagation delay which is unrealistic. in this article we consider a more practical scene where esps locate in diverse positions of the blockchain network which causes different propagation delays when supporting the computation of the pow puzzle. additionally these esps connect to a remote csp for resource scheduling when the computing tasks exceed their maximum capacity. the blockchain mining process generally involves complicated competition and games among csp esps and miners. each service provider focuses on how to determine his resource price so that he can maximize his utility. according to the set resource price each miner concentrates on scheduling his resource requests for each esp to maximize individual personal utility which depends on esps‚äô resource price and propagation delays. we first model such a resource pricing and scheduling problem as a three stage multi leader multi follower stackelberg game and aim at finding the stackelberg equilibrium. then we analyze the subgame optimization problem in each stage and propose an iterative algorithm based on backward induction to achieve the nash equilibrium of the stackelberg game. finally extensive simulations are conducted to verify the significant performance of the proposed solution.", "Pub Date": "2023-04-07"}