{"Title": "Edge-Enabled Two-Stage Scheduling Based on Deep Reinforcement Learning for Internet of Everything", "Doi": "10.1109/JIOT.2022.3179231", "Authors": ["x. zhou", "w. liang", "k. yan", "w. li", "k. i. -k. wang", "j. ma", "q. jin"], "Key Words": ["deep reinforcement learning", "edge computing", "internet of everything (ioe)", "makespan", "two-stage scheduling"], "Abstract": "nowadays the concept of internet of everything  ioe  is becoming a hotly discussed topic which is playing an increasingly indispensable role in modern intelligent applications. these applications are known for their real time requirements under limited network and computing resources thus it becomes a highly demanding task to transform and compute tremendous amount of raw data in a cloud center. the edge‚äìcloud computing infrastructure allows a large amount of data to be processed on nearby edge nodes and then only the extracted and encrypted key features are transmitted to the data center. this offers the potential to achieve an end‚äìedge‚äìcloud based big data intelligence for ioe in a typical two stage data processing scheme while satisfying a data security constraint. in this study a deep reinforcement learning enhanced two stage scheduling  drl tss  model is proposed to address the np hard problem in terms of operation complexity in end‚äìedge‚äìcloud internet of things systems which is able to allocate computing resources within an edge enabled infrastructure to ensure computing task to be completed with minimum cost. a presorting scheme based on johnson‚äôs rule is developed and applied to preprocess the two stage tasks on multiple executors and a drl mechanism is developed to minimize the overall makespan based on a newly designed instant reward that takes into account the maximal utilization of each executor in edge enabled two stage scheduling. the performance of our method is evaluated and compared with three existing scheduling techniques and experimental results demonstrate the ability of our proposed algorithm in achieving better learning efficiency and scheduling performance with a 1.1 approximation to the targeted optimal ioe applications.", "Pub Date": "2023-02-06"}