{"Title": "Edge-Cloud-Assisted Certificate Revocation Checking: An Efficient Solution Against Irresponsible Service Providers", "Doi": "10.1109/JIOT.2023.3264682", "Authors": ["y. song", "y. zhang", "c. xu", "s. li", "a. yang", "n. cheng"], "Key Words": ["certificate revocation checking (crc)", "edgecloud computing", "irresponsible service provider"], "Abstract": "certificate revocation checking  crc  is a fundamental requirement in certificate based public key cryptographic systems. most existing crc schemes are not tailored for edge cloud computing systems and directly applying these schemes would cause security and efficiency problems. in this article we first propose a two layer edge cloud assisted crc framework dubbed eca crc where edge nodes utilizing a probabilistic checking algorithm serve as a first layer and the cloud server utilizing a deterministic checking algorithm serves as a second layer. both the edge nodes and the cloud server collaboratively provide verifiable crc services for devices. the most prominent manifestations of eca crc are that  1  most crc requests can be processed with the probabilistic checking layer which reduces the checking delay significantly while providing an accurate crc service and 2  devices can detect the irresponsible behavior of the service provider including using an incorrect revoked certificate set  rcs  to compute checking results or procrastinating on updating the rcs as soon as possible. we then propose an efficient instantiation of eca crc dubbed eeca crc by utilizing a merkle hash tree  mht  based homomorphic signature cuckoo filter and othello. we formally prove the security of eeca crc against the irresponsible service provider under the random oracle model. we implement an eeca crc prototype and conduct a comprehensive performance evaluation based on a public certificate database. our results show that 95% of crc requests are completed on the edge nodes and only 5% of crc requests need to be handled by the cloud server.", "Pub Date": "2023-08-23"}