{"Title": "Edge-Assisted Multi-Layer Offloading Optimization of LEO Satellite-Terrestrial Integrated Networks", "Doi": "10.1109/JSAC.2022.3227032", "Authors": ["x. cao", "b. yang", "y. shen", "c. yuen", "y. zhang", "z. han", "h. v. poor", "l. hanzo"], "Key Words": ["satellite-terrestrial integrated network", "leo satellite", "multi-access edge computing", "6g"], "Abstract": "sixth generation  6g  technologies will revolutionize the wireless ecosystem by enabling the delivery of futuristic services through satellite terrestrial integrated networks  stins . as the number of subscribers connected to stins increases it becomes necessary to investigate whether the edge computing paradigm may be applied to low earth orbit satellite  leos  networks for supporting computation intensive and delay sensitive services for anyone anywhere and at any time. inspired by this research dilemma we investigate a leos edge assisted multi layer multi access edge computing  mec  system. in this system the mec philosophy will be extended to leos for defining the leos edge in order to enhance the coverage of the multi layer mec system and address the users‚äô computing problems both in congested and isolated areas. we then design its operating offloading framework and explore its feasible implementation methodologies. in this context we formulate a joint optimization problem for the associated communication and computation resource allocation for minimizing the overall energy dissipation of our leos edge assisted multi layer mec system while maintaining a low computing latency. to solve the optimization problem effectively we adopt the classic alternating optimization  ao  method for decomposing the original problem and then solve each sub problem using low complexity iterative algorithms. finally our numerical results show that the offloading scheme conceived achieves low computing latency and energy dissipation compared to the state of the art solutions a single layer mec supported by leos or base stations  bs .", "Pub Date": "2023-01-18"}