{"Title": "Edge-Based Computation of Super-Resolution Superlet Spectrograms for Real-Time Estimation of Heart Rate Using an IoMT-Based Reference-Signal-Less PPG Sensor", "Doi": "10.1109/JIOT.2023.3322947", "Authors": ["pankaj", "a. kumar", "m. kumar", "r. komaragiri"], "Key Words": ["edge computing", "healthcare devices", "heart rate (hr) estimation", "internet of medical things (iomt) sensor", "photoplethysmogram (ppg)", "super-resolution", "wearable device"], "Abstract": "cardiovascular disease  cvd  is one of the leading causes of the mortality rate increase. to effectively analyze wearable sensor data for providing accurate and reliable estimation of vital signs such as heart rate  hr  the use of artificial intelligence  ai  in wearable devices is increasing. the use of ai in designing healthcare wearable sensors is crucial to the uprising of the internet of medical things  iomt . the appearance of iomt sensor technologies lets the healthcare industry shift from vis a vis consulting to telemedicine. iomt sensors have transformed the healthcare industry by improving patient safety and reducing healthcare costs. this article proposes a photoplethysmogram  ppg  enabled wearable device in an edge iomt computing environment that enables users to monitor their real time health status. a deep learning approach for automatic feature extraction is proposed in this work. the deep learning algorithm learns features from a super resolution spectrogram computed using superlet transform. in the proposed system a ppg signal is input and the output layer provides information on hr. the proposed framework uses two publicly available ppg data sets to train and test the proposed edge assisted model. the model is further evaluated using an in house acquired ppg signal data set. the proposed framework obtained a mean absolute error of 0.76 1.01 1.46 and 1.79 bpm for ieee signal processing cup 2015  ieee spc  training ieee spc test bami i and bami ii data sets respectively. the proposed edge based iomt framework satisfactorily predicts hr in real time using reference signal less ppg sensor signal.", "Pub Date": "2024-02-21"}