{"Title": "Edge Learning for 6G-Enabled Internet of Things: A Comprehensive Survey of Vulnerabilities, Datasets, and Defenses", "Doi": "10.1109/COMST.2023.3317242", "Authors": ["m. a. ferrag", "o. friha", "b. kantarci", "n. tihanyi", "l. cordeiro", "m. debbah", "d. hamouda", "m. al-hawawreh", "k. -k. r. choo"], "Key Words": ["edge learning", "6g", "iot", "federated learning", "ai vulnerabilities", "security"], "Abstract": "the deployment of the fifth generation  5g  wireless networks in internet of everything  ioe  applications and future networks  e.g. sixth generation  6g  networks  has raised a number of operational challenges and limitations for example in terms of security and privacy. edge learning is an emerging approach to training models across distributed clients while ensuring data privacy. such an approach when integrated in future network infrastructures  e.g. 6g  can potentially solve challenging problems such as resource management and behavior prediction. however edge learning  including distributed deep learning  are known to be susceptible to tampering and manipulation. this survey article provides a holistic review of the extant literature focusing on edge learning related vulnerabilities and defenses for 6g enabled internet of things  iot  systems. existing machine learning approaches for 6g‚äìiot security and machine learning associated threats are broadly categorized based on learning modes namely  centralized federated and distributed. then we provide an overview of enabling emerging technologies for 6g‚äìiot intelligence. we also provide a holistic survey of existing research on attacks against machine learning and classify threat models into eight categories namely  backdoor attacks adversarial examples combined attacks poisoning attacks sybil attacks byzantine attacks inference attacks and dropping attacks. in addition we provide a comprehensive and detailed taxonomy and a comparative summary of the state of the art defense methods against edge learning related vulnerabilities. finally as new attacks and defense technologies are realized new research and future overall prospects for 6g enabled iot are discussed.", "Pub Date": "2023-11-21"}