{"Title": "Edge/Cloud Infinite-Time Horizon Resource Allocation for Distributed Machine Learning and General Tasks", "Doi": "10.1109/TNSM.2023.3312593", "Authors": ["i. sartzetakis", "p. soumplis", "p. pantazopoulos", "k. v. katsaros", "v. sourlas", "e. varvarigos"], "Key Words": ["cloud and edge computing", "distributed computing", "distributed machine learning", "inference", "training", "resource allocation"], "Abstract": "edge computing has emerged as a computing paradigm where the application and data processing takes place close to the end devices. it decreases the distances over which data transfers are made offering reduced delay and fast speed of action for general data processing and store retrieve jobs. the benefits of edge computing can also be reaped for distributed computation algorithms where the cloud also plays an assistive role. in this context an important challenge is to allocate the required resources at both edge and cloud to carry out the processing of data that are generated over a continuous  ‚äúinfinite‚äù  time horizon. this is a complex problem due to the variety of requirements  resource needs accuracy delay etc.  that may be posed by each computation algorithm as well as the heterogeneous resources‚äô features  e.g. processing bandwidth . in this work we develop a solution for serving weakly coupled general distributed algorithms with emphasis on machine learning algorithms at the edge and or the cloud. we present a dual objective integer linear programming formulation that optimizes monetary cost and computation accuracy. we also introduce efficient heuristics to perform the resource allocation. we examine various distributed ml allocation scenarios using realistic parameters from actual vendors. we quantify trade offs related to accuracy performance and cost of edge cloud bandwidth and processing resources. our results indicate that among the many parameters of interest the processing costs seem to play the most important role for the allocation decisions. finally we explore interesting interactions between target accuracy monetary cost and delay.", "Pub Date": "2024-02-07"}