{"Title": "EdgeMatch: A Smart Approach for Scheduling IoT-Edge Tasks With Multiple Criteria Using Game Theory", "Doi": "10.1109/ACCESS.2024.3350556", "Authors": ["a. bandyopadhyay", "v. mishra", "s. swain", "k. chatterjee", "s. dey", "s. mallik", "a. al-rasheed", "m. abbas", "b. o. soufiene"], "Key Words": ["edge computing", "iot", "fog computing", "resource allocation", "game theory", "matching algorithm", "centralized matching", "distributed matching"], "Abstract": "for an extended period a technological architecture known as cloud iot links iot devices to servers located in cloud data centers. real time data analytic are made possible by this enabling better data driven decision making optimization and risk reduction. since cloud systems are often located at a considerable distance from iot devices the rise of time sensitive iot applications has driven the requirement to extend cloud architecture for timely delivery of critical services. balancing the allocation of iot services to appropriate edge nodes while guaranteeing low latency and efficient resource utilization remains a challenging task. since edge nodes have lower resource capabilities than the cloud. the primary drawback of current methods in this situation is that they only tackle the scheduling issue from one side. task scheduling plays a pivotal role in various domains including cloud computing operating systems and parallel processing enabling effective management of computational resources. in this research we provide a multiple factor autonomous iot edge scheduling method based on game theory to solve this issue. our strategy involves two distinct scenarios. in the first scenario we introduced an algorithm containing choices for the iot and edge nodes allowing them to evaluate each other using factors such as delay and resource usage. the second scenario involves both a centralized and a distributed scheduling approach leveraging the matching concept and considering each other. in addition we also introduced a preference based stable mechanism  pbsm  algorithm for resource allocation. in terms of the execution time for iot services and the effectiveness of resource consolidation for edge nodes the technique we use achieves better results compared with the two commonly used min min and max min scheduling algorithms.", "Pub Date": "2024-01-17"}