{"Title": "Edge ML Technique for Smart Traffic Management in Intelligent Transportation Systems", "Doi": "10.1109/ACCESS.2024.3365930", "Authors": ["a. hazarika", "n. choudhury", "m. m. nasralla", "s. b. a. khattak", "i. u. rehman"], "Key Words": ["edge computing", "ieee 802.15.4 dsme mac", "internet of things (iot)", "lora", "lorawan", "machine learning", "yolo"], "Abstract": "in urban traffic a dynamic traffic light system  dtls  is an important aspect of automatic driving. dtls estimates the time of the light signal from images of dynamically changing road traffic. in conventional traffic light systems light signals are enabled at predefined or fixed time intervals without having information on the current traffic density on the road. this static behavior of the traffic light system increases unnecessary waiting time on the road eventually creating traffic jams environmental pollution and other health emergencies. the smart traffic light system addresses these issues with self learning algorithms and dynamically allows traffic to pass by learning current traffic density. in this paper a vision based dtls is proposed using the yolo  you only look once  object detection algorithm that detects and counts the total number of vehicles on the roads of a traffic signal junction. the traffic signals are tuned based on the computed traffic to minimize the overall delay at that junction. moreover the traffic junctions are facilitated to communicate with the adjacent junctions to transmit the cumulative traffic delay observed. this delay is used to prioritize traffic passing through salient blocks like schools offices hospitals etc. the paper aims to minimize the overhead incurred in both computations of traffic  using approximate computing  and in communication networks  using low power technologies of ieee 802.15.4 standard specifically dsme mac and or lorawan . the proposed system accomplishes its objective of smart city infrastructure by optimizing the traffic flow. further the paper provides a mechanism for green traffic corridors for emergency vehicles.", "Pub Date": "2024-02-21"}