{"Title": "Effect of Calculating Pointwise Mutual Information using a Fuzzy Sliding Window in Topic Modeling", "Doi": "10.1109/FUZZ52849.2023.10309675", "Authors": ["e. rijcken", "k. zervanou", "m. spruit", "f. scheepers", "u. kaymak"], "Key Words": ["natural language processing", "distributional hypothesis", "fuzzy sliding window", "topic modeling"], "Abstract": "topic modeling is a popular method for analysing large amounts of unstructured text data and extracting meaningful insights. the coherence of the generated topics is a critical metric for determining the model quality and measuring the semantic relatedness of the words in a topic. the distributional hypothesis a fundamental theory in linguistics states that words occurring in the same contexts tend to have similar meanings. based on this theory word co occurrence in a given context is often used to reflect word association in coherence scores. to this end many coherence scores use normalised pointwise mutual information  npmi  which uses a sliding window to describe the neighbourhood that defines the context. it is assumed that there is no other structure in the neighbourhood except for the presence of words. inspired by the distributional hypothesis we hypothesise the word distance to be relevant for determining the word association. hence we propose using a fuzzy sliding window to define a neighbourhood in which the association between words depends on the membership of the words in the fuzzy sliding window. to this end we propose fuzzy normalized pointwise mutual information  fnpmi  to calculate fuzzy coherence scores. we implement two different neighbourhood structures by the definition of the membership function of the sliding window. in the first implementation the association between two words correlates positively with the distance whereas the correlation is negative in the second. we compare the correlation of our proposed new coherence metrics with human judgment. we find that the use of a fuzzy sliding window correlates less with human judgment than a crisp sliding window. this finding indicates that word distance within a window is less important than defining the window size itself.", "Pub Date": "2023-11-09"}