{"Title": "Efficient Offline/Online Heterogeneous-Aggregated Signcryption Protocol for Edge Computing-Based Internet of Vehicles", "Doi": "10.1109/TITS.2023.3296974", "Authors": ["i. ali", "y. chen", "j. li", "a. wakeel", "c. pan", "n. ullah"], "Key Words": ["internet of vehicles", "heterogeneous signcryption", "offline/online", "edge computing"], "Abstract": "the internet of vehicles  iov  which is an extension of traditional vehicular ad hoc networks  vanets  ensures the provision of safe and efficient vehicular communications. however the burgeoning iov faces several challenges in terms of traffic information security and vehicle identity privacy during wireless transmission. generally vehicles move faster on the highway necessitating the use of reliable technology to communicate with infrastructure on the roadside efficiently and securely. lately researchers have proposed several different message dissemination methods for vehicle to infrastructure  v2i  communications. however they suffer from different concerns  i.e. security weaknesses computationally heavy and high communication storage overhead   therefore they are unreliable for delay sensitive communications. to cope with this we come up with an enhanced certificateless and identity based offline online heterogeneous signcryption  cioohsc  protocol for v2i communications in edge computing based iov to simultaneously achieve confidentiality integrity authentication non repudiation and identity anonymity in a logically single step. the cioohsc protocol allows a vehicle in certificateless cryptography to transmit a message to an edge node in identity based cryptography. in the online phase there are no point multiplication operations as they are already carried out in the offline phase. this reduces the computational load considerably in the online phase. furthermore our protocol enables the edge node to aggregate multiple messages and process them simultaneously to boost performance. the cioohsc protocol‚äôs security is proved in the random oracle model under the hard problems‚äô assumptions. our protocol outperforms recent similar schemes in terms of computational complexity communication storage overhead and average transmission delay according to the performance evaluation findings.", "Pub Date": "2023-12-01"}