{"Title": "Efficient Blockchain-Based Pseudonym Authentication Scheme Supporting Revocation for 5G-Assisted Vehicular Fog Computing", "Doi": "10.1109/ACCESS.2024.3372390", "Authors": ["b. a. mohammed", "m. a. al-shareeda", "a. a. alsadhan", "z. g. al-mekhlafi", "a. a. sallam", "b. a. al-qatab", "m. t. alshammari", "a. m. alayba"], "Key Words": ["blockchain", "revocation", "fog server", "pseudonym authentication", "fifth generation(5g)", "vehicular fog computing"], "Abstract": "the driving experience in fifth generation  5g  assisted vehicular fog computing systems has improved thanks to recent advancements in intelligent transportation. however in the present vehicular system setup the phenomenon of providing low computation overhead with massive serving capability is crucial. in the existing scenario the computational complexity rises when an authenticated driver travels from one roadside unit  rsu  area to another rsu region and must undergo re authentication by the existing rsu. in this paper an efficient blockchain based pseudonym authentication scheme to address these issues and avoiding using rsu for 5g assisted vehicular fog computing. the pseudonym identity generated for each vehicles and fog servers in order to exchange information about the road environment. the proposed scheme avoids re authentication by the future fog server by utilising bilinear pairing of points on the elliptic curve and utilising blockchain technology without the need for a trusted authority. for fog computing fog server obtains the verification key to authenticate the messages sent from vehicles for supporting revocation. the security analysis part of this work shows that the proposed scheme is not only satisfy requirements of security and privacy but also resistance security attacks. finally the evaluation of the proposed scheme‚äôs performance shows that it is more efficient than existing schemes with regards to computation cost verification speed and energy consumption.", "Pub Date": "2024-03-07"}