{"Title": "Efficient Dataset Preparation Techniques for Regional/Marathi Language Analysis: Creating Customized Dataset for Regional Language/Marathi Language Text Analysis", "Doi": "10.1109/SICTIM56495.2023.10104666", "Authors": ["s. sirsat", "n. zulpe"], "Key Words": ["regional language sentiment analysis (rlsa)", "regional language natural language processing (rnlp)", "natural language understanding(nlu)", "natural language generation (nlg)"], "Abstract": "regional language contents are the key to globalization of any successful internet based business model. looking at the huge population interested in accessing the internet using their mother tongue or regional language is the new normal. this regional language contents on social media and word wide web pages fetched the attention of a large chunk of business analysts data scientists and social reformists to understand the regional language sentiments through this humongous amount of regional language opinionated text. regional language sentiment analysis or marathi language sentiment analysis will be possible if one can create a dataset which can face text analytics language challenges like uniformity syntactic and semantic challenges of regional language. this study is a small attempt to create a basic dataset capable of facing future regional language sentiment analysis or marathi language sentiment analysis based on nlp and sa based algorithmic approaches. this study will try to generate a marathi language dataset from social media opinionated text and web scraping of a marathi language webpage. all the technical issues associated with generating regional language or marathi language dataset will be recorded rectified and relatively refined through rigorous iterations to make the dataset future ready marathi language sentiment analysis. this study will try to understand the needs of regional sentiment analysis requirements in terms of dataset the best suitable file structure and efficient way of creating and customizing the marathi text dataset in order to make it natural language processing  nlp  and sentiment analysis sa ready for future studies in continuation.", "Pub Date": "2023-04-20"}