{"Title": "Efficient Dimensionality Reduction Strategies for Quantum Reinforcement Learning", "Authors": ["e. andr√©s", "m. p. cu√©llar", "g. navarro"], "Pub Date": "2023-10-02", "Abstract": "quantum neural networks constitute one of the most promising applications of quantum machine learning as they leverage both the capabilities of classical neural networks and the unique advantages of quantum mechanics. moreover quantum mechanics has demonstrated its ability to detect atypical patterns in data that are challenging for classical approaches to recognize. however despite their potential there are still open questions such as barren plateau phenomenon and the challenges of scalability and the curse of dimensionality which become particularly relevant in reinforcement learning  rl  when working in environments with high dimensional state and action spaces. this study delves into the critical realm of representing classical data as quantum states a topic of keen interest across the scientific community. the aim is to construct streamlined circuits for efficient execution on quantum computers and simulators using minimal qubits and entanglement gates to evade barren plateau phenomena and reducing computational times. our investigation examines and validates the efficacy of three strategies for data management and dimensionality reduction in real world large scale environments for quantum reinforcement learning particularly in energy efficiency scenarios. the techniques encompass amplitude encoding linear layer preprocessing and data reuploading supplemented by trainable parameters. this research sheds light on the potential of quantum machine learning in enhancing real world environments including energy efficiency scenarios and showcases the capabilities of quantum neural networks in the reinforcement learning landscape.", "Doi": "10.1109/ACCESS.2023.3318173", "Key Words": ["energy efficiency", "quantum neural networks", "quantum encoding", "quantum reinforcement learning", "variational quantum circuits"]}