{"Title": "Efficient Quantum Image Classification Using Single Qubit Encoding", "Authors": ["p. easom-mccaldin", "a. bouridane", "a. belatreche", "r. jiang", "s. al-maadeed"], "Pub Date": "2024-02-05", "Abstract": "the domain of image classification has been seen to be dominated by high performing deep learning  dl  architectures. however the success of this field as seen over the past decade has resulted in the complexity of modern methodologies scaling exponentially commonly requiring millions of parameters. quantum computing  qc  is an active area of research aimed toward greatly reducing problems of complexity faced in classical computing. with growing interest toward quantum machine learning  qml  for applications of image classification many proposed algorithms require usage of numerous qubits. in the noisy intermediate scale quantum  nisq  era these circuits may not always be feasible to execute effectively  therefore we should aim to use each qubit as effectively and efficiently as possible before adding additional qubits. this article proposes a new single qubit based deep quantum neural network for image classification that mimics traditional convolutional neural network  cnn  techniques resulting in a reduced number of parameters compared with previous works. our aim is to prove the concept of the initial proposal by demonstrating classification performance of the single qubit based architecture as well as to provide a tested foundation for further development. to demonstrate this our experiments were conducted using various datasets including mnist fashion mnist and orl face datasets. to further our proposal in the context of the nisq era our experiments were intentionally conducted in noisy simulation environments. initial test results appear promising with classification accuracies of 94.6% 89.5% and 82.5% achieved on the subsets of mnist fmnist and orl face datasets respectively. in addition proposals for further investigation and development were considered where it is hoped that these initial results can be improved.", "Doi": "10.1109/TNNLS.2022.3179354", "Key Words": ["quantum convolutional neural networks (cnns)", "quantum deep learning (dl)", "quantum facial biometrics", "single-qubit encoding"]}