{"Title": "Efficient Dynamic Distributed Resource Slicing in 6G Multi-Access Edge Computing Networks With Online ADMM and Message Passing Graph Neural Networks", "Doi": "10.1109/TMC.2023.3262514", "Authors": ["a. asheralieva", "d. niyato", "y. miyanaga"], "Key Words": ["6g", "deep learning", "dynamic combinatorial optimization", "graph neural networks", "graph theory", "mathematical decomposi-tion", "multi-access edge computing", "network slicing", "space-air-ground-sea networks", "ultra-reliable low-latency communi-cations"], "Abstract": "we consider the problem of resource slicing in the 6th generation multi access edge computing  6g mec  network. the network includes many non stationary space air ground sea nodes with dynamic unstable connections and resources where any node can be in one of two hidden states  i  reliable ‚äì when the node generates propagates no data errors  ii  unreliable ‚äì when the node can generate propagate random errors. we show that solving this problem is challenging since it represents a non deterministic polynomial time  np  hard dynamic combinatorial optimization problem depending on the unknown distribution of hidden nodes‚äô states and time varying parameters  connections and resources of nodes  which can only be observed locally. to tackle these challenges we develop a new deep learning  dl  model based on the message passing graph neural network  mpnn  to estimate hidden nodes‚äô states in dynamic network environments. we then propose a novel algorithm based on the integration of mpnn based dl and online alternating direction method of multipliers  admm  ‚äì extension of the well known classical ‚äústatic‚äù admm to dynamic settings where the slicing problem is solved distributedly in real time based on local information. we prove that our algorithm converges to a global optimum of our problem with a superior performance even in the highly dynamic unreliable scenarios.", "Pub Date": "2024-03-07"}