{"Title": "Efficient Real-Time Smart Keyword Spotting Using Spectrogram-Based Hybrid CNN-LSTM for Edge System", "Doi": "10.1109/ACCESS.2024.3380350", "Authors": ["i. syafalni", "c. amadeus", "n. sutisna", "t. adiono"], "Key Words": ["edge computing", "hybrid cnn-lstm", "keyword spotting", "real-time", "embedded devices"], "Abstract": "keyword spotting  kws  is the task of recognizing spoken command words from a database. with recent application human machine interactions kws systems require real time performance where edge computing is a preferable option. to allow kws systems to work on fast and real time implementation a low complexity yet high accurate artificial intelliegence model is mandatory. in this paper we propose a comprehensive voice command recognition system design and its hardware implementation. the proposed artificial intelliegence model considered in this system is spectronet based and an efficient hybrid cnn lstm architecture with low complexity. jetson xavier nx is an edge device because of its strong computational power as an embedded device. the implementation result shows the proposed method offers quite good in terms of accuracy indicated by no accuracy drop between the model implemented in pc and jetson xavier. however the inference time is quite high which is 180 ms step. to improve the speed of the system the tensorrt library is used to further optimize the model. optimization of the model is found effective reducing 59.35% of the total operation performed in spectronet when fp32 precision is used and 59.63% when fp16 precision is used. the model is also sped up by 45% if fp32 precision mode is used and 62% if fp16 precision mode is used. however there is a slight accuracy drop of 2.68% if fp32 precision mode is used and 4.84% if fp16 precision mode is used. this slight drop in accuracy is considered negligible compared to the performance boost that tensorrt gives. the work is useful for intelligent control systems such as smart vehicles smartphones computers and smart communications.", "Pub Date": "2024-03-27"}