{"Title": "Efficient Algorithms for Service Chaining in NFV-Enabled Satellite Edge Networks", "Doi": "10.1109/TMC.2023.3312352", "Authors": ["q. xia", "g. wang", "z. xu", "w. liang", "z. xu"], "Key Words": ["approximation and online algorithms", "mobile edge computing", "network function chaining", "satellite edge network"], "Abstract": "satellite terrestrial networks are emerging as the next generation networking paradigm for beyond 5 g  b5g  and 6 g networks. meanwhile mobile edge computing  mec  is envisioned as the key technology to provide network services within the proximity of users by deploying computing resource in ground locations that are close to users. with the fast deployment of low earth oribt  leo  satellites a new paradigm of mec is emerging by enabling leo satellites serving as edge servers in lower orbits that are close to ground users. in this way the ground users can be further served by leo satellites in lower orbits instead of conventional high orbit satellites. also since leo satellites provide shorter paths from users to services the performance is enhanced compared with ground mec networks. in this paper we aim to enable low latency network services in a satellite edge computing  sec  network that integrates the mec and satellite terrestrial networks. in particular we consider that each network service is composed of a sequence of virtualized network functions  vnfs  where the traffic of user requests has to be processed by the vnfs in a service chain in the specified order before reaching its destination. to this end we first formulate a delay aware service chaining problem in an sec network to minimize the average delay of implementing a user request by jointly placing vnfs to leo satellites in the sec network and routing the traffic of each user request from its source to destination. we then devise an approximation algorithm with an approximation ratio for the problem in an sec network with a single user request by devising a novel concept of chaining orbit and auxiliary graph construction technique. we also design an online algorithm for the online delay aware service chaining problem in an sec network if user requests arrive into the system without the knowledge of their arrivals and the network delays are uncertain. we finally evaluate the performance of the proposed algorithms using real satellite network topologies and results show that the proposed algorithms achieve 28.5% lower delay than their counterparts.", "Pub Date": "2024-04-04"}