{"Title": "EG-Four$\\mathbb {Q}$: An Embedded GPU-Based Efficient ECC Cryptography Accelerator for Edge Computing", "Doi": "10.1109/TII.2022.3205355", "Authors": ["j. dong", "p. zhang", "k. sun", "f. xiao", "f. zheng", "j. lin"], "Key Words": ["cryptographic engineering", "edge computing", "elliptic curve cryptography (ecc)", "embedded gpu", "industry 4.0"], "Abstract": "with the continuous development of industry 4.0 technology the embedded devices in industrial internet of things  iiot  are showing explosive growth and large scale cyber attacks or related security incidents continue to sound the alarm bell of information security. iiot has strict requirements on computing performance and energy consumption which poses severe challenges to cryptographic algorithms especially public key cryptographic algorithms with high computational complexity. embedded graphic processing unit  gpu  devices always as edge computing nodes or ai accelerators are widely deployed in iiot applications. in this article we propose an embedded gpu based four$\\mathbb {q}$  eg four$\\mathbb {q}$  elliptic curve public key cryptographic acceleration scheme. as far as we know eg four$\\mathbb {q}$ is the first work to completely implement four$\\mathbb {q}$ on the gpu platforms including finite field operations point arithmetic and scalar multiplication. relying only on 36 w power consumption our scalar multiplication performance reaches 1717 kops s with the latency of 2.38 ms. in terms of the energy efficiency ratio eg four$\\mathbb {q}$ has significant advantages over other platforms such as advanced risc machines  arm  cpu intel cpu field programmable gate array  fpga  and desktop gpus. the throughput of eg four$\\mathbb {q}$ is 1.75 times that of the fastest elliptic curve cryptography implementation based on the same platform and even exceeds the performance of intel top server cpu e5 2699v3  18 core . based on the embedded gpu xavier eg four$\\mathbb {q}$ can act as a cryptographic edge computing module or even a cloud cryptographic accelerator providing more efficient elliptic curve cryptographic services for iiot.", "Pub Date": "2023-05-24"}