{"Title": "Elastic Resource Allocation for Coded Distributed Computing Over Heterogeneous Wireless Edge Networks", "Doi": "10.1109/TWC.2022.3213256", "Authors": ["c. t. nguyen", "d. n. nguyen", "d. t. hoang", "k. t. phan", "d. niyato", "h. -a. pham", "e. dutkiewicz"], "Key Words": ["coded distributed computing", "maximum distance separable code", "resource allocation", "inlp", "lyapunov optimization", "edge computing", "straggling effects"], "Abstract": "coded distributed computing  cdc  has recently emerged to be a promising solution to address the straggling effects in conventional distributed computing systems. by assigning redundant workloads to the computing nodes cdc can significantly enhance the performance of the whole system. however since the core idea of cdc is to introduce redundancies to compensate for uncertainties it may lead to a large amount of wasted energy at the edge nodes. it can be observed that the more redundant workload added the less impact the straggling effects have on the system. however at the same time the more energy is needed to perform redundant tasks. in this work we develop a novel framework namely cera to elastically allocate computing resources for cdc processes. particularly cera consists of two stages. in the first stage we model a joint coding and node selection optimization problem to minimize the expected processing time for a cdc task. since the problem is np hard we propose a linearization approach and a hybrid algorithm to quickly obtain the optimal solutions. in the second stage we develop a smart online approach based on lyapunov optimization to dynamically turn off straggling nodes based on their actual performance. as a result wasteful energy consumption can be significantly reduced with minimal impact on the total processing time. simulations using real world datasets have shown that our proposed approach can reduce the system‚äôs total processing time by more than 200% compared to that of the state of the art approach even when the nodes‚äô actual performance is not known in advance. moreover the results have shown that cera‚äôs online optimization stage can reduce the energy consumption by up to 37.14% without affecting the total processing time.", "Pub Date": "2023-04-10"}