{"Title": "ELight: Toward Efficient and Aging-Resilient Photonic In-Memory Neurocomputing", "Authors": ["h. zhu", "j. gu", "c. feng", "m. liu", "z. jiang", "r. t. chen", "d. z. pan"], "Pub Date": "2023-02-17", "Abstract": "optical phase change material  pcm  has emerged promising to enable photonic in memory neurocomputing in optical neural network  onn  designs. however massive photonic tensor core  ptc  reuse is required to implement large matrix multiplication due to the limited single core scale. the resultant large number of pcm writes during inference incurs serious dynamic energy costs and overwhelms the fragile pcm with limited write endurance causing the severe aging issue. moreover the aged pcm would distort the stored value and significantly degrade the reliability of ptc. in this work we propose a holistic solution elight to tackle both the aging issue and the post aging reliability issue where a proactive aging aware optimization framework minimizes the overall pcm write cost and a post aging tolerance scheme overcomes the effect of aged pcm. specifically in the aging aware optimization part we propose write aware training to encourage the similarity among weight blocks and combine it with a post training optimization technique to reduce programming efforts by eliminating redundant writes. next an efficient groupwise row based weight ptc remapping scheme is introduced to tolerate the reprogrammability degradation due to the aged pcm. experiments show that elight can achieve over  $20 \\times $  reductions in the total number of write operations and dynamic energy cost with comparable accuracy. moreover elight can guarantee significant accuracy recovery under the aged pcm within photonic memories. with our elight photonic in memory neurocomputing will step forward toward practical applications in machine learning with order of magnitude longer lifetime lower programming energy cost and significant resilience against pcm aging effects.", "Doi": "10.1109/TCAD.2022.3180969", "Key Words": ["fault tolerance", "neural network hardware", "optical computing", "photonic in-memory computing", "phase change materials (pcms)", "robustness"]}