{"Title": "EMAHA-DB1: A New Upper Limb sEMG Dataset for Classification of Activities of Daily Living", "Authors": ["n. k. karnam", "a. c. turlapaty", "s. r. dubey", "b. gokaraju"], "Pub Date": "2023-06-26", "Abstract": "in this article we present electromyography analysis of human activity database 1  emaha db1  a novel dataset of multichannel surface electromyography  semg  signals to evaluate the activities of daily living  adl . the dataset is acquired from 25 non disabled subjects while performing 22 activities categorized according to functional arm activity behavioral observation system  faabos   three full hand gestures six open close office draw eight grasping and holding of small office objects two flexion and extension of finger movements two writing and one rest . the semg data is measured by a set of five noraxon ultium wireless semg sensors with ag agcl electrodes placed on a human hand. the dataset is analyzed for hand activity recognition classification performance. the classification is performed using six state of the art machine learning classifiers including random forest  rf  fine  $k$  nearest neighbor  knn  ensemble knn  sknn  linear discriminant analysis  lda  support vector machines  svms  and a hybrid deep learning architecture of convolutional neural network  cnn  and bidirectional long short term memory  bi lstm  layers. in the classical methods ten combinations of time domain and frequency domain feature sets are analyzed. the state of the art classification accuracy on five faabos categories is 83.21% by using the svm classifier with the third order polynomial kernel using energy feature and auto regressive feature set ensemble. the classification accuracy on 22 class hand activities is 75.39% by the same svm classifier with the log moments in the frequency domain  lmf  feature modified lmf time domain statistical  tds  feature spectral band powers  sbps  channel cross correlation and local binary patterns  lbps  set ensemble. the analysis depicts the technical challenges addressed by the dataset. the developed dataset can be used as a benchmark for various classification methods as well as for semg signal analysis corresponding to adl and for the development of prosthetics and other wearable robotics.", "Doi": "10.1109/TIM.2023.3279873", "Key Words": ["activities of daily living (adl)", "classification algorithms", "dataset and benchmark", "features", "machine learning", "surface electromyography (semg)"]}