{"Title": "Emulating Quantum Circuits With Generalized Ising Machines", "Authors": ["s. chowdhury", "k. y. √áamsari", "s. datta"], "Pub Date": "2023-10-26", "Abstract": "the primary objective of this paper is to present an exact and general procedure for mapping any sequence of quantum gates onto a network of probabilistic p bits which can take on one of two values 0 and 1. the first  $n$  p bits represent the input qubits while the other p bits represent the qubits after the application of successive gating operations. we can view this structure as a boltzmann machine whose states each represent a feynman path leading from an initial configuration of qubits to a final configuration. each such path has a complex amplitude  $\\psi $  which can be associated with a complex energy. the real part of this energy can be used to generate samples of feynman paths in the usual way while the imaginary part is accounted for by treating the samples as complex entities unlike ordinary boltzmann machines where samples are positive. quantum gates often have purely imaginary energy functions for which all configurations have the same probability and one cannot take advantage of sampling techniques. typically this would require us to collect  $2^{nd}$  samples which would severely limit its utility. however if we can use suitable transformations to introduce a real part in the energy function then powerful sampling algorithms like gibbs sampling can be harnessed to get acceptable results with far fewer samples and perhaps even escape the exponential scaling with  $nd$ . this algorithmic acceleration can then be supplemented with special purpose hardware accelerators like ising machines which can obtain a very large number of samples per second through a combination of massive parallelism pipelining and clockless mixed signal operation made possible by codesigning circuits and architectures to match the algorithm. our results for mapping an arbitrary quantum circuit to a boltzmann machine with a complex energy function should help push the boundaries of the simulability of quantum circuits with probabilistic resources and compare them with nisq era quantum computers.", "Doi": "10.1109/ACCESS.2023.3323847", "Key Words": ["hardware accelerators", "ising machines", "massive parallelism", "p-bits", "quantum circuits", "feynman path", "monte carlo"]}