{"Title": "Enabling Balanced Data Deduplication in Mobile Edge Computing", "Doi": "10.1109/TPDS.2023.3247061", "Authors": ["r. luo", "h. jin", "q. he", "s. wu", "x. xia"], "Key Words": ["data deduplication", "edge storage system", "mobile edge computing", "optimization problem", "storage resource balance"], "Abstract": "in the mobile edge computing  mec  environment edge servers with storage and computing resources are deployed at base stations within users‚äô geographic proximity to extend the capabilities of cloud computing to the network edge. edge storage system  ess  is comprised by connected edge servers in a specific area which ensures low latency services for users. however high data storage overheads incurred by edge servers‚äô limited storage capacities is a key challenge in ensuring the performance of applications deployed on an ess. data deduplication as a classic data reduction technology has been widely applied in cloud storage systems. it also offers a promising solution to reducing data redundancy in esss. however the unique characteristics of mec such as edge servers‚äô geographic distribution and coverage render cloud data deduplication mechanisms obsolete. in addition data distribution must be balanced over edge storage systems to accommodate future data demands which cannot be undermined by data deduplication. thus balanced edge data deduplication  bedd  must consider deduplication ratio data storage benefits and resource balance systematically under the latency constraint. in this article we model the novel bedd problem formally and prove its $\\mathcal {np}$np hardness. then we propose an optimal approach for solving the bedd problem exactly in small scale scenarios and a sub optimal approach to solve large scale bedd problems with a theoretical performance guarantee. extensive and comprehensive experiments conducted on a real world dataset demonstrate the significant performance improvements of our approaches against four representative approaches.", "Pub Date": "2023-03-17"}