{"Title": "Enabling Energy-Efficient In-Memory Computing With Robust Assist-Based Reconfigurable Sense Amplifier in SRAM Array", "Doi": "10.1109/JETCAS.2023.3243192", "Authors": ["k. soundrapandiyan", "s. k. vishvakarma", "b. s. reniwal"], "Key Words": ["assist device", "sense amplifier", "in memory computing", "digital boolean logic"], "Abstract": "with the increasing gap between processing speed and memory bandwidth necessity for in near memory computing has emerged to ensure high performance energy efficient computing for data intensive applications at the edge. this work proposes a feasible sram compute cache with a sense amplifier  sa  based approach to perform in /near memory boolean computations with a novel reconfigurable assist sense amplifier  rasa . the rasa exploits assist transistors to achieve nand nor and xnor operations without affecting the transparency of normal read leading to fast and reliable sensing with only one sa. this effectively eliminates the need for two sas in comparison to state of the art solutions. the proposed work improves memory density and reduces cost per bit by leveraging the sa based approach because existing solutions lead to significant area overhead cell which reflects overhead multiply by the number of cells column. the rasa provides flexibility to accommodate more cells per column at the architecture level. extensive monte carlo analysis is performed to verify the feasibility of the proposed circuit in commercial 65nm umc technology under iso sa area and iso yield conditions. simulations indicate a 34.34% 84.87% 81.21% 75.46% improvement in energy and a 71.30% 43.36% 32.49% 17.44% improvement in throughput leading to a reduction of 60.97% 91.37% 87.22% 79.62% in energy delay product with respect to clsa  dong et al. 2018  csram  chen et al. 2021  rrcsa  rajput et al. 2022  and the adsa  agrawal et al. 2018  respectively. an improvement in the area of sa by 36.512% is achieved with respect to rrcsa.", "Pub Date": "2023-03-22"}