{"Title": "Enabling Digital Transformation through Business Text Classification with Small Datasets", "Doi": "10.1109/IIT59782.2023.10366487", "Authors": ["m. arslan", "c. cruz"], "Key Words": ["business", "digital transformation", "gpt", "natural language processing (nlp)", "text classification"], "Abstract": "digital transformation represents a complex process that entails the complete reconfiguration of an organization to harness the full potential of technology on a grand scale aiming to deliver maximum value. to illustrate this transformative journey we present a real world case study centered around a company ambitious pursuit to modernize its manual business text classification processes by embracing automated machine based methods. during our endeavor we encountered an imbalanced dataset provided by the business company with certain categories containing only a few text examples while others had a substantial number of them. to rectify this imbalance we balanced the dataset by removing excessive text examples resulting in a more manageable and smaller dataset. to use it we thoroughly evaluated four multilabel text classification methods  binary relevance classifier chains label powerset and generative pre trained transformer  gpt  i.e. a large language model developed by openai. the results of our investigation unveiled a success for the gpt based approach which significantly outperformed its counterparts across vital performance metrics including accuracy f1 score precision and recall. this outcome is particularly noteworthy because it showcases the remarkable effectiveness of gpt based models in multi label text classification tasks even when dealing with relatively small datasets. in contrast the other methods binary relevance classifier chains and label powerset didn't demonstrate competence and exhibited comparatively less impressive performance levels. notably these traditional methods typically rely on larger datasets for training making them less suitable for scenarios where data availability is limited. these findings underscore the power of gpt based models in text classification tasks with small datasets making them valuable assets for businesses in the complex landscape of digital transformation.", "Pub Date": "2023-12-25"}