{"Title": "Energy-Efficient Heuristic Computation Offloading With Delay Constraints in Mobile Edge Computing", "Doi": "10.1109/TSC.2023.3324604", "Authors": ["j. mei", "z. tong", "k. li", "l. zhang", "k. li"], "Key Words": ["computation offloading", "delay constraint", "edge computing", "energy optimization", "resource competition"], "Abstract": "by offloading computation intensive tasks to the edge cloud mobile edge computing  mec  has been regarded as an effective technology for enhancing computational capacity and extending the battery lifetime of mobile devices  mds . however due to the limitation of bandwidth and computing resources in mec unreasonable task offloading might lead to intensive resource competition which recedes the performance gains benefit from offloading. when the tasks are latency sensitive a proper task offloading strategy is more important. considering the heterogeneous delay constraints and resource competition comprehensively we aim at minimizing the energy consumption of mds subject to the individual delay constraints of tasks by jointly optimizing the task offloading and resource allocation in terms of wireless channel and remote computation capacity in a multi md mec system in this paper. due to the complexity of the primal optimization problem a heuristic algorithm is devised. in the algorithm a subset of tasks to be offloaded is incrementally constructed and the corresponding offloading sub problem is then repeatedly solved for this task subset using a two stage algorithm until the total energy consumption can no longer be further reduced. the first stage of solving the sub problem is to find the optimal full offloading scheme for the to offload tasks which is proved to be a convex optimization problem. for the task subset without a full offloading solution an effective iterative algorithm is employed in the second stage where the channel allocation and computing resource allocation are optimized alternately. a great number of experiments are given to verify the performance of the proposed algorithm. we observe that the heuristic algorithm shows different performance when adopting different task ordering schemes. the proposed heuristic algorithm is evaluated against three reference schemes and the results show that it can save up to 14.20% of energy consumption while guaranteeing the delay requirements of all tasks.", "Pub Date": "2023-12-14"}