{"Title": "Energy Consumption Scheduling as a Fog Computing Service in Smart Grid", "Doi": "10.1109/TSC.2022.3174698", "Authors": ["s. chouikhi", "m. esseghir", "l. merghem-boulahia"], "Key Words": ["energy demand management", "energy consumption scheduling", "game theory", "fog-computing", "cooperative scheduling game", "smart grid"], "Abstract": "the advent of smart grid technologies provides new tools and services to optimally manage the electricity grids. one of the most interesting services that emerged with the development of information and communication technologies  icts  is energy demand management. this service permits us to face the issues caused by the ever increasing energy demand such as grid congestion during peak hours increasing energy generation costs and even blackouts. in this paper we investigate the problem of consumer side optimization of residential energy demand. our main aim is to better distribute the energy consumption over a day to avoid or reduce the demand during peak hours. hence we propose a fog computing based model for energy demand scheduling using energy consumption cost as an incentive. in this model the fog nodes schedule the appliances‚äô operations in order to reduce the individual and global energy bills whilst respecting consumers‚äô preferences. the proposed approach performs a multi agent system based cooperative scheduling game with minimal interactions between the nodes. moreover we present a fog nodes‚äô assignment scheme to decide which node will handle which appliances‚äô schedules. the nodes‚äô assignment strategy aims to optimize the use of fog nodes‚äô resources whilst reducing the scheduling process latency. the performance evaluation shows that the use of fog computing can achieve interesting results in terms of the reduction of energy consumption cost. for instance the energy consumption during peak hour decreases by more than 25% from 670 kwh to 500 kwh when the scheduling game is performed. as a consequence the energy consumption cost decreases by 7% from 806 ‚ç¨ to 750 ‚ç¨ .", "Pub Date": "2023-04-07"}