{"Title": "Energy-Efficient Computation Offloading Based on Multiagent Deep Reinforcement Learning for Industrial Internet of Things Systems", "Doi": "10.1109/JIOT.2023.3333044", "Authors": ["s. chouikhi", "m. esseghir", "l. merghem-boulahia"], "Key Words": ["computation offloading", "deep reinforcement learning (drl)", "edge computing", "industrial internet of things (iiot)"], "Abstract": "the term industrial internet of things  iiot  was created to describe a specific area of the internet of things  iot  that integrates information and communication technologies  icts  like cloud edge computing wireless sensor actuator networks and connected objects to enable and accelerate the development of industry 4.0. iiot applications  e.g. smart manufacturing remote control of industrial machinery and critical system monitoring  have various levels of criticality and quality of service  qos  requirements. however the characteristics of data collected by interconnected devices complicate the task of guaranteeing the qos requirements in terms of latency and reliability in addition to the huge amount of energy consumption. as a potential solution edge computing offers additional powerful resources in the proximity of the iiot devices. hence the required qos can be achieved by offloading computation intensive tasks to edge servers. moreover the offloading process needs to be optimized to take full advantage. unlikely conventional optimization methods are very complex to be applied in the iiot context. to overcome this issue we propose a computation offloading approach based on deep reinforcement learning  drl  to minimize long term energy consumption and maximize the number of tasks completed before their tolerant deadlines. we introduce a system with multiple agents to deal with the increasing dimension of the action space where each iiot device is represented by its own drl model. the goal of the model is to maximize a flexible and long term reward. in addition the drl models are trained in the cloud and make decisions online in the edge servers allowing quick decision making by avoiding iterative online optimization procedures. the performance of the proposed approach is evaluated through simulation. the proposal shows promising results compared to other approaches.", "Pub Date": "2024-03-26"}