{"Title": "Energy-Efficient Hybrid NOMA-FDMA Assisted Distributed Two-Tier Edge-Cloudlet Multi-Access Computation Offloading", "Doi": "10.1109/TGCN.2023.3248609", "Authors": ["c. dou", "n. huang", "y. wu", "t. q. s. quek"], "Key Words": ["non-orthogonal multiple access (noma)", "multi-access computation offloading", "edge-cloudlet collaboration"], "Abstract": "driven by the increasing interests of multi tier computing architecture this paper considers a hybrid non orthogonal multiple access  noma  and frequency division multiple access  fdma  assisted two tier edge cloudlet multi access computation offloading. in particular part of the computation tasks of the edge computing user  eu  can be offloaded to different edge servers  ess  via noma and part of the computing tasks received by the ess can be further offloaded to the cloudlet server  cs  via fdma. we formulate an optimization problem to minimize the total energy consumption of the two tier offloading system by jointly optimizing the multi access offloading decision noma transmission duration fdma transmission duration and bandwidth allocations. although the problem is non convex we identify the structural feature of the problem and propose a decomposition based algorithm to attain the optimal two tier offloading decisions and the associated allocations of the computing communication resources. specifically by leveraging the hidden convexity after decomposition we propose a distributed algorithm which is based on the block coordinated descent  bcd  method and lagrange duality for solving the subproblem. in our distributed algorithm the eu optimizes its tier i offloading towards different ess each es individually optimizes its tier ii offloading towards the cs and moreover the cs optimizes its bandwidth allocations to the ess. furthermore based on the proposed algorithm for the singe eu case the multi eu scenario is further analyzed. to improve the energy efficiency and fairness for the multi eu scheduling we propose a gradient projection  gp  based multi eu scheduling algorithm which leverages our single eu algorithm as a subroutine to optimize all eus‚äô energy efficiency in computation offloading over a long term period. numerical results verify the performance of our proposed algorithms. for the single eu scenario our simulation results demonstrate that the decomposition based algorithm can outperform some benchmark algorithms. in the case of multi eu scenario our proposed gp based multi eu scheduling can effectively improve all eus‚äô energy efficiency compared to the proportional fair scheduling.", "Pub Date": "2023-08-18"}