{"Title": "Energy-Efficient Mobile Edge Computing in RIS-Aided OFDM-NOMA Relay Networks", "Doi": "10.1109/TVT.2022.3223903", "Authors": ["z. luo", "g. huang"], "Key Words": ["mobile edge computing", "relay", "intelligent reflecting surface", "non-orthogonal multiple access", "orthogonal frequency division multiplexing"], "Abstract": "in this paper the design of task offloading and computing strategy in a mobile edge computing  mec  system deployed over a reconfigurable intelligent surface  ris  aided orthogonal frequency division multiplexing based non orthogonal multiple access  ofdm noma  relay network is studied where both a relay node and an mec server located at an access point help a user terminal accomplish task computing. our objective is to minimize energy consumption for communication and computation at the user terminal and the relay subject to a given task executing delay constraint. to this end a novel protocol is first proposed to enable the user terminal and the relay to fully utilize the high passive beamforming gain provided by ris and the high spectral efficiency offered by ofdm and noma techniques for task offloading. then under the newly proposed protocol a resource allocation optimization problem is formulated where ris reflection coefficients task offloading and computing time allocation subcarrier and power allocation task partition and cpu frequency of the mec server are jointly optimized. because the numerous optimization variables are coupled with each other and integer programming is involved for subcarrier allocation optimization the formulated problem is a mixed integer programming and highly non convex problem that is hard to tackle. to address this problem an efficient algorithm is devised to achieve its solution by employing alternating optimization layer optimization big m formulation and successive convex approximation techniques. simulation results validate that substantial energy savings can be achieved by employing ris and ofdm noma techniques in wireless relaying based mec systems.", "Pub Date": "2023-04-18"}