{"Title": "Energy or Accuracy? Near-Optimal User Selection and Aggregator Placement for Federated Learning in MEC", "Doi": "10.1109/TMC.2023.3262829", "Authors": ["z. xu", "d. li", "w. liang", "w. xu", "q. xia", "p. zhou", "o. f. rana", "h. li"], "Key Words": ["energy minimization", "federated learning", "machine learning based algorithms", "mobile edge computing", "ue selection and aggregator placement"], "Abstract": "to unveil the hidden value in the datasets of user equipments  ues  while preserving user privacy federated learning  fl  is emerging as a promising technique to train a machine learning model using the datasets of ues locally without uploading the datasets to a central location. customers require to train machine learning models based on different datasets of ues through issuing fl requests that are implemented by fl services in a mobile edge computing  mec  network. a key challenge of enabling fl in mec networks is how to minimize the energy consumption of implementing fl requests while guaranteeing the accuracy of machine learning models given that the availabilities of ues usually are uncertain. in this paper we investigate the problem of energy minimization for fl in an mec network with uncertain availabilities of ues. we first consider the energy minimization problem for a single fl request in an mec network. we then propose a novel optimization framework for the problem with a single fl request which consists of  1  an online learning algorithm with a bounded regret for the ue selection by considering various contexts  side information  that influence energy consumption  and  2  an approximation algorithm with an approximation ratio for the aggregator placement for a single fl request. we third deal with the problem with multiple fl requests for which we devise an online learning algorithm with a bounded regret. we finally evaluate the performance of the proposed algorithms by extensive experiments. experimental results show that the proposed algorithms outperform their counterparts by reducing at least 13% of the total energy consumption while achieving the same accuracy.", "Pub Date": "2024-02-05"}