{"Title": "Energy-Efficient Optimization of Multi-User NOMA-Assisted Cooperative THz-SIMO MEC Systems", "Doi": "10.1109/TCOMM.2023.3265123", "Authors": ["o. maraqa", "s. al-ahmadi", "a. s. rajasekaran", "h. u. sokun", "h. yanikomeroglu", "s. m. sait"], "Key Words": ["mobile edge computing (mec)", "terahertz (thz) communication", "non-orthogonal multiple access (noma)", "full-offloading model", "user cooperation"], "Abstract": "the various requirements in terms of data rates and latency in beyond 5g and 6g networks have motivated the integration of a variety of communications schemes and technologies to meet these requirements in such networks. among these schemes are terahertz  thz  communications cooperative non orthogonal multiple access  noma  enabled schemes and mobile edge computing  mec . thz communications offer abundant bandwidth for high data rate short distance applications and noma enabled schemes are promising schemes to realize the target spectral efficiencies and low latency requirements in future networks while mec would allow distributed processing and data offloading for the emerging applications in these networks. in this paper an energy efficient scheme of multi user noma assisted cooperative thz single input multiple output  simo  mec systems is proposed to allow the uplink transmission of offloaded data from the far cell edge users to the more computing resources in the base station  bs  through the cell center users. to reinforce the performance of the proposed scheme two optimization problems are formulated and solved namely the first problem minimizes the total users‚äô energy consumption while the second problem maximizes the total users‚äô computation energy efficiency  cee  for the proposed scheme. in both problems the noma user pairing the bs receive beamforming the transmission time allocation and the noma transmission power allocation coefficients are optimized while taking into account the full offloading requirements of each user as well as the predefined latency constraint of the system. the obtained results reveal new insights into the performance and design of multi user noma assisted cooperative thz simo mec systems. particularly with relatively high offloading rate demands  several gbits user  we show that  i  the proposed scheme can handle such demands while satisfying the predefined latency constraint and  ii  the full offloading model can be considered the most effective solution in conserving mobile devices‚äô resources as compared to the system with the partial offloading model or the system without offloading.", "Pub Date": "2023-06-15"}