{"Title": "Energy-Accuracy Trade-Offs for Resistive In-Memory Computing Architectures", "Authors": ["s. k. roy", "n. r. shanbhag"], "Pub Date": "2024-04-10", "Abstract": "resistive in memory computing  imc  architectures currently lag behind sram imcs and digital accelerators in both energy efficiency and compute density due to their low compute accuracy. this article proposes the use of signal to noise plus distortion ratio  sndr  to quantify the compute accuracy of imcs and identify the device circuit and architectural parameters that affect it. we further analyze the fundamental limits on the sndr of magnetoresistive random access memory  mram   resistive random access memory  reram   and ferroelectric field effect transistor  fefet  based imcs employing parameter variation and noise models that were validated against measured results from a recent mram based imc prototype in a 22 nm process. at high output signal magnitude we can find that the maximum achievable sndr is limited by the pre analog to digital converter  adc  array nonidealities such as the conductance variations  cvs  parasitic resistances and current mirror mismatch  mm  whereas the adc thermal  at  noise limits the sndr at small signal magnitudes. furthermore for large dot product  dp  dimensions   $n > 50$   the maximum achievable sndr is highest for fefet followed by reram and then mram. finally the increase in conductance contrast   ${g  {\\text {on}} }/ {g  {\\text {off}} }$   enhances the maximum achievable sndr only until it reaches a value of approximately 12. rerams and fefets demonstrate high energy efficiencies while achieving high sndr as their low conductance values lead to lower currents and lower noise due to wire parasitics. in all cases across all three device types dp dimension adc precision and conductance contrast the maximum achievable sndr is found to be in the range of 18‚äì22 db barely meeting the minimum needed for achieving an inference accuracy close to an equivalent fixed point digital architecture. finally we demonstrate a network level accuracy of 84.5% when mapping an resnet 20  cifar 10  by reram based architecture at a sndr of 22 db in which mram  and fefet based architectures cannot realize. this result clearly implies the need for other approaches e.g. algorithmic  and learning based methods to improve the inference accuracy of resistive imc architectures.", "Doi": "10.1109/JXCDC.2024.3381888", "Key Words": ["embedded nonvolatile memory (envm)", "ferroelectric field effect transistor (fefet)", "in-memory computing (imc)", "magnetoresistive random access memory (mram)", "parallel bar", "resistive random access memory (reram)", "resistive memories", "signal-to-noise-plus-distortion ratio (sndr)"]}