{"Title": "Energy-Efficient Multi-Access Mobile Edge Computing With Secrecy Provisioning", "Doi": "10.1109/TMC.2021.3068902", "Authors": ["l. p. qian", "y. wu", "n. yu", "d. wang", "f. jiang", "w. jia"], "Key Words": ["multi-access mobile edge computing", "secrecy-driven computation offloading", "and joint computation and communication resource allocations"], "Abstract": "thanks to the wide deployment of heterogeneous radio access networks  rans  in the past decades the emerging paradigm of multi access mobile edge computing which allows mobile terminals to simultaneously offload the computation workloads to several different edge computing servers via multi rans has provided a promising scheme for enabling the computation intensive mobile internet services in future wireless systems. the broadcasting nature of radio transmission however may lead to a potential secrecy outage during the offloading transmission. in this paper we thus investigate the energy efficient multi access mobile edge computing with secrecy provisioning. specifically we first investigate the scenario of one wireless device  wd  multi access offloading subject to a malicious node eavesdropping. by characterizing the wd secrecy based throughput in its offloading transmission we formulate a joint optimization of the wd multi access computation offloading secrecy provisioning and offloading transmission duration with the objective of minimizing the wd total energy consumption while providing a guaranteed secrecy outage during offloading and a guaranteed overall latency in completing the wd workload. despite the non convexity of this joint optimization problem we exploit its layered structure and propose an efficient algorithm for solving it. based on the study on the single wd scenario we further investigate the scenario of multiple wds in which a group of wds sequentially execute the multi access computation offloading while subject to a malicious node eavesdropping. taking the coupling effect among different wds into account we propose a swapping heuristic based algorithm  that uses our proposed single wd algorithm as a subroutine  for finding the ordering of the wds to execute the multi access computation offloading with the objective of minimizing all wds‚äô total energy consumption. extensive numerical results are provided to validate the effectiveness and efficiency of our proposed algorithms. the results demonstrate that our algorithms can outperform some conventional fixed offloading scheduling scheme and randomized offloading ordering scheme.", "Pub Date": "2022-12-05"}