{"Title": "English-Arabic Text Translation and Abstractive Summarization Using Transformers", "Doi": "10.1109/AICCSA59173.2023.10479257", "Authors": ["h. a. holiel", "n. mohamed", "a. ahmed", "w. medhat"], "Key Words": ["neural machine translation", "text summarization", "attention mechanism", "extractive summarization", "abstractive summarization", "deep learning"], "Abstract": "the vast growth of online and offline data has revolutionized how we gather evaluate and understand information. comprehending lengthy text documents and extracting crucial details from them can be difficult and time consuming. in response to these challenges text summarization techniques have emerged to condense long texts while retaining their essential content. these techniques rely on delivering filtered high quality information promptly to users. however due to the enormous volume of data generated from various sources and technologies automatically summarizing large scale data remains a difficult task. this paper introduces a novel problem solving paradigm by integrating two powerful transformer models  neural machine translation  nmt  using helsinki transformer and text summarization using the mt5 mutilingual xlsum on wikihow and bbc arabic news datasets. our approach transcends traditional methods offering a fresh perspective on maintaining coherence and naturalness in generated summaries. it aims to produce more fluent and context aware summaries particularly tailored to the intricacies of the arabic language. with this integration we can harness the capabilities of nmt models to produce concise and coherent summaries of text in various languages such as arabic. the proposed approach automatically translates english text to be summarized as arabic text through the presented integration addressing the lack of arabic language resources. this integration significantly improves the quality and precision of arabic text summaries giving promising results on the mixed dataset between wikihow and bbc arabic news.", "Pub Date": "2024-04-02"}