{"Title": "Enhancing Voltage Compliance in Distribution Network Under Cloud and Edge Computing Framework", "Doi": "10.1109/TCC.2022.3149238", "Authors": ["j. zhong", "b. liu", "x. yu", "p. wong", "z. wang", "c. xu", "x. zhou"], "Key Words": ["cloud-edge computing", "distribution network", "load profile forecasting", "unbalanced three-phase optimal power flow", "voltage compliance"], "Abstract": "driven by government incentive policies and heightened environmental awareness by individuals many regions around the world have seen a rapid rise in distributed energy resource  der  penetration in electricity distribution networks. while high penetration of der significantly helps facilitate the decarbonization in power and utitlies it also brings unexpected operational challenges among which voltage compliance has been a significant concern. to address this issue the efficient load profile forecast the operational framework and related strategies are critical challenges that need to be addressed urgently. hence this paper presents a cloud edge computing based framework to effectively operate the coupled medium voltage  mv  and low voltage  lv  distribution network. the high computational efficiency in cloud computing and low data latency in edge computing are presented and explored to coordinate the day ahead and intraday operations ranging from different framework layers. under the framework a customer level forecasting algorithm is employed to predict both day ahead and real time load profiles. based on the prediction results an optimization model based on unbalanced three phase optimal power flow is proposed and solved by an efficient and accurate linearization based approach that considers the controllability of on load tap changers distributed static var generator and the pv inverters. simulations based on an extensive mocked mv lv distribution network show the proposed forecasting method is adopted in real time operations in terms of high accuracy and demonstrate the efficiency of the proposed optimization method in enhancing the voltage compliance in the network.", "Pub Date": "2023-06-06"}