{"Title": "Enhanced Hybrid Hierarchical Federated Edge Learning Over Heterogeneous Networks", "Doi": "10.1109/TVT.2023.3287355", "Authors": ["q. chen", "z. you", "d. wen", "z. zhang"], "Key Words": ["edge computing", "federated edge learning", "hierarchical systems", "semi-asynchronous"], "Abstract": "in this work a hybrid hierarchical federated edge learning  hhfel  architecture that consists of a device layer an edge layer and a cloud layer over heterogeneous networks is investigated for large scale model training. in such systems learning efficiency is severely degraded by limited communication resources and device heterogeneity in terms of local data distribution and computation capability especially for synchronous fl mechanisms where the training of each round should wait for the slowest device. to tackle this issue asynchronous fl is proposed which allows the devices with powerful computation and communication capabilities exchanging information with the server more frequently. however this asynchronous fl framework faces a new challenge of low accuracy caused by the imbalanced local model updating. to overcome the shortage of both synchronous and asynchronous fls we propose an enhanced online semi asynchronous fl mechanism between the edge device layers where each device trains its local model with the newly generated data and each edge server aggregates a number of local models based on their arrival order in each round. particularly devices with faster training speeds would fully utilize the idle time by training their local models repetitively. meanwhile synchronous fl with an edge elastic update strategy is adopted to the cloud edge layers for personalized information exchange. considering the continuous data generation feature we formulate the objective problem as an online markov decision process  mdp  to realize efficient communication and computing hhfel via joint device selection and resource allocation. due to the non convex and combinatorial problem structure we develop a hybrid deep q network  dqn  and deep deterministic policy gradient  ddpg  approach with low computational complexity to adapt the device selection and resource allocation strategies. numerical results show the effectiveness of the proposed mechanism compared with existing benchmarks.", "Pub Date": "2023-11-14"}