{"Title": "Enhancing Cyber Threat Intelligence with Named Entity Recognition Using BERT-CRF", "Doi": "10.1109/GLOBECOM54140.2023.10436853", "Authors": ["s. -s. chen", "r. -h. hwang", "c. -y. sun", "y. -d. lin", "t. -w. pai"], "Key Words": ["cyber threat intelligence", "deep learning", "cyber security"], "Abstract": "cyber threat intelligence  cti  helps organizations understand the tactics techniques and procedures used by potential cyber criminals to defend against cyber threats. to protect the core systems and services of organizations security analysts must analyze information about threats and vulnerabilities. however analyzing large amounts of data requires significant time and effort. to streamline this process we propose an enhanced architecture bert crf by removing the bilstm layer from the conventional bert bilstm crf model. this model leverages the strengths of deep learning based language models to extract critical threat intelligence and novel information from threats effectively. in our bert crf model the token embeddings generated by bert are directly fed into the conditional random field  crf  layer for efficient named entity recognition  ner  thus preventing the need for an intermediate bilstm layer. we train and evaluate the model with three publicly available threat entity databases. we also collect open source threat intelligence data from recent years for evaluating the applicability of the constructed model in a real world environment. furthermore we compare our model with the most popular gpt 3.5 and the most downloaded open source bert question and answer models. through this study our proposed model demonstrated robust usability and outperformed other models signifying its potential for application in cti. in a real world scenario our model achieved an accuracy of 82.64% while with malware specific threat intelligence data it achieved an impressive accuracy of 93.95%. the code for this research is publicly available at https //github.com stwater20/ner bert crf open version.", "Pub Date": "2024-02-26"}