{"Title": "Enhancing Semantic Relation Classification With Shortest Dependency Path Reasoning", "Doi": "10.1109/TASLP.2023.3265205", "Authors": ["j. li", "k. shuang", "j. guo", "z. shi", "h. wang"], "Key Words": ["information extraction", "graph convolution", "shortest dependency path", "semantic reasoning"], "Abstract": "relation classification  rc  is a basic and essential task of natural language processing. existing rc methods can be classified into two categories  sequence based methods and dependency based methods. sequence based methods identify the target relation based on the overall semantics of the whole sentence which will inevitably introduce noisy features. dependency based methods extract indicative word level features from the shortest dependency path  sdp  between given entities and attempt to establish a statistical association between the words and the target relations. this pattern relatively eliminates the influence of noisy features and achieves a robust performance on long sentences. nevertheless we observe that majority of relation classification processes involve complex semantic reasoning which is hard to be achieved based on the word level statistical association. to solve this problem we categorize all relations into atomic relations and composed relations. the atomic relations are the basic relations that can be identified based on the word level features while the composed relation requires to be deducted from multiple atomic relations. correspondingly we propose the atomic relation encoding and reasoning model  aterm . in the atomic relation encoding stage aterm groups the word level features and encodes multiple atomic relations in parallel. in the atomic relation reasoning stage aterm establishes the atomic relation chain where relation level features are extracted to identify composed relations. experiments show that our method achieves state of the art results on the three most popular relation classification datasets ‚äì tacred tacred revisit and semeval 2010 task 8 with significant improvements.", "Pub Date": "2023-04-24"}