{"Title": "EPtask: Deep Reinforcement Learning Based Energy-Efficient and Priority-Aware Task Scheduling for Dynamic Vehicular Edge Computing", "Doi": "10.1109/TIV.2023.3321679", "Authors": ["p. li", "z. xiao", "x. wang", "k. huang", "y. huang", "h. gao"], "Key Words": ["proximal policy optimization", "task scheduling", "resource allocation", "vehicular edge computing"], "Abstract": "the increasing complexity of vehicles has led to a growing demand for in vehicle services that rely on multiple sensors. in the vehicular edge computing  vec  paradigm energy efficient task scheduling is critical to achieving optimal completion time and energy consumption. although extensive research has been conducted in this field challenges remain in meeting the requirements of time sensitive services and adapting to dynamic traffic environments. in this context a novel algorithm called multi action and environment adaptive proximal policy optimization algorithm  meppo  is designed based on the conventional ppo algorithm and then a joint task scheduling and resource allocation method is proposed based on the designed meppo algorithm. in specific the method involves three core aspects. firstly task scheduling strategy is designed to generate task offloading decisions and priority assignment decisions for the tasks utilizing ppo algorithm which can further reduce the completion time of service requests. secondly transmit power allocation scheme is designed considering the expected transmission distance among vehicles and edge servers which can minimize transmission energy consumption by adjusting the allocated transmit power dynamically. thirdly the proposed meppo based scheduling method can make scheduling decisions for vehicles with different numbers of tasks by manipulating the state space of the ppo algorithm which makes the proposed method be adaptive to real world dynamic vec environment. at last the effectiveness of the proposed method is demonstrated through extensive simulation and on site experiments.", "Pub Date": "2024-02-22"}