{"Title": "Error Detection Schemes Assessed on FPGA for Multipliers in Lattice-Based Key Encapsulation Mechanisms in Post-Quantum Cryptography", "Authors": ["a. c. canto", "a. sarker", "j. kaur", "m. m. kermani", "r. azarderakhsh"], "Pub Date": "2023-09-05", "Abstract": "advances in quantum computing have brought the need for developing public key cryptosystems secure against attacks potentially enabled by quantum computers. in late 2017 the national institute of standards and technology  nist  launched a project to standardize one or more quantum computer resistant public key cryptographic algorithms. among the main post quantum algorithm classes lattice based cryptography is believed to be quantum resistant. the standardization efforts including that of the nist which will be concluded in 2022 2024 also affirm the importance of such algorithms. in this work we propose error detection schemes for lattice based key encapsulation mechanisms  kems . as our case study we apply such schemes to the hardware accelerators for three post quantum cryptographic algorithms that have advanced to the third round of the nist pqc standardization process i.e. frodokem saber and ntru. the merit of the proposed schemes is that they can be applied to other applications and cryptographic algorithms that use multiplications in their hardware accelerators. the schemes proposed in this paper are based on recomputing with shifted negated and scaled operands. moreover we implement our fault detection schemes on field programmable gate array  fpga  family kintex ultrascale+ device xcku5p sfvb784 1lv i to benchmark the overheads induced and the performance degradation of the proposed approaches when added to the original architectures. the results show acceptable overhead and high error coverage for all three studied nist pqc finalists.", "Doi": "10.1109/TETC.2022.3217006", "Key Words": ["fault detection", "field -programmable gate array (fpga)", "lattice-based", "post-quantum cryptography"]}