{"Title": "Evenness-Aware Data Collection for Edge-Assisted Mobile Crowdsensing in Internet of Vehicles", "Doi": "10.1109/JIOT.2021.3095285", "Authors": ["l. liu", "z. lu", "l. wang", "y. chen", "x. wen", "y. liu", "m. li"], "Key Words": ["data collection", "edge-assisted vehicular crowdsensing (eavc)", "internet of vehicles (iov)", "spatiotemporal evenness"], "Abstract": "edge assisted vehicular crowdsensing  eavc  system is an emerging data collection paradigm in internet of vehicles  iov  where intelligent vehicles collaboratively perform complex sensing tasks under the guidance of the edge server. one of the main characteristics of eavc is that large and balanced spatiotemporal coverage is of paramount importance to support various crowdsensing applications. most existing works have focused on recruiting pervasive nondedicated vehicles to conduct data collection. however the collected data of nondedicated vehicles cannot satisfy the requirement of spatiotemporal coverage in terms of evenness and coverage rate as the trajectories are not uniformly distributed in spatial and temporal domain. in this article we propose a collaborative data collection architecture based on edge intelligence where nondedicated and dedicated vehicles cooperate to carry out large scale and fine grained data collection with the assistance of the edge server. particularly we propose an objective function to better evaluate the spatiotemporal evenness of collected data in consideration of different spatiotemporal partitions based on entropy theory. with the objective function the offline and online scheduling algorithms are designed to guide dedicated vehicles to proactively participate in crowdsensing tasks using dynamic programming and greedy theories. through extensive simulations we have shown the necessity of introducing dedicated vehicles to assist data collection in vehicular crowdsensing system and the effectiveness and superiority of the proposed schemes.", "Pub Date": "2022-12-22"}