{"Title": "Everything Under Control: Secure Data Sharing Mechanism for Cloud-Edge Computing", "Doi": "10.1109/TIFS.2023.3266164", "Authors": ["z. song", "h. ma", "r. zhang", "w. xu", "j. li"], "Key Words": ["cloud-edge computing", "controllable delegation", "bilateral access control", "verifiability", "webassembly"], "Abstract": "cloud edge computing is a new paradigm for data sharing. many computation tasks are assigned to multiple edge nodes to mitigate the computing burden of the cloud and data is also outsourced to them to provide real time services for iot devices. however two major issues remain namely data privacy and real world deployment. according to the data privacy rights and principles that stated by general data protection regulation  gdpr  data access control restriction of data processing and finding inaccuracy data are critical issues that should be tackled in cloud edge computing. besides since there are various types of devices and many of them are resource constrained how to efficiently apply deployment in cloud edge computing is challenging for practice. in this work we propose a new cryptographic primitive controllable outsourced attribute based proxy re encryption  coab pre  and a universal webassembly based implementation framework for cross platform deployment. in particular coab pre achieves bilateral and distributed access control whereby data producers and data consumers can both specify policies the other party must satisfy without a centralized access control server. the property that we called controllable delegation restricts the data processing on the edge nodes. coab pre also supports comprehensive verifiability to find out a wrong result produced by the edge nodes and locate the misbehaved one. moreover we further discussed the potential property of coab pre and put forward an improved scheme with high efficiency on devices. we also implemented our scheme using the approach and deployed it on different devices for experiment. all theoretical and experimental results indicate that our solution is secure and practical and our implementation is suitable for cloud edge computing.", "Pub Date": "2023-04-18"}