{"Title": "Evolutionary Multitasking for Costly Task Offloading in Mobile-Edge Computing Networks", "Doi": "10.1109/TEVC.2023.3255266", "Authors": ["c. yang", "q. chen", "z. zhu", "z. -a. huang", "s. lan", "l. zhu"], "Key Words": ["auxiliary task", "evolutionary multitasking (emt)", "mobile-edge computing (mec)", "task offloading"], "Abstract": "the offloading of computation intensive tasks to an edge server near resource constrained mobile devices can provide improved application performance and user experience. however with the rapid growth of mobile devices connected to the edge server it is challenging to directly obtain an optimal task offloading scheme due to increasing computational cost and problem scale. in this study we model the costly task offloading problem  ctop  in mobile edge computing networks to achieve efficient joint optimization of energy consumption and processing latency for mobile devices. inspired by the success of evolutionary multitasking in solving complex optimization problems by leveraging the experience of simple optimization problems we develop a novel multitasking framework whose effectiveness is demonstrated in solving the ctop. in this framework auxiliary tasks are created to optimize the local processing overhead and the edge processing overhead of task offloading. on this basis we propose an effective multitask evolutionary algorithm that includes segmented knowledge transfer and auxiliary task update. specifically source and extended decision variables are considered as different knowledge to be utilized while the auxiliary tasks are allowed to be updated dynamically. related knowledge that is learned from cheap and simple auxiliary tasks promotes the evolutionary search for ctop. experimental results verify the effectiveness of knowledge transfer. compared to existing multitasking and single tasking algorithms the proposed algorithm shows competitive performance in ctop instances and achieves better comprehensive performance in terms of energy consumption and processing latency.", "Pub Date": "2024-04-01"}