{"Title": "Examining the Role of Natural Language Processing in Generating Topics from Web Content", "Doi": "10.1109/ICOCO59262.2023.10398059", "Authors": ["h. h. m. altarturi", "m. saadoon", "n. b. anuar"], "Key Words": ["natural language processing", "nlp", "topic modeling", "web content", "generate topics"], "Abstract": "natural language processing  nlp  is a major subfield of machine learning that focuses on the interaction between humans and computers through several techniques including topic modeling which extracts and generates topics from large amounts of unstructured data on the web. topic modeling uncovers hidden patterns and contextual meanings in web pages allowing for the categorization clustering recommendation of relevant content detection of emerging trends and improved information retrieval. the benefit of topic models relies on their performance to detect and generate topics  however the evaluation of applying topic modeling on web content data remains lacking in current studies. the absence of examining such performance evaluations hinders understanding performance variability across different web pages the development of refined models and the ability to keep pace with emerging patterns in the dynamic online environment. this study presents a comprehensive performance evaluation of the benchmark topic models when applied to web content data. it presents a comparison of topic models using four topic coherence metrics providing an in depth performance analysis. the evaluation is conducted on a public dataset consisting of 2 million web pages providing a substantial basis for assessing the strengths and limitations of these models in the context of web data. additionally this study examines the utilization of nlp techniques for topic generation within the context of web content and sheds light on the challenges and issues associated with generating topics from web content data highlighting potential research prospects and the need for future work in the field of web topic modeling using natural language processing.", "Pub Date": "2024-01-24"}