{"Title": "Exploring Embeddings for Measuring Text Relatedness: Unveiling Sentiments and Relationships in Online Comments", "Doi": "10.1109/ICI60088.2023.10421308", "Authors": ["a. olakangil", "c. wang", "j. nguyen", "q. zhou", "k. jethwa", "j. li", "a. narendra", "n. patel", "a. rajaram"], "Key Words": ["embedding models", "sentiment analysis", "semantic relationships", "bert", "clustering", "cosine similarity", "kl-divergence", "vector space", "contextual embeddings", "feature extraction"], "Abstract": "after the covid-19 pandemic caused internet usage to grow by 70% there has been an increased number of people all across the world using social media. applications like twitter meta threads youtube and reddit have become increasingly pervasive leaving almost no digital space where public opinion is not expressed. this paper investigates sentiment and semantic relationships among comments across various social media platforms as well as discusses the importance of shared opinions across these different media platforms using word embeddings to analyze components in sentences and documents. it allows researchers politicians and business representatives to trace a path of shared sentiment among users across the world. this research paper presents multiple approaches that measure the relatedness of text extracted from user comments on these popular online platforms. by leveraging embeddings which capture semantic relationships between words and help analyze sentiments across the web we can uncover connections regarding public opinion as a whole. the study utilizes pre existing datasets from youtube reddit twitter and more. we made use of popular natural language processing models like bidirectional encoder representations from transformers  bert  to analyze sentiments and explore relationships between comment embeddings. additionally we aim to utilize clustering and kl divergence to find semantic relationships within these comment embeddings across various social media platforms. our analysis will enable a deeper understanding of the interconnectedness of online comments and will investigate the notion of the internet functioning as a large interconnected brain.", "Pub Date": "2024-02-08"}