{"Title": "Explore Deep Reinforcement Learning to Energy-Efficient Data Synchronism in 5G Self-Powered Sensor Networks", "Doi": "10.1109/JSEN.2022.3221983", "Authors": ["c. wu", "y. zhao", "s. xiao", "c. gao"], "Key Words": ["data synchronization", "deep reinforcement learning (drl)", "emergency communication", "energy conservation", "mobile edge computing (mec)", "self-powered sensor"], "Abstract": "recently the explosive data traffic growth and large scale internet of things  iot  equipment connection have brought 5g mobile communication technology many challenges. the communication delay of network services such as augmented reality smart grid disaster warning and emergency communication has been relieved by 5g. however these services are still confronted with serious challenge of energy conservation. most of the traditional optimization methods usually need complex operations and iterations to get optimal results which are not suitable for communication systems with high real time performance. based on this argument this article has focused on green communication in mobile edge computing  mec  based self powered sensor network and proposed a novel approach called mobile intelligent data synchronization [mids based on deep reinforcement learning  dlr ]. it exploits deep deterministic policy gradient  ddpg  continuously interacting with the environment and making tryouts to evaluate the feedback from the environment to optimize future decision making on the path selection scheme for data transmission as well as achieve the energy efficiency and energy consumption balance of mobile devices with self powered sensors. we provide experiments to show the capability of our approach in reducing the additional energy consumption of mobile devices and the base station  bs  as well as balancing the energy consumption of mobile devices with sensor communication. the superiority of our approach for energy conservation in data synchronization is convincingly demonstrated by comparing it with state of the art methods in mec based self powered sensor network.", "Pub Date": "2023-09-14"}