{"Title": "Exploring the Capabilities of a Language Model-Only Approach for Depression Detection in Text Data", "Doi": "10.1109/BHI58575.2023.10313367", "Authors": ["m. sadeghi", "b. egger", "r. agahi", "r. richer", "k. capito", "l. h. rupp", "l. schindler-gmelch", "m. berking", "b. m. eskofier"], "Key Words": ["depression detection", "mental health", "large language models", "text analysis", "daic dataset", "gpt-based models", "deproberta"], "Abstract": "depression is a prevalent and debilitating mental health condition that requires accurate and efficient detection for timely and effective treatment. in this study we utilized the e daic  extended distress analysis interview corpus wizard of oz  dataset an extended version of the daic woz dataset which consists of semi clinical interviews conducted by an animated virtual interviewer called ellie controlled by a human interviewer in another room. with 275 participants the e daic dataset represents a valuable resource for investigating depression detection methods. our aim is to predict phq-8 scores through text analysis. leveraging state of the art speech processing large language model based text summarization and a specialized depression detection module we demonstrate the transformative potential of language data analysis in enhancing depression screening. by overcoming the limitations of manual feature extraction methods our automated techniques provide a more efficient and effective means of evaluating depression. in our evaluation we achieve robust accuracy on the development set of the e daic dataset with a mean absolute error  mae  of 3.65 in estimating phq-8 scores from recorded interviews. this remarkable performance highlights the efficacy of our approach in automatically predicting depression severity. our research contributes to the growing evidence supporting the use of large language model in mental health assessment showcasing the role of innovative technologies in advancing patient care for depression.", "Pub Date": "2023-11-14"}