{"Title": "Exploring Quantum Average-Case Distances: Proofs, Properties, and Examples", "Authors": ["f. b. maciejewski", "z. pucha≈ça", "m. oszmaniec"], "Pub Date": "2023-06-19", "Abstract": "in this work we present an in depth study of average case quantum distances introduced in maciejewski et al.  2022 . the average case distances approximate up to the relative error the average total variation  tv  distance between measurement outputs of two quantum processes in which quantum objects of interest  states measurements or channels  are intertwined with random quantum circuits. contrary to conventional distances such as trace distance or diamond norm they quantify average case statistical distinguishability via random quantum circuits. we prove that once a family of random circuits forms an  $\\delta $  approximate 4 design with  $\\delta =o d^{ 8} $  then the average case distances can be approximated by simple explicit functions that can be expressed via simple degree two polynomials in objects of interest. for systems of moderate dimension they can be easily explicitly computed ‚äì no optimization is needed as opposed to diamond norm distance between channels or operational distance between measurements. we prove that those functions which we call quantum average case distances have a plethora of desirable properties such as subadditivity w.r.t. tensor products joint convexity and  restricted  data processing inequalities. notably all distances utilize the hilbert schmidt  hs  norm which provides this norm with a new operational interpretation. we also provide upper bounds on the maximal ratio between worst case and average case distances and for each of them we provide an example that saturates the bound. specifically we show that for each dimension  $d$  this ratio is at most  $d^{\\frac {1}{2}} d d^{\\frac {3}{2}}$  for states measurements and channels respectively. to support the practical usefulness of our findings we study multiple examples in which average case quantum distances can be calculated analytically.", "Doi": "10.1109/TIT.2023.3250100", "Key Words": ["quantum information science", "information science", "quantum mechanics", "quantum computing", "quantum circuit", "quantum channels", "quantum state", "quantum entanglement", "qubit"]}