{"Title": "Expressivity of Variational Quantum Machine Learning on the Boolean Cube", "Authors": ["d. herman", "r. raymond", "m. li", "n. robles", "a. mezzacapo", "m. pistoia"], "Pub Date": "2023-04-13", "Abstract": "categorical data play an important part in machine learning research and appears in a variety of applications. models that can express large classes of real valued functions on the boolean cube are useful for problems involving discrete valued data types including those which are not boolean. to this date the commonly used schemes for embedding classical data into variational quantum machine learning models encode continuous values. here we investigate quantum embeddings for encoding boolean valued data into parameterized quantum circuits used for machine learning tasks. we narrow down representability conditions for functions on the $n$ dimensional boolean cube with respect to previously known results using two quantum embeddings  a phase embedding and an embedding based on quantum random access codes. we show that for any real valued function on the $n$ dimensional boolean cube there exists a variational linear quantum model based on a phase embedding using $n$ qubits that can represent it and an ensemble of such models using $d < n$ qubits that can express any function with degree at most $d$. additionally we prove that variational linear quantum models that use the quantum random access code embedding can express functions on the boolean cube with degree $d\\leq \\lceil {n}/{3}\\rceil$ using $\\lceil {n}/{3}\\rceil$ qubits and that an ensemble of such models can represent any function on the boolean cube with degree $d\\leq \\lceil {n}/{3}\\rceil$. furthermore we discuss the potential benefits of each embedding and the impact of serial repetitions. finally we demonstrate the use of the embeddings presented by performing numerical simulations and experiments on ibm quantum processors using the qiskit machine learning framework.", "Doi": "10.1109/TQE.2023.3255206", "Key Words": ["boolean cube", "expressivity", "fourier analysis", "quantum machine learning", "variational quantum algorithms"]}