{"Title": "Extending Source Code Pre-Trained Language Models to Summarise Decompiled Binaries", "Doi": "10.1109/SANER56733.2023.00033", "Authors": ["a. al-kaswan", "t. ahmed", "m. izadi", "a. a. sawant", "p. devanbu", "a. van deursen"], "Key Words": ["decompilation", "binary", "reverse engineering", "summarization", "deep learning", "pre-trained language models", "codet5", "transformers"], "Abstract": "binary reverse engineering is used to understand and analyse programs for which the source code is unavailable. decompilers can help transforming opaque binaries into a more readable source code like representation. still reverse engineering is difficult and costly involving considering effort in labelling code with helpful summaries. while the automated summarisation of decompiled code can help reverse engineers understand and analyse binaries current work mainly focuses on summarising source code and no suitable dataset exists for this task. in this work we extend large pre trained language models of source code to summarise de compiled binary functions. further more we investigate the impact of input and data properties on the performance of such models. our approach consists of two main components  the data and the model. we first build capybara a dataset of 214k decompiled function documentation pairs across various compiler optimisations. we extend capybara further by removing identifiers and deduplicating the data. next we fine tune the codet5 base model with capybara to create bint5. bint5 achieves the state of the art bleu-4 score of 60.83 58.82 and 44.21 for summarising source decompiled and obfuscated decompiled code respectively. this indicates that these models can be extended to decompiled binaries successfully. finally we found that the performance of bint5 is not heavily dependent on the dataset size and compiler optimisation level. we recommend future research to further investigate transferring knowledge when working with less expressive input formats such as stripped binaries.", "Pub Date": "2023-05-15"}