{"Title": "Extended Reality via Cooperative NOMA in Hybrid Cloud/Mobile-Edge Computing Networks", "Doi": "10.1109/JIOT.2023.3336393", "Authors": ["r. -j. reifert", "h. dahrouj", "a. sezgin"], "Key Words": ["central cloud (cc)", "cloud computing", "cooperative nonorthogonal multiple access (co-noma)", "extended reality (xr)", "hybrid networks", "mobile-edge computing (mec)", "uncrewed aerial vehicles (uavs)"], "Abstract": "extended reality  xr  applications often perform resource intensive tasks which are computed remotely a process that prioritizes the latency criticality aspect. to this end this article shows that through leveraging the power of the central cloud  cc  the close proximity of edge computers  ecs  and the flexibility of uncrewed aerial vehicles  uavs  a uav aided hybrid cloud mobile edge computing architecture promises to handle the intricate requirements of future xr applications. in this context this article distinguishes between two types of xr devices namely strong and weak devices. this article then introduces a cooperative nonorthogonal multiple access  co noma  scheme pairing strong and weak devices so as to aid the xr devices quality of user experience by intelligently selecting either the direct or the relay links toward the weak xr devices. a sum logarithmic rate maximization problem is thus formulated so as to jointly determine the computation and communication resources and link selection strategy as a means to strike a tradeoff between the system throughput and fairness. subject to realistic network constraints e.g. power consumption and delay the optimization problem is then solved iteratively via discrete relaxations successive convex approximation and fractional programming an approach which can be implemented in a distributed fashion across the network. simulation results validate the proposed algorithms performance in terms of log rate maximization delay sensitivity scalability and runtime performance. the practical distributed co noma implementation is particularly shown to offer appreciable benefits over traditional multiple access and noma methods highlighting its applicability in decentralized xr systems.", "Pub Date": "2024-03-27"}