{"Title": "Facial Expression Recognition in-the-Wild Using Blended Feature Attention Network", "Authors": ["m. karnati", "a. seal", "j. jaworek-korjakowska", "o. krejcar"], "Pub Date": "2023-10-02", "Abstract": "facial expression  fe  analysis plays a crucial role in various fields such as affective computing marketing and clinical evaluation. despite numerous advances research on fe recognition  fer  has recently been proceeding from confined laboratory circumstances to in the wild environments. fer is still an arduous and demanding problem due to occlusion and pose changes intraclass and intensity variations caused by illumination and insufficient training data. most state of the art  sota  approaches use the entire face for fer. however past studies on psychology and physiology reveal that the mouth and eyes reflect the variations of various fes which are closely related to the manifestation of emotion. a novel method is proposed in this study to address some of the issues mentioned above. first modified homomorphic filtering  mhf  is employed to normalize the illumination then the normalized face image is cropped into five local regions to emphasize expression specific characteristics. finally a unique blended feature attention network  bfan  is designed for fer. bfan consists of both residual dilated multiscale  rdms  feature extraction modules and spatial and channel wise attention  cwa  modules. these modules help to extract the most relevant and discriminative features from the high level  hl  and low level  ll  features. then both feature maps are integrated and passed on to the dense layers followed by a softmax layer to compute probability scores. finally the choquet fuzzy integral is applied to the computed probability scores to get the final outcome. the superiority of the proposed method is exemplified by comparing it with 18 existing approaches on seven benchmark datasets.", "Doi": "10.1109/TIM.2023.3314815", "Key Words": ["attention mechanism", "facial expression recognition (fer)", "fuzzy integral", "illumination", "intensity variations", "occlusion and pose robust", "statistical significance"]}