{"Title": "Fair Selection of Edge Nodes to Participate in Clustered Federated Multitask Learning", "Doi": "10.1109/TNSM.2023.3270168", "Authors": ["a. m. albaseer", "m. abdallah", "a. al-fuqaha", "a. m. seid", "a. erbad", "o. a. dobre"], "Key Words": ["distributed learning", "cfl", "participants scheduling", "resource allocation", "non-i.i.d.", "incongruent data distribution"], "Abstract": "clustered federated multitask learning is introduced as an efficient technique when data is unbalanced and distributed amongst clients in a non independent and identically distributed manner. while a similarity metric can provide client groups with specialized models according to their data distribution this process can be time consuming because the server needs to capture all data distribution first from all clients to perform the correct clustering. due to resource and time constraints at the network edge only a fraction of devices is selected every round necessitating the need for an efficient scheduling technique to address these issues. thus this paper introduces a two phased client selection and scheduling approach to improve the convergence speed while capturing all data distributions. this approach ensures correct clustering and fairness between clients by leveraging bandwidth reuse for participants spent a longer time training their models and exploiting the heterogeneity in the devices to schedule the participants according to their delay. the server then performs the clustering depending on predetermined thresholds and stopping criteria. when a specified cluster approximates a stopping point the server employs a greedy selection for that cluster by picking the devices with lower delay and better resources. the convergence analysis is provided showing the relationship between the proposed scheduling approach and the convergence rate of the specialized models to obtain convergence bounds under non i.i.d. data distribution. we carry out extensive simulations and the results demonstrate that the proposed algorithms reduce training time and improve the convergence speed by up to 50% while equipping every user with a customized model tailored to its data distribution.", "Pub Date": "2023-06-29"}