{"Title": "Fast and Automatic Parametric Model Construction of Antenna Structures Using CNN‚ÄìLSTM Networks", "Doi": "10.1109/TAP.2023.3346050", "Authors": ["z. wei", "z. zhou", "p. wang", "j. ren", "y. yin", "g. f. pedersen", "m. shen"], "Key Words": ["automatic modeling method", "convolutional neural network (cnn)‚äìlong short-term memory (lstm) hybrid network", "efficient data acquisition"], "Abstract": "deep learning assisted antenna design methods such as surrogate models have gained significant popularity in recent years due to their potential to greatly increase design efficiencies by replacing the time consuming full wave electromagnetic  em  simulations. a large number of training data with sufficiently diverse and representative samples  antenna structure parameters scattering properties etc.  is mandatory for these methods to ensure good performance. however traditional antenna modeling methods relying on manual model construction and modification are time consuming and cannot meet the requirement of efficient training data acquisition. also automatic model construction methods are rarely studied. in this article we pioneer investigation into the antenna model construction problem and first propose a deep learning assisted and image based approach for achieving automatic model construction. specifically our method only needs an image of the antenna structure usually available in scientific publications as the input while the corresponding modeling codes  visual basic for application  vba  language  are generated automatically. the proposed model mainly consists of two parts  convolutional neural network  cnn  and long short term memory  lstm  networks. the former is used for capturing features of antenna structure images and the latter is employed to generate the modeling codes. experimental results show that the proposed method can automatically achieve the antenna parametric model construction with an overhead of approximately 50 s which is a significant time reduction to manual modeling. the proposed parametric model construction method lays the foundation for further data acquisition tuning analysis and optimization.", "Pub Date": "2024-02-14"}