{"Title": "Fast Adaptive Task Offloading and Resource Allocation in Large-Scale MEC Systems via Multiagent Graph Reinforcement Learning", "Doi": "10.1109/JIOT.2023.3285950", "Authors": ["z. gao", "l. yang", "y. dai"], "Key Words": ["multiaccess edge computing (mec)", "multiagent reinforcement learning (marl)", "recurrent graph neural networks (r-gnns)", "resources allocation", "task offloading"], "Abstract": "in multiaccess edge computing  mec  when many mobile devices  mds  offload their tasks to an edge server  es  its resources might become constrained. these tasks may take a long time to complete or even be thrown away. since the unknown information of both the ess and other mds it is difficult for each md to determine its offloading policy independently. furthermore most offloading methods have poor generalization to new environment since they focus on model architecture with a fixed quantity of mds and ess preventing trained models from transferring to other environments. in this article we provide a full decentralized offloading scheme based on the curriculum attention weighted graph recurrent network based multiagent actor‚äìcritic  cagr maac . first we build mec as a shared md agents ess graph and an agr based message network is designed to enable each md aggregate the information of ess and other mds and solve the partial observability of md agents for mec system. second a learnable differentiable encoder network is introduced to construct md agent‚äôs local information encoding. subsequently the md agent converts overall the information regarding the mec system into a fixed size embedding via an agr network to handle different quantity of mds and ess. finally we introduce curriculum learning to address the huge complexity of the mec system and the training difficulties induced by the large amounts of mds and ess. experiments demonstrate that compared with existing algorithms cagr maac boosts task completion rates and decreases system costs by 13.01%‚äì15.03% and 16.45%‚äì18.56% and can quickly adapt to the new environment.", "Pub Date": "2023-12-27"}