{"Title": "Fast Adaptive Task Offloading and Resource Allocation via Multiagent Reinforcement Learning in Heterogeneous Vehicular Fog Computing", "Doi": "10.1109/JIOT.2022.3228246", "Authors": ["z. gao", "l. yang", "y. dai"], "Key Words": ["mobile-edge computing (mec)", "multiagent reinforcement learning (marl)", "task offloading", "vehicular fog computing (vfc)"], "Abstract": "in vehicular fog computing task offloading enables mobile vehicles  mvs  to offer ultralow latency services for computation intensive tasks. nevertheless the edge server  es  may have a high load when a large number of mvs offload their tasks to it causing many tasks either experience long processing times or being dropped particularly for latency sensitive tasks. moreover most existing methods are largely limited to training a model from scratch for new environments. this is because they focus more on model structures with fixed input and output sizes impeding the transfer of trained models across different environments. to solve these problems we propose a decentralized task offloading method based on transformer and policy decoupling based multiagent actor‚äìcritic  tpdmaac . we first introduce a transformer based long sequence forecasting network  tlsfn  for predicting the current and future queuing delay of ess to solve uncertain load. second we redesign the actor network using transformer based temporal feature extraction network  ttfen  and policy decoupling network  pdn . ttfen can adapt to various input sizes through a transformer that accepts different tokens we build from the raw input. pdn provides a mapping between the transformer based embedding features and offloading policies utilizing self attention mechanism to address various output dimensions. finally the experiments on two real world data sets show that tpdmaac can quickly adapt to a new environment. and compared to existing algorithms tpdmaac reduces the system cost by 11.01%‚äì12.03% as well as improves task completion rates by 10.45%‚äì13.56%.", "Pub Date": "2023-04-06"}