{"Title": "Fault-Tolerant and Collusion-Resistant Lattice-Based Multidimensional Privacy-Preserving Data Aggregation in Edge-Based Smart Grid", "Authors": ["k. fan", "y. ren", "y. bai", "g. wei", "k. zhang", "h. li", "y. yang"], "Pub Date": "2024-03-08", "Abstract": "the smart grid which is an important component of smart cities is developing rapidly nowadays while the confidentiality and integrity of consumption data of customers become significant security issues. although existing privacy preserving aggregation schemes reduce the communication overhead and protect the privacy of users‚äô multidimensional power data most of them are vulnerable and possess no quantum resistant properties. in this article we combine the chinese remainder theorem  crt  and the bit decomposition method to provide multibit homomorphic properties for the quantum resistant algorithm number theory research unit  ntru  and propose the partial homomorphic ntru  ph ntru . then based on the algorithm we design the lattice based multidimensional data privacy preserving data aggregation scheme named ftcr lmppda in which the edge devices work as aggregator gateways. specifically smart meters participating in the aggregation process share zero sum numbers to resist collusion attacks. error retransmission mechanism and random number reconstruction algorithm are introduced to enhance the robustness of this scheme and provide our system with the ability to recover from faults. in addition security analysis shows our scheme can resist quantum attacks collusion attacks and other internal and external attacks as well as keep the security features such as confidentiality privacy and integrity of users‚äô data. finally performance evaluation demonstrates that our scheme is more efficient than existing schemes and is more suitable for devices with constrained resources.", "Doi": "10.1109/JIOT.2023.3323542", "Key Words": ["collusion resistance", "edge-computing-based smart grid (ecsg)", "lattice-based homomorphic algorithm", "multidimensional data aggregation", "privacy-preserving"]}