{"Title": "Fault Diagnosis of Laminar Cooling Roller Motor Based on Morphological Recognition and Combination Patterns Mining of Multicurrent Signatures", "Authors": ["t. ma", "s. liu", "j. liu", "z. zheng", "z. li", "w. gui"], "Pub Date": "2023-03-15", "Abstract": "laminar cooling roller motor  lcrm  is the main driving equipment of laminar cooling section  lcs  in a steelmaking plant. to promote an intelligent upgrade of the safe management and operation of lcrms a novel fault diagnosis method based on the morphological recognition and combination pattern mining of lcrm‚äôs multicurrent signatures is proposed. six key current signatures closely related to the faults are screened by the correlation analysis empirically in advance. a bayesian limited memory broyden‚äìfletcher‚äìgoldfarb‚äìshanno  l bfgs  algorithm is proposed to obtain the smooth boundary morphology by the curve fitting of the boundary sequences of the upper and lower quantiles of every windowed current signature. then a triplet cnn fused k nearest neighbor  knn  with gated recurrent unit  gru  and transformer termed t ckgt is proposed to identify the fault related abnormal current signature morphology under a constraint of limited samples. specifically the cnn and gru are respectively used to mine the spatial and temporal features of the boundary morphology which are fused to feed into a transformer to learn recognizable features and then a knn classifier is employed to identify the abnormal morphological type of each current signature based on the recognizable features. to mine the abnormal morphological combination patterns  amcps  of different faults the amcps of six key current signatures are taken as gene fragments of genetic algorithm  ga  to achieve the amcp library for each fault type so as to realize the online fault diagnosis efficiently by pattern matching. extensive confirmatory and comparative experiments were performed for the online fault identification of 39 lcrms in a real steelmaking plant. experimental results indicate that the proposed method can achieve a high fault recognition accuracy generally higher than 96% which outperforms the state of the art methods apparently. in addition during the actual application no critical false negatives and false positives were observed.", "Doi": "10.1109/TIM.2023.3252623", "Key Words": ["combination pattern mining", "current signatures", "fault diagnosis", "laminar cooling roller motor (lcrm)", "morphological recognition"]}