{"Title": "FCDedup: A Two-Level Deduplication System for Encrypted Data in Fog Computing", "Doi": "10.1109/TPDS.2023.3298684", "Authors": ["m. song", "z. hua", "y. zheng", "t. xiang", "x. jia"], "Key Words": ["brute-force attacks", "data reliability", "encrypted data deduplication", "fog-assisted cloud storage"], "Abstract": "distributed fog computing has received increasing attention recently and fog assisted cloud storage can provide a real time service to collect and manage large scale data for the applications of internet of things. encrypted data deduplication over cloud storage can significantly save storage space of the cloud server while protecting the confidentiality of the outsourced data. previous encrypted data deduplication schemes are mostly designed for traditional cloud storage with a two layer architecture and cannot be applied to the emerging fog assisted cloud storage that has a more complex three layer architecture  i.e. cloud server fog node and endpoint device . in this paper we design analyze and implement fcdedup a new encrypted data deduplication scheme for fog assisted cloud storage. fcdedup is a two level deduplication system that enables each fog node to detect duplicated encrypted data uploaded by different endpoint devices as well as enables cloud server to detect duplicated encrypted data from different fog nodes. by doing so fcdedup can achieve both intra deduplication within a single data owner and inter deduplication across different data owners. fcdedup is also designed to prevent cloud server and fog nodes launching the brute force attacks and to guarantee the reliability of files downloaded from the cloud. formal analysis is provided to justify its deduplication correctness and security. besides we implement a prototype of fcdedup using alibaba cloud as backend storage. our evaluations demonstrate that fcdedup is completely compatible with existing cloud storage systems and achieves modest performance overhead.", "Pub Date": "2023-08-03"}