{"Title": "FDNet: Lightweight Train Image Fault Detection Network in Edge Computing Environments", "Doi": "10.1109/JSEN.2023.3313155", "Authors": ["l. zhang", "j. chen", "w. zeng", "z. tong", "z. wen", "x. zhang"], "Key Words": ["edge computing", "fault detection", "lightweight model", "object detection"], "Abstract": "the current train image fault detection model does not consider detection accuracy and speed and its parameters and calculation amount are large. consequently the model cannot easily satisfy the requirements of the actual edge computing scenario. therefore this study proposes a lightweight train image fault detection network  fdnet  under an edge computing environment. fdnet makes three improvements based on yolox. first fdnet designs dual path enhanced channel attention  deca  module and fuses the path aggregation network  pan  to form a deca pan module to suppress background interference highlight the object and improve the feature fusion ability of the model. second focal loss and alpha complete intersection over union  alpha ciou  loss are used to optimize the loss function to alleviate the problem of small image samples and uneven fault categories. third the receptive field fusion block is added to the fdnet detection head and three groups of detection heads are devised to detect objects at different scales to improve the detection ability of the model on multiscale objects. experimental results on the train image fault dataset demonstrate that the mean average precision  map  and speed of fdnet reach 94.82% and 103.4 frames per second  fps  respectively whereas its parameters and floating point operations are less than one sixth those of the well known yolov4. the experimental results of fdnet yolov5 s yolox s yolov6 t and yolov7 tiny in the public dataset coco2017 show that fdnet achieves the highest map of 60.60% while maintaining a high detection speed among all lightweight models. the noise and illumination robustness tests show that fdnet has good anti interference ability.", "Pub Date": "2023-10-16"}