{"Title": "FedCure: A Heterogeneity-Aware Personalized Federated Learning Framework for Intelligent Healthcare Applications in IoMT Environments", "Doi": "10.1109/ACCESS.2024.3357514", "Authors": ["s. d. n", "a. b", "s. hegde", "c. s. abhijit", "s. ambesange"], "Key Words": ["federated learning", "edge computing", "digital healthcare", "internet of medical things (iomt)"], "Abstract": "the advent of the internet of medical things  iomt  devices has led to a healthcare revolution introducing a new era of smart applications driven by artificial intelligence  artificial intelliegence . these advanced technologies have greatly influenced the healthcare industry and have played a crucial role in enhancing the quality of life globally. federated learning  fl  has become popular as a technique to create models that can be shared universally using the vast datasets collected from iomt devices while maintaining data privacy. however the complex variations in iomt environments including diverse devices data characteristics and model complexities create challenges for the straightforward application of traditional fl methods. consequently it is not well suited for deployment in such contexts. this paper introduces fedcure a personalized fl framework tailored for intelligent iomt based healthcare applications operating within a cloud edge architecture. fedcure is adept at addressing the challenges within iomt environments by employing personalized fl techniques that can effectively mitigate the impact of heterogeneity. furthermore the integration of edge computing technology enhances processing speed and minimizes latency in intelligent iomt applications. lastly this research showcases several case studies encompassing iomt based applications such as eye retinopathy detection diabetes monitoring maternal health remote health monitoring and human activity recognition. these case studies provide a means to assess the effectiveness of the proposed fedcure framework and showcase exceptional performance with accuracy and minimal communication overhead especially in addressing the challenges posed by heterogeneity.", "Pub Date": "2024-02-01"}