{"Title": "Federated Double Deep Q-Learning-Based Computation Offloading in Mobility-Aware Vehicle Clusters", "Doi": "10.1109/ACCESS.2023.3324718", "Authors": ["w. ye", "k. zheng", "y. wang", "y. tang"], "Key Words": ["internet of vehicles", "directed acyclic graph", "ddqn", "federated learning"], "Abstract": "on the edge side of internet of vehicles  iov  mobile edge computing  mec  servers with certain computational resources are deployed to provide computational service for vehicles. however with the generation of a series of vehicle computing intensive and delay sensitive applications such as virtual reality  vr  navigation and vehicle mounted games the quality of service  qos  for vehicle applications cannot be guaranteed with the limited computational resources in mecs. in this article adjacent vehicles in iov are converged into clusters based on topological stability. the idle computational resources of vehicles within the cluster are integrated and scheduled uniformly to serve vehicles within the cluster with computation task requirements. this reduces the dynamic changes in idle computational resources caused by rapid vehicle movement and effectively ensured reliable feedback of computing results after offloading computing tasks. in order to reduce the task completion time the task is decomposed into multiple subtasks with time dependencies which can be processed in parallel. a directed acyclic graph  dag  is used to characterize the task model. to further minimize latency in completing computing tasks a federated double deep q network based computation task offloading  fdto  strategy is proposed for vehicle clusters. the optimal computation task offloading decision is obtained based on the collaborative training and updating of double deep q network  ddqn . unlike traditional machine learning algorithms that require centralized training federated learning  fl  allows only the training model parameters to be passed between vehicles which not only protects data privacy but also reduces communication overhead. simulation results show that the proposed strategy can effectively reduce task completion latency compared to the benchmark strategies.", "Pub Date": "2023-10-20"}