{"Title": "Federated Learning for Medical Applications: A Taxonomy, Current Trends, Challenges, and Future Research Directions", "Doi": "10.1109/JIOT.2023.3329061", "Authors": ["a. rauniyar", "d. h. hagos", "d. jha", "j. e. h√•keg√•rd", "u. bagci", "d. b. rawat", "v. vlassov"], "Key Words": ["artificial intelligence (ai)", "communication", "data privacy", "edge computing", "federated learning (fl)", "foundational model (fms)", "large language model (llm)", "medical applications", "security"], "Abstract": "with the advent of the internet of things  iot  artificial intelligence  artificial intelliegence  machine learning  ml  and deep learning  dl  algorithms the landscape of data driven medical applications has emerged as a promising avenue for designing robust and scalable diagnostic and prognostic models from medical data. this has gained a lot of attention from both academia and industry leading to significant improvements in healthcare quality. however the adoption of artificial intelliegence driven medical applications still faces tough challenges including meeting security privacy and quality of service  qos  standards. recent developments in federated learning  fl  have made it possible to train complex machine learned models in a distributed manner and have become an active research domain particularly processing the medical data at the edge of the network in a decentralized way to preserve privacy and address security concerns. to this end in this article we explore the present and future of fl technology in medical applications where data sharing is a significant challenge. we delve into the current research trends and their outcomes unraveling the complexities of designing reliable and scalable fl models. this article outlines the fundamental statistical issues in fl tackles device related problems addresses security challenges and navigates the complexity of privacy concerns all while highlighting its transformative potential in the medical field. our study primarily focuses on medical applications of fl particularly in the context of global cancer diagnosis. we highlight the potential of fl to enable computer aided diagnosis tools that address this challenge with greater effectiveness than traditional data driven methods. recent literature has shown that fl models are robust and generalize well to new data which is essential for medical applications. we hope that this comprehensive review will serve as a checkpoint for the field summarizing the current state of the art and identifying open problems and future research directions.", "Pub Date": "2024-02-21"}