{"Title": "Federated Learning With Client Selection and Gradient Compression in Heterogeneous Edge Systems", "Doi": "10.1109/TMC.2023.3309497", "Authors": ["y. xu", "z. jiang", "h. xu", "z. wang", "c. qian", "c. qiao"], "Key Words": ["edge computing", "federated learning", "capability heterogeneity", "statistical heterogeneity"], "Abstract": "federated learning  fl  has recently gained tremendous attention in edge computing and internet of things due to its capability of enabling distributed clients to cooperatively train models while keeping raw data locally. however the existing works usually suffer from limited communication resources dynamic network conditions and heterogeneous client properties which hinder efficient fl. to simultaneously tackle the above challenges we propose a heterogeneity aware fl framework called fedcg with adaptive client selection and gradient compression. specifically fedcg introduces diversity to client selection and aims to select a representative client subset considering statistical heterogeneity. these selected clients are assigned different compression ratios based on heterogeneous and time varying capabilities. after local training they upload sparse model updates matching their capabilities for global aggregation which can effectively reduce the communication cost and mitigate the straggler effect. more importantly instead of naively combining client selection and gradient compression we highlight that their decisions are tightly coupled and indicate the necessity of joint optimization. we theoretically analyze the impact of both client selection and gradient compression on convergence performance. guided by the convergence rate we develop an iteration based algorithm to jointly optimize client selection and compression ratio decision using submodular maximization and linear programming. on this basis we propose the quantized extension of fedcg termed q fedcg which further adjusts quantization levels based on gradient innovation. extensive experiments on both real world prototypes and simulations show that fedcg and its extension can provide up to 6.4√ó speedup.", "Pub Date": "2024-04-04"}