{"Title": "Federated Recognition Architecture Based on Voting and Feedback Mechanisms for Accuracy Object Classification in Distributed Edge Intelligence Environment", "Doi": "10.1109/JSEN.2023.3285618", "Authors": ["n. a. tuan", "r. xu", "s. j. s. moe", "d. kim"], "Key Words": ["convolutional neural network (cnn)", "deep learning", "distributed edge environment", "edgex platform", "federated recognition", "internet of things", "online learning", "voting algorithms"], "Abstract": "deep learning has recently become a crucial tool to solve many complex problems and has the potential to revolutionize industries. with the widespread adoption of the internet of things there are now many devices with limited computational resources that are capable of running deep learning models. it has opened up new opportunities to implement deep learning in the edge environment so that decisions can be made locally without sending data to a cloud server for processing. however because of limited resources the model‚äôs performance and communication overhead are challenges when deploying learning models to edge devices. the focus of this article is to investigate and propose a federated recognition architecture for object classification in a distributed edge intelligence environment. specifically we build an edge server that includes a voting module and a feedback module to improve the overall accuracy of object classification. the voting module aggregates predictions of multiple edge devices whereas the feedback module sends the voting results to edge devices to adjust the local deep learning model. we build edge devices based on the edgex platform which makes it easy to manage data and optimize communication overheads. because the edge server and edge nodes only exchange prediction results our proposed architecture ensures security with sensitive data as well as deep learning model architecture. by testing on the image dataset we evaluate the proposed architecture‚äôs performance and show that it outperforms individual local models in terms of accuracy. furthermore our experiments demonstrate that with the feedback mechanism the deep learning model is constantly updated with new data to maintain accuracy and avoid being outdated. besides we prove the real time processing speed by collecting the delay time of the proposed model. the results show that our proposed architecture has the potential to be deployed in practical applications such as smart cities and surveillance systems.", "Pub Date": "2023-11-14"}