{"Title": "FL_GIoT: Federated Learning Enabled Edge-Based Green Internet of Things System: A Comprehensive Survey", "Doi": "10.1109/ACCESS.2023.3335245", "Authors": ["j. b. awotunde", "s. n. sur", "r. g. jimoh", "d. r. aremu", "d. -t. do", "b. m. lee"], "Key Words": ["federated learning", "network overhead", "energy consumption", "edge computing", "green internet of things", "security and privacy", "end-to-end delay", "route interruption"], "Abstract": "in today‚äôs world the importance of the green internet of things  giot  in the transformed sustainable smart cities cannot be overstated. for a variety of applications the giot may make use of advanced machine learning  ml  methodologies. however owing to high processing costs and privacy issues centralized ml based models are not a feasible option for the large data kept at a single cloud server and created by multiple devices. in such circumstances edge based computing may be used to increase the privacy of giot networks by bringing them closer to users and decentralizing them without requiring a central authority. nonetheless enormous amounts of data are stored in a distribution mechanism and managing them for application purposes remains a difficulty. hence federated learning  fl  is one of the most promising solutions for bringing learning to end devices through edge computing without sharing private data with a central server. therefore the paper proposes a federated learning enabled edge based giot system which seeks to improve the communication strategy while lowering liability in terms of energy management and data security for data transmission. the proposed model uses fl to produce feature values for data routing which could aid in sensor training for identifying the best routes to edge servers. furthermore combining fl enabled edge based techniques simplifies security solutions while also allowing for a more efficient computing system. the experimental results show an improved performance against existing models in terms of network overhead route interruption energy consumption and end to end delay route interruption.", "Pub Date": "2023-12-08"}