{"Title": "FLIRRAS: Fast Learning With Integrated Reward and Reduced Action Space for Online Multitask Offloading", "Doi": "10.1109/JIOT.2022.3222295", "Authors": ["m. ma", "c. gong", "l. wu", "y. yang"], "Key Words": ["low-complexity deep reinforcement learning (drl)", "multiaccess edge computing (mec)", "online task offloading (to)", "resource allocation (ra)"], "Abstract": "with the rapid development of edge data intelligence task offloading  to  and resource allocation  ra  optimization in multiaccess edge computing networks can significantly improve the quality of service  qos . however for the online scenario traditional methods  e.g. game theory and numerical methods  cannot adapt to dynamic environments. deep reinforcement learning  drl  is applied to adjust the policy to get long term rewards. nevertheless since the joint problem of to and ra is nonconvex and np hard existing drl methods cannot guarantee high efficiency because of the large action space. to solve the above problem we propose a fast learning with integrated reward and reduced action space based drl framework  flirras  which adopts a low complexity approach to jointly optimize to and ra strategies. the flirras framework combines drl with numerical methods to iteratively pursues the discrete to and continuous ra. specifically a deep neural network  dnn  is used to learn environmental information which can get prior knowledge of the offloading decision. furthermore a novel reward integrating the utility of to and ra is designed to motivate the agent to find the optimal policy. to solve the dilemma that the action space is too large low complexity convex optimization methods i.e. subgradient projection and kkt condition are used to supplement and adjust the decision which reduces the network parameters and the decision space. in addition given the dynamic online environment we introduce the experience replay mechanism where policy is updated regularly to reflect the best mapping between states. the experiment results show that the performance of flirras is better than greedy and other drl approaches and it outperforms the latest drl method by over 18.0% in terms of execution time.", "Pub Date": "2023-03-07"}