{"Title": "FLoadNet: Load Balancing in Fog Networks With Cooperative Multiagent Using Actor‚ÄìCritic Method", "Doi": "10.1109/TNSM.2022.3210827", "Authors": ["j. baek", "g. kaddoum"], "Key Words": ["fog computing", "sdn", "load balancing", "computation offloading", "deep-reinforcement learning", "multi-agent learning", "actor-critic"], "Abstract": "the growing demands of the internet of things  iot  require a platform that supports real time interactions and high availability of services to devices. in this context the fog computing paradigm has emerged as an attractive solution for processing the data of iot applications. owing to the unpredictable traffic demands and resource heterogeneity in the fog environment a smart workload distribution is essential to achieve high resource utilization and computing efficiency. to this end this paper considers a joint link and server load balancing problem with multiple cooperative access points  aps  in a combined edge fog cloud environment. the joint optimization problem is formulated as a stochastic game and an actor critic reinforcement learning framework called floadnet is proposed to optimize the joint policy of the multi agents. floadnet consists of a centralized critic network with parameter sharing and distributed individual actor networks in all the aps. due to the learning dynamics and partially observable environment we propose an extended critic network model where cooperative aps learn to communicate among themselves while evaluating the value function. unlike previous studies the proposed critic network is designed to train both value and message functions which is shown to significantly reduce the computational cost. the main goal of this work is to advance the development of efficient edge learning and the application of distributed learning algorithms specifically to fog network load balancing. the experimental results show that floadnet outperforms baseline load balancing methods.", "Pub Date": "2023-03-10"}