{"Title": "Formal Analysis of Post-Quantum Hybrid Key Exchange SSH Transport Layer Protocol", "Authors": ["d. d. tran", "k. ogata", "s. escobar", "s. akleylek", "a. otmani"], "Pub Date": "2024-01-05", "Abstract": "facing the quantum attack threat a quantum resistant version of the ssh transport layer protocol has been proposed and been standardized by an ietf working group. this standardization process has been motivated by the fact that if practical quantum computers become available classical key exchange algorithms used today will no longer be safe because their security can be efficiently broken by shor‚äôs algorithm running on a quantum computer. in this paper we construct a symbolic model of the proposed protocol specify it in the specification language cafeobj and conduct a formal analysis of the claimed security properties with the employment of a formal method tool called invariant proof score generator  ipsg . three security properties are formally verified with respect to an unbounded number of protocol participants and protocol executions by employing ipsg to produce their formal proofs the so  called proof scores in cafeobj. with another property namely authentication we find a counterexample against it and then we propose to slightly revise the protocol. with the improved version we formally verify that the authentication property is enjoyed while the three properties remain secure. to model the presence of malicious participants we extend the dolev yao intruder which is the standard intruder model used in security protocol analysis verification because the availability assumption of large scale quantum computers gives the attacker some new capabilities. under our threat model the intruder is given capabilities of fully controlling the network as the dolev yao intruder and additionally breaking ecdh‚äôs security as well as compromising secrets.", "Doi": "10.1109/ACCESS.2023.3347914", "Key Words": ["formal verification", "post-quantum ssh", "cafeobj", "proof score", "security analysis"]}