{"Title": "Front-End Gateway System With Serial Communication Protocol Conversion and Edge Computing Platforms", "Doi": "10.1109/ACCESS.2023.3307631", "Authors": ["g. -m. sung", "l. -f. tung", "c. -j. huang", "c. -p. yu"], "Key Words": ["universal asynchronous receiver/transmitter (uart)", "inter-integrated circuit (i¬≤c)", "asynchronous communication", "edge computing", "asynchronous transfer mode", "zigbee", "internet of things", "digital integrated circuits", "field programmable gate arrays (fpga)", "application specific integrated circuits (asic)"], "Abstract": "this study presents a front end gateway system with asynchronous and synchronous serial communication protocol conversion between a universal asynchronous receiver transmitter  uart  protocol and an inter integrated circuit  i2c  protocol. the valid data and sensing data can be integrated using the i2c protocol and sent to an edge computing platform for automated data analysis. our system reduces the data processing time and the number of buses. the system has an edge computing platform that handles simple linear regression base conversion a neural network and a text database and communicates with multiple peripheral devices. the i2c master and slave are constructed on the edge computing platform and implement arbitration by using the carrier sense multiple access with collision avoidance protocol to prevent data collision. according to the results obtained from the signal tap logic analyzer in experiments conducted using a field programmable gate array board a completed 330 bit uart packet requires  $755.2~\\mu \\text{s}$  to be received and the throughput is 436.97 kbps. by contrast a 90 bit i2c packet requires  $184.6~\\mu \\text{s}$  to be received and the throughput is 487.54 kbps. the front end gateway sends integrated packets by using the i2c protocol and the operating freuency  serial clock  of the i2c slave can reach up to 3.6 mhz bidirectionally. an integrated 153 bit packet requires  $42.96~\\mu \\text{s}$  to be received by the edge computing platform and the throughput is 3.5614 mbps which is approximately 8.15 times higher than that of the uart packet. we also fabricated a front end gateway asic by using the tsmc 90 nm 1p9m cmos process.", "Pub Date": "2023-09-04"}