{"Title": "Full Electromagnetic TransientFine Modeling and Characteristics Study of AC/DC Hybrid Power Grid with High Ratio of Renewable Energy", "Doi": "10.1109/ICPET59380.2023.10367526", "Authors": ["l. sun", "h. peng", "x. qiao", "m. liu", "x. wang", "q. mu"], "Key Words": ["high proportion renewable energy", "fine modeling", "electromagnetic transient"], "Abstract": "the rapid development of renewable energy and ultra high voltage ac dc hybrid power grids has put forward higher requirements for simulation accuracy. only by accurately simulating the characteristics of renewable energy and dc in the power grid the response of the power grid to faults cant be accurately reflected. in the past digital simulations of large scale power grids were limited by the ability of simulation tools and renewable energy sources engineering models rarely used or did not use resulting in simulation accuracy issues. this article proposes an engineering fine modeling method for renewable energy and dc systems. based on the characteristics of engineering fine modeling for renewable energy and dc systems and relying on the adpss rapid modeling tool a full electromagnetic transient modeling method for large scale ac dc hybrid power grids containing high proportion of renewable energy is studied which solves the problem of difficult modeling for renewable energy and dc systems. finally the proposed full electromagnetic transient fast modeling method for ac dc hybrid power grid with high proportion of renewable energy was applied to construct an electromagnetic transient model for a high proportion of renewable energy transmission system. the influence of dc faults and different outputs of renewable energy on the overvoltage of the transmission end power grid was studied and the accuracy and effectiveness of the proposed method were verified this provides a more accurate simulation method for further in depth research on the interaction between renewable energy and ac dc in large scale power grids.", "Pub Date": "2023-12-29"}