{"Title": "Fully Learnable Hyperdimensional Computing Framework With Ultratiny Accelerator for Edge-Side Applications", "Doi": "10.1109/TC.2023.3337316", "Authors": ["t. yu", "b. wu", "k. chen", "g. zhang", "w. liu"], "Key Words": ["brain-inspired computing", "hyperdimensional computing", "edge-side hardware acceleration"], "Abstract": "brain inspired hyperdimensional computing  hdc  is a new computational paradigm that encodes input sample into a hypervector  generally with dimensions of $2k 10k$2k‚àí10k  and performs simple arithmetic and logic operations in the hyperdimensional space to complete perceptual tasks like human brain. due to its simplicity interpretability and robustness hdc has gradually become a competitor and substitute for deep neural network  dnn  in many tasks. however there exists an accuracy gap between existing heuristic hdc algorithms and dnn in computer vision tasks as existing encoding methods have difficulty in filtering out large amount of background and noise in the images and effectively extracting the spatial structure features of images. in addition the existing hardware for hdc deployment mainly focuses on in memory computing  imc  application specific integrated circuit  asic  or high capacity field programmable gate array  high capacity fpga  which cannot meet the flexibility small area and low power requirements of edge side applications. in this paper a fully learnable hdc framework with learnable preprocessing encoding and querying is proposed to boost the accuracy in computer vision tasks as well as an ultra tiny accelerator based on edge side fpga which matches the proposed framework. experiments show that on multiple commonly used image datasets the proposed hdc framework has an average computation reduction of 80% compared to other most advanced strategies while achieves a 1.2% accuracy increase. evaluation on edge side fpga shows that compared to other fpga based state of the art designs the proposed accelerator saves more than $10\\boldsymbol{\\times}$10√ó hardware resource and power consumption.", "Pub Date": "2024-01-15"}