{"Title": "Fuzzy-Based Balanced Partitioning Under Capacity and Size-Tolerance Constraints in Distributed Quantum Circuits", "Authors": ["j. -t. yan"], "Pub Date": "2023-06-16", "Abstract": "it is important for the design of a distributed quantum circuit  dqc  to minimize the communication cost in k way balanced partitioning. in this article given an original quantum circuit  qc  a partitioning number k the maximum capacity œ¥ inside each partition and the maximum size tolerance œ≥ between two partitions a new k way  œ¥ œ≥  balanced partitioning problem can be formulated as a k way partitioning problem under the capacity constraint œ¥ and the size tolerance constraint œ≥ and a fuzzy based partitioning algorithm can be proposed to minimize the communication cost in k way  œ¥ œ≥  balanced partitioning for a dqc design. first an edge weighted connection graph can be constructed from the gates in a given qc. furthermore based on the estimation of the probabilistic connection strength between two vertices in the connection graph and the initial k way partitioning result in the connection graph the fuzzy memberships on k clusters can be generated in fuzzy k means graph clustering. finally based on the fuzzy memberships on k clusters in the connection graph the maximum capacity inside each partition and the maximum size tolerance between two partitions all the vertices in the connection graph can be assigned onto k partitions to minimize the communication cost in k way  œ¥ œ≥  balanced partitioning. compared with daei recursive kernighan‚äìlin based algorithm in four way balanced partitioning the experimental results show that the proposed fuzzy based partitioning algorithm with three size tolerance constraints œ≥ = 1 œ≥ = 2 and œ≥ = 3 can use 58.3% 61.3% and 64.5% of cpu time to reduce 16.1% 21.2% and 24.6% of the communication cost for the eight tested circuits on the average respectively. compared with the modified partitioning algorithm from dadkhah partitioning algorithm in three way four way or five way balanced partitioning the experimental results show that the proposed fuzzy based partitioning algorithm with the size tolerance constraint œ≥ = 3 can use 35.0% of cpu time to reduce 11.1% of the communication cost for the eight tested circuits on the average respectively.", "Doi": "10.1109/TQE.2023.3272023", "Key Words": ["balanced partitioning", "communication cost", "distributed quantum circuit (dqc)", "fuzzy   $k$  -means graph clustering (fkgc)"]}