{"Title": "GA-DCTSP: An Intelligent Active Data Processing Scheme for UAV-Enabled Edge Computing", "Doi": "10.1109/JIOT.2022.3220840", "Authors": ["j. bai", "g. huang", "s. zhang", "z. zeng", "a. liu"], "Key Words": ["artificial intelligence (ai)", "edge computing", "intelligent active data processing (iadp)", "internet of things (iot)", "trajectory optimization"], "Abstract": "with the prosperous development of the internet of things  iot  large numbers of iot devices have been deployed in many scenarios to perceive the data of surroundings. to provide real time service devices prefer to transfer the data to servers for faster processing. however in some special areas with limited communication infrastructure devices cannot be directly connected to the internet so the requirements of data collection and processing are agnostic which brings a huge challenge for real time and dynamic data processing. we make the first attempt to tackle this challenge by proposing an intelligent active data processing scheme  iadp  in unmanned aerial vehicle  uav  enabled edge computing. the main innovations of iadp are as follows  1  when iot devices generate or sense data they can intelligently and proactively spread data or data information to other areas to inform uav to collect  2  our scheme combines active data processing with data deadline priority and artificial intelligence  artificial intelliegence  based uav trajectory optimization to achieve maximum data processing rate and minimum uav flight cost. specifically genetic algorithm deadline constraint traveling salesman problem  ga dctsp  algorithm is proposed based on improved ga to achieve it  and 3  an intelligent data processing decision mechanism of optimally determining transmitting to uav or edge server is proposed to further optimize network performance. finally the experimental results show that our proposed iadp increases the data processing rate by 48.77%‚äì232.54% and reduces the uav flight distance by 63.45%‚äì88.36% compared with the existing schemes.", "Pub Date": "2023-03-07"}