{"Title": "Gait on the Edge: A Proposed Wearable for Continuous Real-Time Monitoring Beyond the Laboratory", "Doi": "10.1109/JSEN.2023.3328054", "Authors": ["y. celik", "j. moore", "m. durgun", "s. stuart", "w. l. woo", "a. godfrey"], "Key Words": ["activity classification", "edge computing", "free living", "gait analysis", "wearable sensors"], "Abstract": "instrumented gait through objective data is important in clinical rehabilitation as it provides objective mobility assessment. typically those data help pinpoint the root causes of mobility impairments subsequently enabling the foundation for the development of effective rehabilitation protocols programs. inertial sensors based wearables such as accelerometers collect high resolution data beyond the laboratory over prolonged periods. however that results in big data that is expensive to store and time consuming to process. equally streaming inertial data to a base station  e.g. smartphone  has notable challenges such as high bandwidth requirements and high power consumption. here we present a novel wearable edge device that overcomes those challenges by utilizing edge computing. the developed edge device can collect and process raw data on the device and then only transfers the extracted gait characteristics to the cloud via a mobile phone connection for real time monitoring. in the processing stage the developed edge device detects walking gait bouts and extracts step and stride durations without requiring data storage and offline processing. the accuracy and reliability of the device were investigated by comparison to reference technology in the laboratory. interclass correlation coefficients  iccs  between the edge device and reference were  $\\ge 0.935$  0.971 and 0.973 for slow preferred and fast walking respectively. beyond the laboratory mean absolute error  mae  values for the step and stride durations between the edge device and reference were 0.001 and 0.007 s respectively. results suggest that the edge device is suitable for instrumenting gait in real time and has the potential to be used continuously beyond the laboratory.", "Pub Date": "2023-11-30"}