{"Title": "Game-Based Computation Offloading and Power Allocation for LEO Constellation Networks in Distributed and Dynamic Environment", "Doi": "10.1109/JIOT.2023.3314650", "Authors": ["y. gao", "z. ji", "k. zhao", "t. de cola", "w. li"], "Key Words": ["computation offloading", "dynamic environment", "leo constellation network", "potential game", "power allocation"], "Abstract": "to build the new generation of ubiquitous communication and service integration networks with ‚äúnetwork omnipresence and computing ubiquitous‚äù it is urgent to improve the in orbit computing ability of low earth orbit  leo  constellation networks and develop intelligent technology for satellite‚äìground collaborative edge computing. communication tasks between ground nodes and satellites are increasing but the satellite to ground spectrum resources are limited. the reasonable application of channels determines the performance of the network which in turn affects the users‚äô experience. an outstanding issue is how to allocate channels rationally and control the power of data transmission to reduce co channel interference and minimize system overhead effectively. this article studies multiuser computation offloading for low earth orbit  leo  constellation networks under dynamic environment wherein the system overhead is minimized by joint offloading strategy and power optimization. first we propose a generic network architecture for computation offloading of leo constellation networks under the dynamic environment. then from a game theoretic perspective we model the overhead minimization problem as a potential game and prove that the nash equilibrium  ne  minimizes the system overhead. after that to reach the ne we design the synchronous log linear learning based power control algorithm and joint offloading strategy and power optimization algorithm based on sla  jopas  and prove the convergence of the algorithms. finally the effectiveness of the proposed algorithm is verified through extensive simulations and comparisons with benchmark algorithms and the proposed algorithm achieves near optimal performance.", "Pub Date": "2024-02-05"}