{"Title": "General System Architecture and COTS Prototyping of an AIoT-Enabled Sailboat for Autonomous Aquatic Ecosystem Monitoring", "Doi": "10.1109/JIOT.2023.3324525", "Authors": ["a. p. d. de ara√∫jo", "d. h. j. daniel", "r. guerra", "d. n. brand√£o", "e. c. vasconcellos", "a. p. f. negreiros", "e. w. g. clua", "l. m. g. gon√ßalves", "p. preux"], "Key Words": ["artificial intelligence of things (aiot)", "autonomous robots", "internet of things (iot)", "sailboats", "usv"], "Abstract": "unmanned vehicles keep growing attention as they facilitate innovative commercial and civil applications within the internet of things  iot  realm. in this context autonomous sailing boats are becoming important marine platforms for performing different tasks such as surveillance water and environmental monitoring. most of these tasks heavily depend on artificial intelligence  ai  technologies such as visual navigation and path planning and comprise the so called ai of things  aiot . in this article we propose 1  the openboat an automating system architecture for aiot enabled sailboats with application agnostic autonomous environment monitoring capability and 2  the f boat a fully functional prototype of openboat built with commercial off the shelf  cots  components on a real sailboat. f boat includes low level control strategies for autonomous path following communication infrastructure for remote operation and cooperation with other systems edge computing with ai accelerator modular support for application specific monitoring systems and navigation aspects. f boat is also designed and built for robustness situations to guarantee its operation under extreme events such as high temperatures and bad weather through extended periods of time. we show the results of field experiments running in guanabara bay an important aquatic ecosystem in brazil that demonstrate the functionalities of the prototype and demonstrate the aiot capability of the proposed architecture.", "Pub Date": "2024-01-24"}