{"Title": "Generalizing to Out-of-Sample Degradations via Model Reprogramming", "Authors": ["r. jiang", "y. han"], "Pub Date": "2024-04-11", "Abstract": "existing image restoration models are typically designed for specific tasks and struggle to generalize to out of sample degradations not encountered during training. while zero shot methods can address this limitation by fine tuning model parameters on testing samples their effectiveness relies on predefined natural priors and physical models of specific degradations. nevertheless determining out of sample degradations faced in real world scenarios is always impractical. as a result it is more desirable to train restoration models with inherent generalization ability. to this end this work introduces the out of sample restoration  osr  task which aims to develop restoration models capable of handling out of sample degradations. an intuitive solution involves pre translating out of sample degradations to known degradations of restoration models. however directly translating them in the image space could lead to complex image translation issues. to address this issue we propose a model reprogramming framework which translates out of sample degradations by quantum mechanic and wave functions. specifically input images are decoupled as wave functions of amplitude and phase terms. the translation of out of sample degradation is performed by adapting the phase term. meanwhile the image content is maintained and enhanced in the amplitude term. by taking these two terms as inputs restoration models are able to handle out of sample degradations without fine tuning. through extensive experiments across multiple evaluation cases we demonstrate the effectiveness and flexibility of our proposed framework. our codes are available at https //github.com ddghjikle/out of sample restoration.", "Doi": "10.1109/TIP.2024.3378181", "Key Words": ["image restoration", "out-of-sample degradation", "model reprogramming", "image-to-image translation"]}