{"Title": "GHz Rate Neuromorphic Photonic Spiking Neural Network With a Single Vertical-Cavity Surface-Emitting Laser (VCSEL)", "Authors": ["d. owen-newns", "j. robertson", "m. hejda", "a. hurtado"], "Pub Date": "2022-09-30", "Abstract": "vertical cavity surface emitting lasers  vcsels  are highly promising devices for the construction of neuromorphic photonic information processing systems due to their numerous desirable properties such as low power consumption high modulation speed and compactness. of particular interest is the ability of vcsels to exhibit neuron like spiking responses at ultrafast sub nanosecond rates  thus offering great prospects for high speed light enabled spike based processors. recent works have shown spiking vcsels are capable of tackling pattern recognition and image processing problems but additionally vcsels have been used as nonlinear elements in photonic reservoir computing  rc  implementations yielding state of the art operation. this work introduces and experimentally demonstrates for the first time a new ghz rate photonic spiking neural network  snn  built with a single vcsel neuron. the reported system effectively implements a photonic vcsel based spiking reservoir computer and demonstrates its successful application to a complex nonlinear classification task. importantly the proposed system benefits from a highly hardware friendly inexpensive realization  a single vcsel device and off the shelf fibre optic components  for high speed  ghz rate inputs  and low power  sub mw optical input power  photonic operation. these results open new pathways towards future neuromorphic photonic spike based processing systems based upon vcsels  or other laser types  for novel ultrafast machine learning and artificial intelliegence hardware.", "Doi": "10.1109/JSTQE.2022.3205716", "Key Words": ["vertical cavity surface emitting lasers", "semiconductor lasers", "artificial neural networks", "neural network hardware", "spiking neural network", "photonic reservoir computing"]}