{"Title": "GNN at the Edge: Cost-Efficient Graph Neural Network Processing Over Distributed Edge Servers", "Doi": "10.1109/JSAC.2022.3229422", "Authors": ["l. zeng", "c. yang", "p. huang", "z. zhou", "s. yu", "x. chen"], "Key Words": ["edge intelligence", "graph neural networks", "cost optimization", "distributed edge computing"], "Abstract": "edge intelligence has arisen as a promising computing paradigm for supporting miscellaneous smart applications that rely on machine learning techniques. while the community has extensively investigated multi tier edge deployment for traditional deep learning models  e.g. cnns rnns  the emerging graph neural networks  gnns  are still under exploration presenting a stark disparity to its broad edge adoptions such as traffic flow forecasting and location based social recommendation. to bridge this gap this paper formally studies the cost optimization for distributed gnn processing over a multi tier heterogeneous edge network. we build a comprehensive modeling framework that can capture a variety of different cost factors based on which we formulate a cost efficient graph layout optimization problem that is proved to be np hard. instead of trivially applying traditional data placement wisdom we theoretically reveal the structural property of quadratic submodularity implicated in gnn‚äôs unique computing pattern which motivates our design of an efficient iterative solution exploiting graph cuts. rigorous analysis shows that it provides parameterized constant approximation ratio guaranteed convergence and exact feasibility. to tackle potential graph topological evolution in gnn processing we further devise an incremental update strategy and an adaptive scheduling algorithm for lightweight dynamic layout optimization. evaluations with real world datasets and various gnn benchmarks demonstrate that our approach achieves superior performance over de facto baselines with more than 95.8% cost reduction in a fast convergence speed.", "Pub Date": "2023-02-15"}