{"Title": "GoComfort: Comfortable Navigation for Autonomous Vehicles Leveraging High-Precision Road Damage Crowdsensing", "Doi": "10.1109/TMC.2022.3198089", "Authors": ["l. chen", "x. he", "x. zhao", "h. li", "y. huang", "b. zhou", "w. chen", "y. li", "c. wen", "c. wang"], "Key Words": ["comfortable route planning", "mobile crowdsensing", "road damage identification", "urban computing"], "Abstract": "recent years have witnessed rapid advances in autonomous driving technologies. autonomous vehicles are more likely to be accepted if they drive comfortably to avoid potholes bumps and other road damage conditions especially when there are elderly and disabled passengers on board. traditionally sensing road damage conditions is either labor intensive by field investigation and reporting or inaccurate by surveillance cameras and driving recorders due to limited perspective. in this paper we propose gocomfort a crowdsensing based framework to provide low cost and fine grained comfortable navigation for autonomous vehicles with road damage identification leveraging high precision road sensing data. first we propose to exploit city wide autonomous vehicle fleets as crowdsensing participants and employ an edge cloud hybrid computing paradigm to efficiently collect high precision road damage related data including 3d lidar point clouds and street view images. second we design an accurate road damage identification model fusing spatial structures of point clouds and texture features of street view images and use an active learning based method to address the sparse labels issue. finally we devise two comfortable navigation scenarios i.e. fine grained road damage avoidance and coarse grained city wide navigation and propose a hierarchical road damage assessment diagram for comfortable route planning. experiments using real world road sensing data in xiamen china show that our approach identifies road damage conditions with an accuracy of 87.5% and achieves a user acceptance rate of 93.8% in riding comfort evaluation outperforming the state of the art baselines.", "Pub Date": "2023-10-03"}