{"Title": "Handoff-Aware Distributed Computing in High Altitude Platform Station (HAPS)‚ÄìAssisted Vehicular Networks", "Doi": "10.1109/TWC.2023.3266344", "Authors": ["q. ren", "o. abbasi", "g. k. kurt", "h. yanikomeroglu", "j. chen"], "Key Words": ["internet of vehicles (iov)", "high altitude platform station (haps)", "distributed computing", "edge network handoff"], "Abstract": "distributed computing enables internet of vehicle  iov  services by collaboratively utilizing the computing resources from the network edge and the vehicles. however the computing interruption issue caused by frequent edge network handoffs and a severe shortage of computing resources are two problems in providing iov services. high altitude platform station  haps  computing can be a promising addition to existing distributed computing frameworks because of its wide coverage and strong computational capabilities. in this regard this paper proposes an adaptive scheme in a new distributed computing framework that involves haps computing to deal with the two problems of the iov. based on the diverse demands of vehicles network dynamics and the time sensitivity of handoffs the proposed scheme flexibly divides each task into three parts and assigns them to the vehicle roadside units  rsus  and a haps to perform synchronous computing. the scheme also constrains the computing of tasks at rsus such that they are completed before handoffs to avoid the risk of computing interruptions. on this basis we formulate a delay minimization problem that considers task splitting ratio transmit power bandwidth allocation and computing resource allocation. to solve the problem variable replacement and successive convex approximation‚äìbased method are proposed. the simulation results show that this scheme not only avoids the negative effects caused by handoffs in a flexible manner it also takes delay performance into account and maintains the delay stability.", "Pub Date": "2023-12-12"}