{"Title": "Hardware Implementation of Edge Neural Network Computing for Sensor With Memristors Based on Single-Crystalline LiNbO3 Thin Film", "Doi": "10.1109/JSEN.2023.3248123", "Authors": ["x. pan", "w. luo", "y. shuai", "s. hu", "w. luo", "g. qiao", "t. zhou", "j. wang", "q. xie", "s. huang", "y. liu", "c. wu", "w. zhang"], "Key Words": ["artificial intelligent iot (aiot)", "edge computing", "integration of sensing memory computing", "memristor", "neural network"], "Abstract": "with the development of artificial intelligent iot  aiot  and dramatic increase of the amount of data conventional architecture in which all the data collected by sensors are sent to the data center for processing and computing suffered from heavy computing load in the data center latency and high energy consumption. edge neural network computing at the sensor terminal is demanding. based on the advantages of memristor in nature co location of memory and computing high computing parallelism low energy consumption and miniaturization potential we proposed to take use of memristors to conduct edge neural network computing at sensor and realize the integration of sensing memory computing. also in order to solve the problems caused by resistance states variation and device to device variation without transistor connected in series highly uniform memristors based on single crystalline linbo3  ln  thin film with two stable resistance states were fabricated and utilized to realize binarized neural networks computing and the coupling between the pressure sensor output signal with the input of the memristor array has been built. the hardware implementation of memristor based edge neural network computing on the signals of pressure sensor array has been realized. with the memristor based edge neural network computing recognition of three letters  ‚äúv‚äù ‚äúz‚äù and ‚äút‚äù  wrote on the pressure sensor array has been realized.", "Pub Date": "2023-04-14"}