{"Title": "Hardware Design and Implementation of Multiagent MLP Regression for the Estimation of Gunshot Direction on IoBT Edge Gateway", "Doi": "10.1109/JSEN.2023.3278748", "Authors": ["n. b. gaikwad", "s. k. khare", "h. ugale", "d. mendhe", "v. tiwari", "v. bajaj", "a. g. keskar"], "Key Words": ["edge intelligence", "field programmable gate array (fpga)", "gunshot direction", "internet of battlefield things (iobt)", "multiagent systems", "multilayer perceptron", "smart glove"], "Abstract": "the advancements in the internet of things  iot  artificial intelligence and state of the art computing techniques are the main pillars of the next generation defense technology. the internet of battlefield things  iobt  with edge intelligence offers new opportunities for defense professionals for smart and effective military operations. the iobt network connects soldiers by placing smart sensors on armor weapons bodies and surroundings. this article presents a novel edge intelligence based estimation of gunshot direction from the sensor enabled glove for smart iobt wearables. a multiagent multilayer perceptron  ma mlp  and other regression models are developed and tested on the experimental dataset collected during this study. the ma mlp model consists of two distinct mlp networks and a fusion block to estimate the gunshot direction. this article demonstrates the effect of multiple subjects sensor positions and gun material on the mean absolute error  mae  of ma mlp prediction. the software simulation results show that our proposed ma mlp model has outperformed traditional machine learning techniques such as linear regression  lr  svm and mlp with an mae of 4.09¬∞. two different hardware designs that is intellectual property  ip  cores of the pretrained ma mlp model are implemented and tested on a field programmable gate array  fpga  for a system on a chip  soc  based edge gateway. the first ip core requires 280 ns with a power consumption of 354 milliwatts while the second ip core requires 380 ns with 178 milliwatts power consumption per inference. prediction accuracy  pa  of 97.48% with a reduction of throughput to 92.2% is achieved for both ip cores. this work is one of the first attempts to implement fpga based edge intelligence for iobt wearables. the short computation time low power consumption small footprint significant throughput reduction desired accuracy and processor offloading are achieved by both flexible hardware models designed explicitly for edge intelligence.", "Pub Date": "2023-06-29"}