{"Title": "Health Monitoring and Diagnosis for Geo-Distributed Edge Ecosystem in Smart City", "Doi": "10.1109/JIOT.2023.3247640", "Authors": ["w. wen", "u. demirbaga", "a. singh", "a. jindal", "r. s. batth", "p. zhang", "g. s. aujla"], "Key Words": ["big data", "distributed systems", "edge computing", "self-organized maps (soms)", "smart city"], "Abstract": "with the increasing number of internet of things  iot  devices being deployed and used in daily life the load on computational devices has grown exponentially. this situation is more prevalent in smart cities where such devices are used for autonomous control and monitoring. smart cities have different kinds of applications that are aided through iot devices that collect data send it to computational processing and storage devices and get back decisions or actuate the actions based on the input data. there has been a stringent requirement to reduce the end to end delay in this process owing to the remote deployment of cloud data centres. this eventually led to the revolution of edge computing wherein nano‚äìmicro processing devices can be deployed closer to the premises of the smart application and process the data generated with a lower turnaround time. however due to the limited computational power and storage controlling the workload diverted to the edge devices has been challenging. the workload scheduling policies and task allocation schemes often fail to consider the run time health of the edge devices due to a lack of proper monitoring infrastructure. thus in this article we proposed a health monitoring and diagnosis framework for geo distributed edge clusters processing big data generated by smart city applications. this framework is built over the map reduce approach for distributed processing of big data on edge clusters deployed across the smart city. within this framework smartmonit  a monitoring agent  is deployed that collects the health statistics of edge devices and predicts the potential failures using an artificial neural network based self organising maps approach. the proposed framework is deployed over different clusters to test the efficacy concerning failure detection.", "Pub Date": "2023-10-19"}