{"Title": "Hedera: A Permissionless and Scalable Hybrid Blockchain Consensus Algorithm in Multiaccess Edge Computing for IoT", "Doi": "10.1109/JIOT.2023.3279108", "Authors": ["y. tang", "j. yan", "c. chakraborty", "y. sun"], "Key Words": ["asynchronous byzantine", "blockchain", "hybrid consensus", "internet of things (iot)", "multiaccess edge computing (mec)", "proof of capacity (poc)"], "Abstract": "multiaccess edge computing  mec  network as one of the key infrastructures of iot provides cloud computing capabilities at the edge of the radio access network  ran  by integrating telecommunication and it services. integrating blockchain into the mec network can provide users with secure private and traceable edge computing services at the near end thereby improving iot security privacy and automated use of resources. due to some characteristics of the mec network there are still some challenges to integrate blockchain and edge computing into one system especially the consensus algorithm of blockchain. the resources of edge computing nodes are limited and the scale of the network is constantly expanding. therefore the blockchain consensus algorithm for the mec network should occupy as little computing resources as possible be green and be permissionless. this article proposes a permissionless and scalable consensus algorithm ‚äúhedera‚äù for mec network which has the advantages of permissionless security decentralization scalability and greenness. the hedera consensus algorithm is a hybrid blockchain consensus algorithm that combines the permissionless proof of capacity algorithm and the permissioned asynchronous byzantine algorithm. this article tests the fairness throughput scalability latency and resource consumption of the algorithm by developing and deploying a prototype system. the experimental results show that the hedera algorithm proposed in this article is fair the throughput reaches 13986.3 tps and the resource consumption is much lower than the pow consensus. by analyzing its security and liveness it can resist the sybil attack nothing at stake attack selfish mining attack and message hijacking attack and has good liveness.", "Pub Date": "2023-12-11"}