{"Title": "Heterogeneous Computational Resource Allocation for NOMA: Toward Green Mobile Edge-Computing Systems", "Doi": "10.1109/TSC.2022.3186099", "Authors": ["a. mohajer", "m. sam daliri", "a. mirzaei", "a. ziaeddini", "m. nabipour", "m. bavaghar"], "Key Words": ["computational resource allocation", "edge computing", "service fairness", "noma hetnet", "energy efficiency"], "Abstract": "mobile edge computing  mec  is a viable solution in response to the growing demand for broadband services in the new generation heterogeneous systems. the dense deployment of small cell networks is a key feature of next generation radio access networks aimed at providing the necessary capacity increase. nonetheless the problem of green networking and service computing will be of great importance in the downlink because the uncontrolled installation of too many small cells may increase operational costs and emit more carbon dioxide. in addition given the resource and computational limitation of the user layer energy efficiency  ee  and fairness assurance are critical issues in mec based cellular systems. considering the user fairness criteria this paper proposes a dynamic optimization model which maximizes the total ul dl ee along with satisfying the necessary qos constraints. based on the non convex characteristics of the ee maximization problem the mathematical model can be divided into two separate subproblems i.e. computational carrier scheduling and resource allocation. so that a subgradient method is applied for the computational resource allocation and also successive convex approximation  sca  and dual decomposition methods are adopted to solve the max min fairness problem. the simulation results exhibit considerable ee improvement for various traffic models in addition to guaranteeing the fairness requirements. it also proved that the proposed computational partitioning scheme managed to significantly improve the total throughput for mobile computing services.", "Pub Date": "2023-04-07"}