{"Title": "Heterogeneous Edge Caching Based on Actor-Critic Learning With Attention Mechanism Aiding", "Doi": "10.1109/TNSE.2023.3260882", "Authors": ["c. wang", "r. li", "x. wang", "t. taleb", "s. guo", "y. sun", "v. c. m. leung"], "Key Words": ["actor-critic learning", "attention mechanism", "edge caching", "multi-agent caching"], "Abstract": "in recent years the explosive growth of network traffic has placed significant strain on backbone networks. to alleviate the content access delay and reduce additional network resource consumption resulting from large scale requests edge caching has emerged as a promising technology. despite capturing substantial attention from both academia and industry most existing studies overlook the heterogeneity of the environment and the spatial temporal characteristics of content popularity. as a result the potential for edge caching remains largely unexploited. to address these challenges we propose a neighborhood aware caching  nac  framework in this paper. the framework leverages the perimeter information from neighboring base stations  bss  to model the edge caching problem in heterogeneous scenarios as a markov decision process  mdp . to fully exploit the environmental information we introduce an improved actor critic method that integrates an attention mechanism into the neural network. the actor network in our framework is responsible for making caching decisions based on local information while the critic network evaluates and enhances the actor performance. the multi head attention layer in the critic network enables integration of environmental features into the model reducing the limitations associated with local investigation. to facilitate comparison from an engineering perspective we also propose a heuristic algorithm neighbor influence least frequently use  nilfu . our extensive experiments demonstrate that the proposed nac framework outperforms other baseline methods in terms of average delay hit rate and traffic offload ratio in heterogeneous scenarios. this highlights the effectiveness of the neighborhood aware caching approach in enhancing the performance of edge caching systems in such scenarios.", "Pub Date": "2023-10-24"}