{"Title": "HGR-ResNet: Hand Gesture Recognition with Enhanced Residual Neural Network", "Doi": "10.1109/ICoICT58202.2023.10262710", "Authors": ["c. k. tan", "k. ming lim", "c. p. lee", "r. kwang yang chang", "j. y. lim"], "Key Words": ["hand gesture recognition", "resnet", "sign language recognition", "human-computer interaction"], "Abstract": "hand gesture recognition  hgr  has garnered increasing attention in recent years due to its potential to enhance human computer interaction  hci  and facilitate communication between individuals who are mute or deaf and the wider public. hgr can facilitate non contact interaction between humans and machines offering an effective interface for recognizing sign language used in everyday communication. this paper proposes a novel approach for static hgr using transfer learning of resnet152 with early stopping adaptive learning rate and class weightage techniques referred to as hgr resnet. transfer learning enables the model to utilize previously acquired knowledge from pre training on a large dataset allowing it to learn from pre extracted image features. early stopping serves as a regularization technique halting the training process before overfitting occurs. adaptive learning rate adjusts the learning rate dynamically based on the model error rate during training promoting faster convergence and improved accuracy. additionally the class weightage technique is employed to address the issue of class imbalance in the data ensuring fair representation and mitigating biases during the training process. to assess the effectiveness of the proposed model we conduct a comparative analysis with multiple existing methods using three distinct datasets  the american sign language  asl  dataset asl with digits dataset and the national university of singapore  nus  hand gesture dataset. hgr resnet achieves remarkable results with an average accuracy of 99.20% across all three datasets and individual accuracies of 99.88% for the asl dataset 98.93% for the asl with digits dataset and 98.80% for the nus hand gesture dataset.", "Pub Date": "2023-09-29"}