{"Title": "HI-Kyber: A Novel High-Performance Implementation Scheme of Kyber Based on GPU", "Authors": ["x. ji", "j. dong", "t. deng", "p. zhang", "j. hua", "f. xiao"], "Pub Date": "2024-04-05", "Abstract": "crystals kyber as the only public key encryption  pke  algorithm selected by the national institute of standards and technology  nist  in the third round is considered one of the most promising post quantum cryptography  pqc  schemes. lattice based cryptography uses complex discrete algorithm problems on lattices to build secure encryption and decryption systems to resist attacks from quantum computing. performance is an important bottleneck affecting the promotion of post quantum cryptography. in this paper we present a high performance implementation of kyber  named hi kyber  on the nvidia gpus which can increase the key exchange performance of kyber to the million level. firstly we propose a lattice based pqc implementation architecture based on kernel fusion which can avoid redundant global memory access operations. secondly we optimize and implement the core operations of crystals kyber including number theoretic transform  ntt  inverse ntt  intt  pointwise multiplication etc. especially for the calculation bottleneck ntt operation three novel methods are proposed to explore extreme performance  the sliced layer merging  slm  the sliced depth first search  sdfs ntt  and the entire depth first search  edfs ntt  which achieve a speedup of 7.5% 28.5% and 41.6% compared to the native implementation. thirdly we conduct comprehensive performance experiments with different parallel dimensions based on the above optimization. finally our key exchange performance reaches 1664 kops s. specifically based on the same platform our hi kyber is 3.52√ó that of the gpu implementation based on the same instruction set and 1.78√ó that of the state of the art one based on ai accelerated tensor core.", "Doi": "10.1109/TPDS.2024.3379734", "Key Words": ["gpu", "kyber", "ntt", "pqc", "polynomial multiplication"]}