{"Title": "HierFedML: Aggregator Placement and UE Assignment for Hierarchical Federated Learning in Mobile Edge Computing", "Doi": "10.1109/TPDS.2022.3218807", "Authors": ["z. xu", "d. zhao", "w. liang", "o. f. rana", "p. zhou", "m. li", "w. xu", "h. li", "q. xia"], "Key Words": ["mobile edge computing", "federated learning", "aggregator placement and ue assignment", "hierarchical federated learning framework", "approximation algorithms", "online learning algorithms"], "Abstract": "federated learning  fl  is a distributed machine learning technique that enables model development on user equipments  ues  locally without violating their data privacy requirements. conventional fl adopts a single parameter server to aggregate local models from ues and can suffer from efficiency and reliability issues ‚äì especially when multiple users issue concurrent fl requests. hierarchical fl consisting of a master aggregator and multiple worker aggregators to collectively combine trained local models from ues is emerging as a solution to efficient and reliable fl. the placement of worker aggregators and assignment of ues to worker aggregators plays a vital role in minimizing the cost of implementing fl requests in a mobile edge computing  mec  network. cost minimization associated with joint worker aggregator placement and ue assignment problem in an mec network is investigated in this work. an optimization framework for fl and an approximation algorithm with an approximation ratio for a single fl request is proposed. online worker aggregator placements and ue assignments for dynamic fl request admissions with uncertain neural network models where fl requests arrive one by one without the knowledge of future arrivals is also investigated by proposing an online learning algorithm with a bounded regret. the performance of the proposed algorithms is evaluated using both simulations and experiments in a real testbed with its hardware consisting of server edge servers and devices and software built upon an open source hierarchical fedml  hierfedml  environment. simulation results show that the performance of the proposed algorithms outperform their benchmark counterparts by reducing the implementation cost by at least 15% per fl request. experimental results in the testbed demonstrate the performance gain using the proposed algorithms using real datasets for image identification and text recognition applications.", "Pub Date": "2022-12-06"}