{"Title": "High Throughput Acceleration of Scabbard Key Exchange and Key Encapsulation Mechanism Using Tensor Core on GPU for IoT Applications", "Authors": ["m. a. hafeez", "w. -k. lee", "a. karmakar", "s. o. hwang"], "Pub Date": "2023-10-30", "Abstract": "high throughput key encapsulations and decapsulations are needed by internet of things  iot  applications in order to simultaneously process a multitude of small data in secure communication. in this article we present two novel techniques for accelerating the implementation of polynomial convolution on a graphics processing unit  gpu  utilizing advanced tensor cores which benefit the performance of key encapsulations. first a polynomial restructuring technique is proposed to allow several polynomials with distinct public keys to be processed in a single communication cycle. this is an improvement compared to the previous work by lee et al. next we observe that polynomial convolution in some key encapsulation mechanisms contains reduction patterns that are not friendly to parallel implementation. we propose separating the multiplication and reduction processes so they can be parallelized independently. to verify the effectiveness of our proposed techniques we applied it to two key encapsulation mechanisms from the scabbard post quantum key encapsulation mechanism suite and evaluate their performance. experimental results show that polynomial convolution using tensor cores is  $1.05\\times $  faster  for the florete scheme  and  $3.6\\times $  faster  for the sable scheme  than using compute unified device architecture core based multiplication with conventional cores on a gpu. the tensor cores based encapsulations and decapsulations are faster than a reference implementation on a cpu supporting avx2 by more than  $5.6\\times $  and  $6.4\\times $  respectively for the florete scheme and  $8.3\\times $  and  $13.3\\times $  faster respectively for the sable scheme. this shows that the proposed techniques can achieve significantly higher throughput for key exchange and encapsulation mechanisms which are important for securing iot applications.", "Doi": "10.1109/JIOT.2023.3282255", "Key Words": ["cryptography", "general matrix multiplication (gemm)", "lattice-based cryptography", "polynomial convolution", "post-quantum cryptography (pqc)", "tensor cores"]}