{"Title": "High-Speed NTT Accelerator for CRYSTAL-Kyber and CRYSTAL-Dilithium", "Authors": ["t. -h. nguyen", "b. kieu-do-nguyen", "c. -k. pham", "t. -t. hoang"], "Pub Date": "2024-03-08", "Abstract": "the efficiency of polynomial multiplication execution majorly impacts the performance of lattice based post quantum cryptosystems. in this research we propose a high speed hardware architecture to accelerate polynomial multiplication based on the number theoretic transform  ntt  in crystal kyber and crystal dilithium. we design a digital signal processing  dsp  architecture for modular multiplication in butterfly and point wise multiplication  pwm  operations. our method reduces the critical path delay of an  $n$  bit multiplier to that of a   $2n$  2  bit adder optimizing both area and speed. these dedicated dsps are employed in butterfly and pwm operations completely eliminating the pre process and post process of ntt transforms. furthermore we introduce a novel unified pipelined architecture for the ntt and inverse ntt  intt  transformations of kyber and dilithium with corresponding high speed  radix 2  and ultra high speed  radix 4  versions. lastly we construct a complete hardware accelerator for polynomial matrix vector multiplication in kyber. the field programmable gate array  fpga  implementation results have proven that our designs have significantly improved execution time by  $3.4\\times $ ‚äì $9.6\\times $  for the ntt transforms in dilithium and  $1.36\\times $ ‚äì $34.16\\times $  for kyber polynomial multiplication compared to previous studies reported to date. additionally the hardware footprint results indicate that our proposed architectures exhibit superior hardware performance in area time product  atp  corresponding to a 44%‚äì96% improvement. the proposed architectures are efficient and well suited for high performance lattice based cryptography systems.", "Doi": "10.1109/ACCESS.2024.3371581", "Key Words": ["post-quantum cryptography", "number theoretic transform", "crystal-kyber", "crystal-dilithium", "unified-pipelined ntt", "digital signal processing"]}