{"Title": "High Throughput Lattice-Based Signatures on GPUs: Comparing Falcon and Mitaka", "Authors": ["w. -k. lee", "r. k. zhao", "r. steinfeld", "a. sakzad", "s. o. hwang"], "Pub Date": "2024-03-07", "Abstract": "the us national institute of standards and technology initiated a standardization process for post quantum cryptography in 2017 with the aim of selecting key encapsulation mechanisms and signature schemes that can withstand the threat from emerging quantum computers. in 2022 falcon was selected as one of the standard signature schemes eventually attracting effort to optimize the implementation of falcon on various hardware architectures for practical applications. recently mitaka was proposed as an alternative to falcon allowing parallel execution of most of its operations. these recent advancements motivate us to develop high throughput implementations of falcon and mitaka signature schemes on graphics processing units  gpus  a massively parallel architecture widely available on cloud service platforms. in this article we propose the first parallel implementation of falcon on various gpus. we develop an iterative version of the sampling process in falcon which is also the most time consuming falcon operation. this allows us to implement falcon signature generation without relying on expensive recursive function calls on gpus. in addition we propose a parallel random samples generation approach to accelerate the performance of mitaka on gpus. we evaluate our implementation techniques on state of the art gpu architectures  rtx 3080 a100 t4 and v100 . experimental results show that our falcon 512 implementation achieves 58595 signatures second and 2721562 verifications second on an a100 gpu which is $20.03\\times$20.03√ó and $29.51\\times$29.51√ó faster than the highly optimized avx2 implementation on cpu. our mitaka implementation achieves 161985 signatures second and 1421046 verifications second on the same gpu. due to the adoption of a parallelizable sampling process mitaka signature generation enjoys $\\approx 2$‚âà2‚äì$20 \\times$20√ó higher throughput than falcon on various gpus. the high throughput signature generation and verification achieved by this work can be very useful in various emerging applications including the internet of things.", "Doi": "10.1109/TPDS.2024.3367319", "Key Words": ["post-quantum cryptography", "lattice-based cryptography", "and graphics processing units (gpu)"]}