{"Title": "How to Progressively Build Thai Spelling Correction Systems?", "Doi": "10.1109/ACCESS.2023.3295004", "Authors": ["a. lertpiya", "t. chalothorn", "p. buabthong"], "Key Words": ["natural language processing", "machine learning", "artificial neural networks", "text generation", "spelling correction", "text normalization", "thai language"], "Abstract": "neural based sequence to sequence methods  seq2seq  have proven to be highly effective for context sensitive thai spelling correction. however they also inherit the drawbacks of seq2seq such as a fixed vocabulary and large data requirements. however dictionary based methods and their typical applications are insufficiently robust to produce corrections with reduced error rates. these drawbacks inhibit the application of these methods in a broader range of use cases. in this paper we provide a practical guide on how to build correction systems progressively and efficiently with three main contributions. first we present a process for efficiently and progressively producing training data for both neural based and dictionary based methods. our annotation process enables existing methods to be trained with only two percent of the data hand annotated. second we propose the extendable neural contextual corrector  xncc  a novel text correction approach that decouples the dictionary from the neural model. this enables the dictionary to be extended post training. finally we compare text correction systems with various configurations to demonstrate how these systems can be effectively used to produce corrections. our experiments show that 1  minor changes to dictionary based methods can significantly improve correction performance 2  neural based correction systems can be trained using a fraction of the data and 3  xncc can have the dictionary extended to generalize to new data without re training. lastly we provide recommendations for progressively building text correction systems at multiple levels of implementation effort based on our findings.", "Pub Date": "2023-07-21"}