{"Title": "HQMC-CPC: A Hybrid Quantum Multiclass Cardiac Pathologies Classification Integrating a Modified Hardware Efficient Ansatz", "Authors": ["d. a. shoieb", "a. younes", "s. m. youssef", "k. m. fathalla"], "Pub Date": "2024-02-07", "Abstract": "cardiac pathology classification  cpc  based on the volumetric features of three key heart structures can be extracted from segmented cardiac cine magnetic resonance imaging  cmri  sequences. machine learning models have recently become very effective tools for handling these problems. hybrid quantum methods can be employed to enhance the capacities of classical machine learning models. here we propose a hybrid quantum multiclass cardiac pathologies classification  hqmc cpc  model. in the proposed model discriminative features are extracted to characterize the shape and function of the heart combining the clinical features patient features and radiomics features. in the proposed quantum circuits all variational parameters are trainable and the enhanced variational quantum circuit is employed for efficient neural network learning. using only thirty feature values as input we propose a hybrid quantum multiclass cardiac pathologies classification  hqmc cpc  model based on the proposed modified hardware efficient ansatz  mhea . the proposed model achieves promising results in training and testing with the automatic cardiac diagnosis challenge  acdc 2017  dataset. experimental results showed that the proposed hqmc cpc model is able to classify different cardiac pathologies with an average minimum performance gap of 3.19%. the average maximum improvement in terms of accuracy in cardiac pathology classification is 7.77%. moreover the proposed hqmc cpc speeds up the testing process by around 60% and 40% compared to the classical classifiers and well established hea respectively.", "Doi": "10.1109/ACCESS.2024.3360139", "Key Words": ["ansatz", "cardiac pathologies", "classification", "clinical features", "quantum circuit", "radiomic features"]}