{"Title": "Hybrid Model for Analysis of Social Media Posts for Identification of Depression and Measuring Its Severity", "Doi": "10.1109/ICDSNS58469.2023.10245441", "Authors": ["j. nanavati", "u. patel"], "Key Words": ["mental health disorders", "depression", "ml algorithms", "depression detection", "deep learning", "text analysis", "affective computing", "emotion ai introduction"], "Abstract": "amongst vast variety of mental health disorders one of the most common is depression. depression is characterized by feeling sad empty minded and complete lack of interest. the time period of depression ranges from a few hours up to even a fortnight or even more. depression in turn also results into feeling low self esteem guilty inability to concentrate seeing no hope sleep disorders and even thoughts of committing suicide. thus depression is one of the greatest challenges to the individual in particular and society at large in general. depression has also made it to the list of high priority conditions under by mental health gap action programme of the world health organization. use of social media has been an integral part of modern lifestyle. vast majority of people from developing and developed countries have cheaper access to internet and they prioritize engaging themselves in social media for sharing every minute detail of their personal life and express their feelings on multiple social media platforms. as a result of this their posts on social media are nearly true reflections of their state of mind. in this research work we proposed a hybrid model for sentiment analysis which aims at identifying depression along with its severity levels. the proposed model employs pre trained language model and makes use of information available through day to day social media posts by various users. the proposed model was built around the principles of contrastive learning. the results showed significant improvement achieved by the proposed approach. thus it can be concluded that the hybrid ensemble approach does offer better and competitive performance over usage of single model.", "Pub Date": "2023-09-22"}