{"Title": "Hybrid-Domain Integrative Transformer Iterative Network for Spectral CT Imaging", "Authors": ["y. wang", "j. ren", "a. cai", "s. wang", "n. liang", "l. li", "b. yan"], "Pub Date": "2024-04-03", "Abstract": "the guideline of ‚äúas low as reasonably achievable‚äù  alara  for radiation dose has attracted attention to sparse view spectral computed tomography  ct  imaging. any missing scanning view in any energy will reduce the quality of image reconstruction and material decomposition. recently a series of achievements have been made in optimizing spectral ct imaging based on traditional iterative models or deep learning methods. however these works are independent or simply coupled often neglecting the dependency relationships in spectral ct imaging. moreover interpretability and generalization ability are still the challenges facing the existing methods. therefore we combine the advantages of traditional models and deep learning methods to propose an interpretable hybrid domain integrative transformer iterative network  hiti net  model for synchronously optimizing spectral ct reconstruction and material decomposition of sparse view measurements. the model fully utilizes prior information in the fields of projection image and material while introducing the vision transformer to learn global and long range image information interactions. then the interpretable objective function is solved by the alternating directions method of multipliers  admms  and further optimized the network structure according to the derived expression. in addition hybrid domain sparse regularization terms and balance parameters are designed to adaptively learn during the training phase to enhance the generalization ability of the hiti net. in simulation and real preclinical experiments the imaging results of hiti net are superior to other comparison methods with more small features and sharp edges.", "Doi": "10.1109/TIM.2024.3379388", "Key Words": ["image reconstruction", "iterative network", "material decomposition", "spectral computed tomography (ct)", "transformer"]}