{"Title": "HyperQUEEN: Hyperspectral Quantum Deep Network For Image Restoration", "Authors": ["c. -h. lin", "y. -y. chen"], "Pub Date": "2023-05-25", "Abstract": "quantum science just winning the 2022 nobel prize in physics must lead future development of remote sensing technologies. however given the very limited number of entangled quantum bits  qubits  even in the most advanced quantum computers is processing remotely sensed hyperspectral images  featured by its large data volume  using quantum computers technically feasible? even if the quantum image state can be well processed to the quantum state of the target image  qsti  it cannot be perfectly retrieved output as the qsti will collapse to some eigenstate once it is measured. owing to these challenges current quantum image processing technologies can only achieve classification level applications requiring just a few output qubits. we design a hyperspectral quantum deep network  hyperqueen  to encode the hyperspectral information using very few qubits as well as to learn the mapping from some measuring statistics  associated with the collapsed qsti  to the target image  instead of directly retrieving the unobservable qsti  thereby solving the challenges. hyperqueen is the first quantum architecture that makes a breakthrough to blindly reconstruct the national aeronautics and space administration‚äôs  nasa  washington dc usa damaged hyperspectral images which means a lot for the upcoming space era. as the immature quantum facility nowadays does not yet allow us to fully exhibit its high potential we are not aiming at developing state of the art methods but are demonstrating the feasibility of quantum hyperspectral remote sensing. mathematical analysis guiding our design toward the low rank quantum deep network together with comprehensive experiments will also be reported.", "Doi": "10.1109/TGRS.2023.3274355", "Key Words": ["blind signal processing", "hyperspectral remote sensing (hrs)", "quantum computing", "quantum deep learning", "quantum image processing"]}