{"Title": "Identifying Alcohol-Related Information From Unstructured Bilingual Clinical Notes With Multilingual Transformers", "Doi": "10.1109/ACCESS.2023.3245523", "Authors": ["h. k. kim", "y. park", "y. park", "e. choi", "s. kim", "h. you", "y. s. bae"], "Key Words": ["clinical informatics", "alcohol information extraction", "natural language processing", "information extraction from clinical notes", "multilingual transformers"], "Abstract": "as a key modifiable risk factor alcohol consumption is clinically crucial information that allows medical professionals to further understand their patients‚äô medical conditions and suggest appropriate lifestyle modifying interventions. however identifying alcohol related information from unstructured free text clinical notes is often challenging. not only are the formats of the notes inconsistent but they also include a massive amount of non alcohol related information. furthermore for medical institutions outside of english speaking countries these clinical notes contain both a mixture of english and local languages inducing additional difficulty in the extraction. thanks to the increasing availability of electronic medical record  emr  several previous works explored the idea of using natural language processing  nlp  to train machine learning models that automatically identify alcohol related information from unstructured clinical notes. however all these previous works are limited to english clinical notes thereby able to leverage various large scale external ontologies during the text preprocessing. furthermore they rely on simple nlp techniques such as the bag of words models that suffer from high dimensionality and out of vocabulary issues. addressing these issues we adopt fine tuning multilingual transformers. by leveraging their linguistically rich contextual information learned during their pre training we are able to extract alcohol related information from unstructured clinical notes without preprocessing the clinical notes on any external ontologies. furthermore our work is the first to explore the use of transformers in bilingual clinical notes to extract alcohol related information. even with minimal text preprocessing we achieve extraction accuracy of 84.70% in terms of macro f-1 score.", "Pub Date": "2023-02-22"}