{"Title": "Identifying Hot Topic Trends in Streaming Text Data Using News Sequential Evolution Model Based on Distributed Representations", "Doi": "10.1109/ACCESS.2023.3312764", "Authors": ["z. a. khan", "y. xia", "s. ali", "j. a. khan", "s. s. askar", "m. abouhawwash", "n. el-rashidy"], "Key Words": ["topic trends", "news sequential evolution model", "stream text analysis", "visual display model", "knowledge graph", "distributed representations"], "Abstract": "hot topic trends have become increasingly important in the era of social media as these trends can spread rapidly through online platforms and significantly impact public discourse and behavior. as a result the scope of distributed representations has expanded in machine learning and natural language processing. as these approaches can be used to effectively identify and analyze hot topic trends in large datasets. however previous research has shown that analyzing sequential periods in data streams to detect hot topic trends can be challenging particularly when dealing with large datasets. moreover existing methods often fail to accurately capture the semantic relationships between words over different time periods limiting their effectiveness in trend prediction and relationship analysis. this paper aims to utilize a distributed representations approach to detect hot topic trends in streaming text data. for this purpose we build a sequential evolution model for a streaming news website to identify hot topic trends in streaming text data. additionally we create a visual display model and knowledge graph to further enhance our proposed approach. to achieve this we begin by collecting streaming news data from the web and dividing it chronologically into several datasets. in addition word2vec models are built in different periods for each dataset. finally we compare the relationship of any target word in sequential word2vec models and analyze its evolutionary process. experimental results show that the proposed method can detect hot topic trends and provide a graphical representation of any raw data that cannot be easily designed using traditional methods.", "Pub Date": "2023-09-14"}