{"Title": "IGWO-SoE: Improved Grey Wolf Optimization Based Stack of Ensemble Learning Algorithm for Anomaly Detection in Internet of Things Edge Computing", "Doi": "10.1109/ACCESS.2023.3319814", "Authors": ["j. manokaran", "g. vairavel"], "Key Words": ["anomaly detection", "cooja simulator", "edge computing", "ensemble learning", "improved grey wolf optimization", "internet of things", "statistical significance test"], "Abstract": "with the tremendous growth and popularization of the internet of things  iot  the number of attacks targeting such devices has also increased. therefore enhancing the anomaly detection model to maximize detection accuracy and mitigate cyber attacks in time critical iot edge scenarios is essential. furthermore there is a lack of vivid precise cross layered and diverse datasets in iot for evaluating these anomaly detection models. this paper aims to develop an improved anomaly detection model based on an optimized stacked ensemble learning algorithm at edge computing. initially a novel synthetic dataset with multiple cross layer attacks is generated using the cooja simulator to train our proposed model. in addition by introducing an improved grey wolf optimization  igwo  approach the parameters of ensemble learning algorithms such as number of trees learning rate and sample rate are tuned precisely and the stacking ensemble concept is applied to the optimized ensemble learning algorithms to enhance their prediction capabilities. the experimental results demonstrate that the developed model produces a detection accuracy of 99.44% for our proposed cooja simulated dataset which is higher than the contemporary methods. the generalizability of the proposed model is expressed explicitly using four different datasets  nsl kdd unsw nb 15 mqttset and cicids 2017. finally we assess the befitting of the proposed model using a chi square statistical significance test thereby providing an enriched contribution to the recent works in anomaly detection.", "Pub Date": "2023-10-06"}