{"Title": "Implementing Graph-Theoretic Feature Selection by Quantum Approximate Optimization Algorithm", "Doi": "10.1109/TNNLS.2022.3190042", "Authors": ["y. li", "r. -g. zhou", "r. xu", "j. luo", "w. hu", "p. fan"], "Key Words": ["feature selection", "graph theory", "parameterized quantum circuit", "quantum approximation optimization algorithm", "quantum computing"], "Abstract": "feature selection plays a significant role in computer science  nevertheless this task is intractable since its search space scales exponentially with the number of dimensions. motivated by the potential advantages of near term quantum computing three graph theoretic feature selection  gtfs  methods including minimum cut  mincut  based densest  $k$  subgraph  dks  based and maximal independent set minimal vertex cover  mis mvc  based are investigated in this article where the original graph theoretic problems are naturally formulated as the quadratic problems in binary variables and then solved using the quantum approximate optimization algorithm  qaoa . specifically three separate graphs are created from the raw feature set where the vertex set consists of individual features and pairwise measure describes the edge. the corresponding feature subset is generated by deriving a subgraph from the established graph using qaoa. for the above three gtfs approaches the solving procedure and quantum circuit for the corresponding graph theoretic problems are formulated with the framework of qaoa. in addition those proposals could be employed as a local solver and integrated with the tabu search algorithm for solving large scale gtfs problems utilizing limited quantum bit resource. finally extensive numerical experiments are conducted with 20 publicly available datasets and the results demonstrate that each model is superior to its classical scheme. in addition the complexity of each model is only  $\\mathcal {o} p n^{2} $  even in the worst cases where  $p$  is the number of layers in qaoa and  $n$  is the number of features.", "Pub Date": "2024-02-05"}