{"Title": "Improving THz Transmission Distance for Delay-Sensitive Services via Mobile Computing", "Doi": "10.1109/TVT.2022.3211434", "Authors": ["s. xie", "l. li", "z. chen", "b. ning", "w. chen", "s. li"], "Key Words": ["delay-sensitive services", "mobile computing", "terahertz communications", "transmission distance"], "Abstract": "next generation wireless networks are expected to support delay sensitive applications such as augmented reality  ar  and virtual reality  vr . in ar vr applications computational jobs are offloaded to the edge computing server. such offloading process requires transmissions of large data packets with low latency. terahertz  thz  band can provide hundreds of ghz bandwidth and thus is promising in enabling ultra high speed data transmissions. however thz transmission distance is limited due to its inherently severe propagation loss. this paper considers to improve thz transmission distance with the help of mobile computing. the key idea is that if mobile devices can handle partial computational jobs the data transmission rate requirement is lowered which in turn helps to improve thz transmission distance. specifically we aim to maximize thz transmission distance by jointly optimizing users' job offloading decisions and transmission carrier frequencies. to that end we first introduce a delay violation probability to characterize the delay constraints for delay sensitive services. based on the derived delay violation probability we formulate a thz transmission distance maximization  thz tdm  problem. this thz tdm problem is non convex. to solve this issue we derive in closed form the expression of the achievable transmission distance with respect to carrier frequency and data rate. subsequently we propose a hungarian admm based iterative algorithm  hab  and a low complexity rearrangement inequality like algorithm  ril . the proposed ril involves no iterations but only applies to the case where the edge computing server queue stability constraint is relaxed. numerical results show that the developed schemes can effectively improve thz transmission distance.", "Pub Date": "2023-02-13"}