{"Title": "Improved Flexible Coaxial Ribbon Cable for High-Density Superconducting Arrays", "Authors": ["j. p. smith", "b. a. mazin", "a. boaventura", "k. j. thompson", "m. daal"], "Pub Date": "2024-01-24", "Abstract": "superconducting arrays often require specialized high density cryogenic cabling capable of transporting electrical signals across temperature stages with minimal loss crosstalk and thermal conductivity. we report improvements to the design and fabrication of previously published superconducting 53 wt% niobium  nb  47 wt% titanium  ti  flexible coaxial ribbon cables. we used 3 d electromagnetic simulations to inform design changes to improve the characteristic impedance of the cable and the connector transition. we increased the center conductor diameter from 0.003 to 0.005 in which lowered the cable characteristic impedance from $\\sim$60 to $\\sim$53 $\\omega$. this change had a negligible impact on the computed heat load which we estimate to be 5 nw per trace from 1 k to 100 mk with a 1 ft cable. this is approximately half the heat load calculated for the smallest commercially available superconducting coax. we also modified the transition board to include a capacitive coupling between the upper ground plane and signal traces that mitigates the inductive transition. we tested these changes in a 5 trace 1 ft long cable at 4 k and found the microwave transmission improved from 6 to 1.5 db of attenuation at 8 ghz. this loss is comparable to commercial superconducting coax and 3√ó lower than commercial nbti on polyimide flex cables at 8 ghz. the nearest neighbor forward crosstalk remained ‚àí50 db. we compare key performance metrics with commercially available superconducting coax and nbti on polyimide flex cables and we share initial progress on commercialization of this technology by maybell quantum industries.", "Doi": "10.1109/TASC.2024.3350516", "Key Words": ["superconducting cables", "superconducting microwave devices", "superconducting filaments and wires", "superconducting resonators"]}