{"Title": "Improving Non-Negative Positive-Unlabeled Learning for News Headline Classification", "Doi": "10.1109/ACCESS.2023.3269304", "Authors": ["z. ji", "c. du", "j. jiang", "l. zhao", "h. zhang", "i. ganchev"], "Key Words": ["text classification", "non-negative positive-unlabeled (nnpu) learning", "focal loss", "virtual adversarial training (vat)", "adversarial training for large neural language models (alum)"], "Abstract": "with the development of internet technology network platforms have gradually become a tool for people to obtain hot news. how to filter out the current hot news from a large number of news collections and push them to users has important application value. in supervised learning scenarios each piece of news needs to be labeled manually which takes a lot of time and effort. from the perspective of semi supervised learning on the basis of the non negative positive unlabeled  nnpu  learning this paper proposes a novel algorithm called ‚äòenhanced nnpu with focal loss‚äô  flpu  for news headline classification which uses the focal loss to replace the way the classical nnpu calculates the empirical risk of positive and negative samples. then by introducing the virtual adversarial training  vat  of the adversarial training for large neural language models  alum  into flpu another  and better  algorithm called ‚äòflpu+alum‚äô is proposed for the same purpose aiming to label only a small number of positive samples. the superiority of both algorithms to the state of the art pu algorithms considered is demonstrated by means of experiments conducted on two datasets for performance comparison. moreover through another set of experiments it is shown that if enriched by the proposed algorithms the roberta wwm ext model can achieve better classification performance than the state of the art binary classification models included in the comparison. in addition a ‚äòratio batch‚äô method is elaborated and proposed as more stable for use in scenarios involving only a small number of labeled positive samples which is also experimentally demonstrated.", "Pub Date": "2023-04-27"}