{"Title": "Improving Quality of Service and HTTPS DDoS Detection in MEC Environment With a Cyber Deception-Based Architecture", "Doi": "10.1109/ACCESS.2024.3361476", "Authors": ["j. kabdjou", "n. shinomiya"], "Key Words": ["multi-access edge computing (mec)", "cyber deception", "quality of service (qos)", "software defined networking (sdn)", "network function virtualization (nfv)", "service function chaining (sfc)", "network slicing (ns)", "decision-making systems"], "Abstract": "creating a cyber deception framework for 5g networks particularly in iot and cellular applications is complex due to critical constraints in managing resources meeting low latency demands and addressing security concerns. while cloud computing aids in alleviating some limitations it often falls short in meeting low latency requirements. multi access edge computing  mec  has emerged as a solution by bringing resources closer to user equipment  ues  to reduce latency. various mec architectures have leveraged software defined networking  sdn  network function virtualization  nfv  service function chaining  sfc  network slicing  ns  decision making systems and deception components. however none have integrated these technologies comprehensively to achieve superior quality of service  qos  and strengthen security. in this paper we unify sdn nfv sfc ns decision making technologies and deception to efficiently manage mec server resources and lure attackers. we utilize cyber deception metrics including request collection rates over time and variations in request numbers concerning different botnet sizes. moreover we meticulously address qos parameters such as latency computing storage and bandwidth resources. our approach initiates with a mathematical model for mec server resource allocation introducing a novel architecture that reduces bandwidth computing and storage resource usage. we introduce a cyber deception strategy utilizing uniform distribution and random selection to divert potential attackers. simulations validate efficient resource management notably reducing end to end latency for requests processed on the edge and in the cloud. this enhancement improves qos within the mec system and provides valuable insights for advancing decision making technologies.", "Pub Date": "2024-02-16"}