{"Title": "Improved Design for Hardware Implementation of Graph-Based Large Margin Classifiers for Embedded Edge Computing", "Doi": "10.1109/TNNLS.2022.3183236", "Authors": ["j. arias-garcia", "a. c. de souza", "l. gade", "j. yudi", "f. coelho", "c. l. castro", "l. c. b. torres", "a. p. braga"], "Key Words": ["classifiers", "edge computing", "embedded system", "fpga", "gabriel graph", "hardware design of neural networks", "internet of things (iot)", "large margin", "latency-sensitive applications", "system-on-a-chip"], "Abstract": "the number of connected embedded edge computing internet of things  iot  devices has been increasing over the years contributing to the significant growth of available data in different scenarios. thereby machine learning algorithms arise to enable task automation and process optimization based on those data. however due to some learning methods‚äô computational complexity implementing geometric classifiers it is a challenge to map these on embedded systems or devices with limited resources in size processing memory and power to accomplish the desired requirements. this hampers the applicability of these methods to complex industrial embedded edge applications. this work evaluates strategies to reduce classifiers‚äô implementation costs based on the chip clas model independent of hyperparameter tuning and optimization algorithms. the proposal aims to evaluate the tradeoff between numerical precision and model performance and analyze the hardware implementations of a distance based classifier. two 16 b floating point formats were compared to the 32 b floating point precision implementation. also a new hardware architecture was developed and then compared to the state of the art reference. the results indicate that the model is robust to low precision computation providing statistically equivalent results compared to the baseline model also pointing out statistically equivalent performance and a global speed up factor of approx 4.39 in processing time.", "Pub Date": "2024-01-04"}