{"Title": "Improving CT Quality for Complex Objects With the Novel Autoexposure Imaging of Stepped Voltage Scanning", "Authors": ["y. li", "x. zhao", "y. han", "p. chen"], "Pub Date": "2023-01-13", "Abstract": "for x ray ct imaging of complex objects the tube voltage is an important parameter. at fixed voltage the complete projection cannot be obtained because the voltage does not match the equivalent attenuation thickness of the object at different ct scanning angles under the limitation of the dynamic range of the imaging system. multivoltage exposure imaging is an effective solution. however due to the limitation of high voltage regulation ripple the imaging efficiency is very low if the voltage is adjusted frequently. actually for a ray detector with a wide dynamic range the small difference in equivalent thickness between adjacent scanning angles cannot affect the imaging quality for complex objects. therefore this article proposes a novel autoexposure imaging method with stepped voltage scanning. first according to the known imaging system the voltage regulation method of stepped voltage adjustment is researched by evaluating the image quality of different thicknesses. then considering that stepped voltage adjustment cannot obtain the complete projection at the thinner thickness the projections of negative logarithmic transformation  nlt  with stepped voltage and low voltage are fused to obtain the high dynamic range  hdr  projection. finally the method is validated on both a customized titanium specimen and an actual engine blade. the results show that the proposed method can achieve hdr ct imaging of complex objects with higher quality and clearer edge details. additionally this new scanning mode of stepped voltage adjustment can reduce the frequency of voltage adjustment and improve imaging efficiency.", "Doi": "10.1109/TIM.2022.3225022", "Key Words": ["complex structure", "high dynamic range (hdr)", "multiexposure", "projection fusion", "stepped voltage adjustment", "x-ray ct imaging"]}