{"Title": "Improved Chemical Reaction Optimization With Fitness-Based Quasi-Reflection Method for Scheduling in Hybrid Cloud-Fog Environment", "Doi": "10.1109/TNSM.2023.3299358", "Authors": ["d. ramesh", "n. rizvi", "p. c. s. rao", "e. a. sundararajan", "k. mondal", "g. srivastava", "l. qi"], "Key Words": ["chemical reaction optimization", "fitness-based quasi reflection method", "opposition based learning", "workflow scheduling", "cloud computing", "fog computing"], "Abstract": "with the advent of internet of things  iot  applications smart iot devices are ubiquitous. executing these devices on cloud data centers can lead to network congestion and transmission delay that causes failure instances in cloud architecture. therefore fog computing is derived to satisfy the low latency location awareness and mobility requirements of massive iot applications near end users. concerned with the high requirements of compute intensive business applications fog computing structure becomes complex due to limited computing capacity and therefore these applications are offloaded to the cloud. therefore to overcome the offloading problem of workflow tasks in this work a novel method named  improved chemical reaction optimization for workflow scheduling in a hybrid environment  icro wshe  has been proposed. the proposed algorithm aims at minimizing the execution cost of workflow applications under the defined deadline constraints. the algorithm is based on cro which has fewer parameters and the fastest convergence speed. however the existing cro has drawbacks in terms of getting stuck in the local optimum and having difficulty obtaining real optimal solutions. therefore the proposed mechanism modifies the existing cro algorithm and includes the suitable features of pso  particle swarm optimization  and fqr  fitness based quasi reflection  methods to prevent the shortcomings of the cro method. further a double point synthesis operation is incorporated to increase the exploration rate and improve the working of the proposed algorithm. the result of the simulation experiment based on different types of workflows shows that the proposed method outperforms existing algorithms and proves to be a practical approach.", "Pub Date": "2024-02-07"}