{"Title": "In-Memory Acceleration of Hyperdimensional Genome Matching on Unreliable Emerging Technologies", "Authors": ["h. e. barkam", "s. yun", "p. r. genssler", "c. -k. liu", "z. zou", "h. amrouch", "m. imani"], "Pub Date": "2024-03-28", "Abstract": "novel computer architectures like compute in memory  cim  merge the memory and processing units mimicking the human brain. simultaneously hyperdimensional computing  hdc  is emerging as a brain inspired machine learning  ml  approach. both developments hold promise for the realm of artificial intelliegence and computing especially for genome matching tasks where large data movements overwhelm traditional von neumann architectures. fefet is one of the up and coming emerging technologies that promises to enable ultra efficient and compact cim architectures. however the adoption of fefets is hindered by their 10 nm thick ferroelectric  fe  layer and process variation. thus calculations with fefets have errors  noise  that traditional ml genome matching models cannot tolerate. to overcome these challenges this work is the first one to i  present a reliable hdc framework  hdgim  for highly scaled  down to merely 3nm  multi bit fefet technology ii  introduce temperature thickness modeled noise from fefet to the hdc system and iii  extensively define the memorization capacity of hdc hyperparameters in order to evaluate the performance before deployment theoretically. our novel hdc learning framework iteratively uses two models  a full precision 32 bit hdc model an ideal model for training and a reduced bit precision by a novel quantization method for validation and inference. our results demonstrate that highly scaled fefet realizing 3 bit and even 4 bit can withstand any modeled noise given high dimensionality during inference. considering the noise during model adjustment improves the inherent robustness by almost 9% on the 4 bit case.", "Doi": "10.1109/TCSI.2024.3351966", "Key Words": ["in-memory computing", "ferroelectric", "fefet", "reliability", "hyperdimensional computing"]}