{"Title": "Incentive Oriented Two-Tier Task Offloading Scheme in Marine Edge Computing Networks: A Hybrid Stackelberg-Auction Game Approach", "Doi": "10.1109/TWC.2023.3264607", "Authors": ["m. dai", "z. luo", "y. wu", "l. qian", "b. lin", "z. su"], "Key Words": ["marine edge computing networks", "two-tier task offloading", "and hybrid stackelberg-auction game"], "Abstract": "with the increasing exploration of marine resources various marine wireless devices have been rapidly deployed for different marine applications such as marine navigation ocean environment monitoring and seabed resource exploitation. however due to long transmission delay and low data rate between marine wireless devices and the cloud it is challenging to satisfy the service requirements of computing intensive and delay sensitive tasks. by migrating computing resources from cloud to the near side of ocean the paradigm of marine edge computing networks which integrates communication and computation capacities in marine wireless devices is expected to support a variety of marine tasks  e.g. data collection monitoring and processing  with low delay and high data rate. however considering the rationality and selfishness of marine wireless devices and their limited computing capacity how to motivate marine wireless devices to conduct task processing becomes an important problem for improving computing efficiency. to address this issue in this paper we propose an incentive oriented two tier task offloading scheme for marine edge computing networks via hybrid stackelberg auction game approach with the objective of improving the offloading efficiency and maximizing marine wireless devices‚äô utilities. specifically for underwater acoustic transmission tier we exploit multi access task offloading scheme in which underwater wireless sensor  uws  uploads its workloads to an unmanned underwater vehicle  uuv  and a sea surface sink node  sn  via non orthogonal multiple access  noma  transmission. we formulate the utility of each party and model the task offloading process among uws uuv and sn as a stackelberg game to optimize the uws‚äôs offloading strategy uuv‚äôs and sn‚äôs price strategies. for radio frequency transmission tier sn can offload its partial workloads to an unmanned aerial vehicle  uav  via frequency division multiple access  fdma  transmission. we provide their utilities and model the offloading process between a sn and a uav as a double auction game to optimize their bidding strategies. extensive simulation results are provided to validate the performance of the proposed scheme. numerical results demonstrate that the proposed algorithms can obtain the optimal solutions and increase the utilities for marine wireless devices.", "Pub Date": "2023-12-12"}