{"Title": "Incentive-Based Distributed Resource Allocation for Task Offloading and Collaborative Computing in MEC-Enabled Networks", "Doi": "10.1109/JIOT.2022.3233026", "Authors": ["g. chen", "y. chen", "z. mai", "c. hao", "m. yang", "l. du"], "Key Words": ["bargaining game", "collaborative computing", "mobile edge computing (mec)", "task offloading"], "Abstract": "computing tasks offloaded from user devices  uds  can be carried out by one or more mobile edge computing  mec  servers to alleviate the computing burden of uds. the incentive is needed to encourage mec servers to provide their computing services to other network nodes. in this article inspired by the fact that bargaining games have the available features of incentive self enforcement and satisfaction for all participants we propose a two level bargaining based incentive mechanism for task offloading and collaborative computing in mec enabled networks. in the first level bargaining between uds and local mec server  lmecs  both uds and lmecs try to maximize their respective offloading utilities which are all defined as a saved cost function considering the time and energy consumption of task execution and computing service fees. the task offloading decision uplink transmitting power of uds computing resource allocation of lmecs and the fees paid by uds to lmecs are jointly optimized. when large computing tasks are offloaded to lmecs which results in lmecs overload the second level bargaining is proposed to achieve a computing load balance of lmecs and maximize the respective collaboration utilities of lmecs and collaborative mec server group  cmecg  in which the optimized normalized fees paid by lmecs to cmecg for additional computing resources are obtained. the first level and the second level bargainings are proved to be quasi concave and concave respectively and each has a unique nash bargaining solution  nbs . the simulation results show that the proposed method gets better performance than benchmark methods.", "Pub Date": "2023-05-05"}