{"Title": "Industrial Vision: Rectifying Millimeter-Level Edge Deviation in Industrial Internet of Things With Camera-Based Edge Device", "Doi": "10.1109/TMC.2023.3246176", "Authors": ["l. xie", "z. chu", "y. li", "t. gu", "y. bu", "c. wang", "s. lu"], "Key Words": ["edge computing", "edge deviation rectification", "industrial vision", "industial internet of things"], "Abstract": "nowadays to realize the intelligent manufacturing in industrial internet of things  iiot  scenarios novel approaches in computer vision are in great demand to tackle the new challenges in iiot environment. these approaches which we call industrial vision are expected to offer customized solutions for intelligent manufacturing in an accurate time efficient and robust manner. in this paper we propose a novel approach to industrial vision called edge eye to rectify the edge deviation automatically for irradiated cross linked polyethylene foam  ixpe  production with millimeter level accuracy. we deploy a commercial camera with mobile edge node in front of the ixpe sheet to continuously detect and rectify the edge deviation. particularly to handle the complex production environment when extracting the edge of ixpe sheet we deploy a pair of reference bars with high contrast colors to efficiently differentiate the sheet edge from the background. then we propose a bi direction edge tracking method to perform the edge detection from both vertical and horizontal aspects. to realize the rectification using mobile edge nodes with limited computing resources we reduce the cost of computation by extracting the minimized region of interest i.e. the edge area overlapped with the higher contrast reference bar on both sides. we further design a negative feedback control system with multi stage feedback regulation mechanism keeping the edge deviation within millimeter level. the experimental results show that edge eye achieves the average accuracy of 5 mm for the edge deviation rectification with the average latency of 200 ms for edge deviation detection.", "Pub Date": "2024-01-08"}