{"Title": "Information-Centric Mobile Networks: A Survey, Discussion, and Future Research Directions", "Doi": "10.1109/ACCESS.2023.3268775", "Authors": ["s. fayyaz", "m. atif ur rehman", "m. salah ud din", "m. i. biswas", "a. k. bashir", "b. -s. kim"], "Key Words": ["named data networking", "mobility management", "producer mobility", "wireless networking", "artificial intelligence", "edge computing", "vehicular fog computing", "autonomous driving"], "Abstract": "information centric networking  icn  and its fruition the named data networking  ndn  is a paradigm shift from host centric address based communication architecture to the content centric name based one. icn intends to resolve various major issues faced by today‚äôs internet architecture such as privacy security consistent routing and mobility to name a few. with the massive increase of mobile data traffic in today‚äôs era mobility is one of the major concerns in networking. on the one hand icn realization i.e. the ndn follows a pull based communication model and natively supports the consumer  end user  mobility in wired networks by maintaining the forwarding states on intermediate nodes. nevertheless the mobile consumer nodes confront issues in wireless networking environments such as excessive energy consumption as a result of request flooding content retrieval delays due to intermittent connectivity and bandwidth consumption due to the broadcasting nature of the wireless medium among others. the producer  content generator  mobility on the other hand was not initially supported in the original architectural design of ndn for both wired and wireless networks. therefore to efficiently address the degradation issues incurred by mobile consumer producer nodes a plethora of mobility management schemes have been proposed over the recent few years. in this paper we provided a detailed survey on the existing research efforts‚äîin the context of producer consumer and hybrid mobility that have been proposed in the literature. moreover we outlined various research directions considering the role of mobility in futuristic technologies such as artificial intelligence enabled smart networks software defined networking edge computing vehicular fog computing autonomous driving semantic communication and resource constrained internet of things.", "Pub Date": "2023-05-01"}