{"Title": "Infrared Thermal Image Instance Segmentation Method for Power Substation Equipment Based on Visual Feature Reasoning", "Authors": ["z. zhao", "s. feng", "y. zhai", "w. zhao", "g. li"], "Pub Date": "2023-10-20", "Abstract": "the accurate infrared thermal image instance segmentation of substation equipment is a prerequisite for intelligent analysis of its temperature status. to address the issues of low accuracy and false detection in the existing substation instance segmentation methods we propose a visual feature reasoning based substation infrared thermal image instance segmentation method to compensate for the limitations of deep learning methods and improve the instance segmentation accuracy. we propose utilizing distinctive visual features as a priori knowledge for three types of substation equipment and construct a two branch instance segmentation model  fr solov2  based on power domain expertise and visual feature reasoning. fr solov2 comprises distinctive visual feature extraction and reasoning network  fr  as well as a substation equipment image segmentation network  solov2 . fr combines power domain knowledge and visual feature reasoning to provide accurate localization and classification information for each substation device. solov2 accomplishes segmenting substation devices in infrared images based on residual networks and feature fusion pyramids. the test results well demonstrate the superiority of our model for instance segmentation of the infrared image of substation equipment. additionally fr solov2 demonstrates an average accuracy of 83.18% on the substation equipment infrared image dataset a significant improvement of 13.5% compared to the baseline model. the method relying on prior knowledge for visual feature reasoning on deep learning methods also presents a new approach to substation equipment image segmentation.", "Doi": "10.1109/TIM.2023.3322998", "Key Words": ["infrared image", "instance segmentation", "power substation equipment", "solov2", "visual feature reasoning"]}