{"Title": "Initial State Encoding via Reverse Quantum Annealing and H-Gain Features", "Authors": ["e. pelofske", "g. hahn", "h. djidjev"], "Pub Date": "2023-11-07", "Abstract": "quantum annealing is a specialized type of quantum computation that aims to use quantum fluctuations in order to obtain global minimum solutions of combinatorial optimization problems. programmable d wave quantum annealers are available as cloud computing resources which allow users low level access to quantum annealing control features. in this article we are interested in improving the quality of the solutions returned by a quantum annealer by encoding an initial state into the annealing process. we explore two d wave features that allow one to encode such an initial state  the reverse annealing  ra  and the h gain  hg  features. ra aims to refine a known solution following an anneal path starting with a classical state representing a good solution going backward to a point where a transverse field is present and then finishing the annealing process with a forward anneal. the hg feature allows one to put a time dependent weighting scheme on linear  $h$  biases of the hamiltonian and we demonstrate that this feature likewise can be used to bias the annealing to start from an initial state. we also consider a hybrid method consisting of a backward phase resembling ra and a forward phase using the hg initial state encoding. importantly we investigate the idea of iteratively applying ra and hg to a problem with the goal of monotonically improving on an initial state that is not optimal. the hg encoding technique is evaluated on a variety of input problems including the edge weighted maximum cut problem and the vertex weighted maximum clique problem demonstrating that the hg technique is a viable alternative to ra for some problems. we also investigate how the iterative procedures perform for both ra and hg initial state encodings on random whole chip spin glasses with the native hardware connectivity of the d wave chimera and pegasus chips.", "Doi": "10.1109/TQE.2023.3319586", "Key Words": ["anneal schedule", "bayesian optimization", "d-wave", "h-gain (hg)", "ising model", "maximum cut", "qubo", "quantum annealing (qa)", "reverse annealing (ra)"]}