{"Title": "Innovative Fibromyalgia Detection Approach Based on Quantum-Inspired 3LBP Feature Extractor Using ECG Signal", "Authors": ["p. d. barua", "m. kobayashi", "m. tanabe", "m. baygin", "j. k. paul", "t. iype", "s. dogan", "t. tuncer", "r. -s. tan", "u. r. acharya"], "Pub Date": "2023-09-22", "Abstract": "fibromyalgia is a chronic pain syndrome associated with sleep disturbances which may manifest as altered electroencephalography and electrocardiography  ecg  signal alterations during sleep. we aimed to develop a lightweight machine learning model for diagnosing fibromyalgia using single lead ecg signals recorded during sleep. we analyzed 139 single lead ecgs recorded during stage 2 and sleep stage 3 of 16 patients with fibromyalgia and 16 age and sex matched controls. ecg records were divided into 15 second segments  3308 and 1783 in healthy vs fibromyalgia classes respectively. our model comprised  1  feature extraction that combined an 8 wavelet filter and 4 level multiple filters based multilevel discrete wavelet transform signal decomposition with a novel local binary pattern  lbp  like function 3lbp that generated multiple patterns  analogous to quantum superposition  for feature map value extraction  the optimal input specific pattern was dynamically selected using a novel forward forward algorithm    2  feature selection using neighborhood component analysis and chi square functions   3  classification with k nearest neighbors and support vector machine classifiers using leave one record out cross validation  and  4  mode function based iterative majority voting to generate voted results from which the best model result was derived. our model attained binary classification accuracies of 93.87% and 92.02% for sleep stage 2 and sleep stage 3 respectively. the observed outcomes and empirical evidence unequivocally demonstrate the efficacy of our proposed methodology in differentiating the electrocardiographic signatures of fibromyalgia patients from control subjects. the model exhibited self organizational properties and computational efficiency rendering it amenable to facile clinical integration.", "Doi": "10.1109/ACCESS.2023.3315149", "Key Words": ["ecg-based fibromyalgia detection", "3lbp", "multiple filters-based multilevel discrete wavelet transform", "leave-one-record-out cross-validation", "quantum-based feature extraction"]}