{"Title": "Innovative Services for Electric Mobility Based on Virtual Sensors and Petri Nets", "Doi": "10.1109/JAS.2023.123699", "Authors": ["a. m. mangini", "m. roccotelli"], "Key Words": ["charge point booking", "electric mobility", "ev charging", "petri net", "virtual sensor"], "Abstract": "about 60% of emissions into the earth atmosphere are produced by the transport sector caused by exhaust gases from conventional internal combustion engines. an effective solution to this problem is electric mobility which significantly reduces the rate of urban pollution. the use of electric vehicles  evs  has to be encouraged and facilitated by new information and communication technology  ict  tools. to help achieve this goal this paper proposes innovative services for electric vehicle users aimed at improving travel and charging experience. the goal is to provide a smart service to allow drivers to find the most appropriate charging solutions during a trip based on information such as the vehicle current position battery type state of charge nearby charge point availability and compatibility. in particular the drivers are supported so that they can find and book the preferred charge option according to time availability and the final cost of the charge points  cps . to this purpose two virtual sensors  vss  are designed modeled and simulated in order to provide the users with an innovative service for smart cp searching and booking. in particular the first vs is devoted to locate and find available cps in a preferred area whereas the second vs calculates the charging cost for the ev and supports the driver in the booking phase. a uml activity diagram describes vss operations and cooperation while a uml sequence diagram highlights data exchange between the vss and other electromobility ecosystem actors  cp operator ev manufacturer etc. . furthermore two timed petri nets  tpns  are designed to model the proposed vss functioning and interactions as discrete event systems. the petri nets are synchronized by a single larger tpn that is simulated in different use cases and scenarios to demonstrate the effectiveness of the proposed vss.", "Pub Date": "2023-08-15"}