{"Title": "Instance-Guided Point Cloud Single Object Tracking With Inception Transformer", "Authors": ["j. liu", "y. wu", "m. gong", "q. miao", "w. ma", "f. xie"], "Pub Date": "2023-09-18", "Abstract": "single object tracking  sot  in light detection and ranging  lidar  point clouds is a challenging problem in computer vision. compared to object level point clouds scene level point clouds for tracking are more complex requiring long range semantic awareness and local shape context. however previous methods directly filter candidates under limited matched features without systematically considering these two factors. inspired by transformer to establish long distance dependence and convolution to capture local high frequency information we propose a point tracking inception transformer  ptit  which efficiently predicts high quality 3 d tracking results in a coarse to fine manner with the support of spatio temporal point clouds. ptit consists of three novel designs as follows. 1  we design instance guided sampling  igs  to help identify and preserve the relevant points of the given template and the foreground points of the search area. 2  we propose a point inception transformer  pit  which consists of a multifrequency attention and cross attention module where the former captures both remote dependency and local detail and the latter matches template and search area features. 3  after generating coarse tracking results from cross attention we locate the target by motion transformation in the spatio temporal point cloud to generate a fine grained 3 d bounding box  bbox . in addition we perform feature augmentation on the points and boxes to mitigate the negative effects of lidar point clouds without texture and incompleteness. ptit performs significantly better than previous state of the art methods on kitti and nuscenes datasets. our further analysis confirms the effectiveness of each component and shows the great potential of the inception transformer centric paradigm when combined with spatio temporal point clouds. our code is available at https //github.com ywu0912/teamcode.git.", "Doi": "10.1109/TIM.2023.3312474", "Key Words": ["feature matching", "inception transformer", "instance sampling", "point cloud tracking"]}