{"Title": "Intelligent Reflecting Surface Assisted Secure Computation of Wireless Powered MEC System", "Doi": "10.1109/TMC.2023.3269791", "Authors": ["b. li", "j. liao", "w. wu", "y. li"], "Key Words": ["mobile edge computing (mec)", "wireless power transfer (wpt)", "intelligent reflecting surface (irs)", "physical layer security (pls)", "secure computation"], "Abstract": "the integration of mobile edge computing  mec  and wireless power transfer  wpt  can effectively improve the computing ability and energy sustainability of energy constrained wireless devices in the internet of things  iot  networks. intelligent reflecting surface  irs  has recently emerged as an effective technique to improve the performance of wireless systems by intelligently reconfiguring wireless environments. this paper studies the exploitation of irs to improve the secure computation performance of wpt mec systems with a passive eavesdropper. a wireless access point  ap  first charge multiple users with the emitted energy signals and then the users perform local computing and partial offloading to complete their computation tasks with the harvested energy in the presence of an eavesdropper where the local computing can be executed during the whole process of wpt and offloading. meanwhile deploying irs can improve the energy capture and secure offloading performance of the users. we maximize the secure computation task bits of users by jointly optimizing the ap energy transmit beamforming the irs phase shifts the transmit power users‚äô offloading time and the local computation frequency of users which are tangled with each other. an iterative optimal algorithm is developed to solve this non convex problem by combining taylor expansion method semidefinite relaxation  sdr  algorithm the lagrange duality theory and karush kuhn tucker  kkt  conditions. the numerical results show that the proposed scheme can effectively increase the secure computation task bits compared with other benchmark schemes especially for the maximum transmit power of ap the improvement is above 45$\\%$%.", "Pub Date": "2024-03-07"}