{"Title": "Inter-Pass Motion Correction for Whole-Body Dynamic PET and Parametric Imaging", "Authors": ["x. guo", "j. wu", "m. -k. chen", "q. liu", "j. a. onofrey", "d. pucar", "y. pang", "d. pigg", "m. e. casey", "n. c. dvornek", "c. liu"], "Pub Date": "2023-03-31", "Abstract": "whole body dynamic fluoro d glucose  fdg  positron emission tomography  pet  imaging through continuous bed motion  cbm  mode multi pass acquisition protocol is a promising metabolism measurement. however inter pass misalignment originating from body movement could degrade parametric quantification. we aim to apply a non rigid registration method for inter pass motion correction in whole body dynamic pet. 27 subjects underwent a 90 min whole body fdg cbm pet scan on a biograph mct  siemens healthineers  acquiring 9 over the heart single bed passes and subsequently 19 cbm passes  frames . the inter pass motion correction was executed using non rigid image registration with multi resolution b spline free form deformations. the parametric images were then generated by patlak analysis. the overlaid patlak slope  $k {i}$  and y intercept  $v {b}$  images were visualized to qualitatively evaluate motion impact and correction effect. the normalized weighted mean squared patlak fitting errors  nfes  were compared in the whole body head and hypermetabolic regions of interest  rois . in  $k {i}$  images roi statistics were collected and malignancy discrimination capacity was estimated by the area under the receiver operating characteristic curve  auc . after the inter pass motion correction was applied the spatial misalignment appearance between  $k {i}$  and  $v {b}$  images was successfully reduced. voxel wise normalized fitting error maps showed global error reduction after motion correction. the nfe in the whole body   $p \\\\=$  0.0013  head   $p \\\\=$  0.0021  and rois   $p \\\\=$  0.0377  significantly decreased. the visual performance of each hypermetabolic roi in  $k {i}$  images was enhanced while 3.59% and 3.67% average absolute percentage changes were observed in mean and maximum  $k {i}$  values respectively across all evaluated rois. the estimated mean  $k {i}$  values had substantial changes with motion correction   $p \\\\=$  0.0021 . the auc of both mean  $k {i}$  and maximum  $k {i}$  after motion correction increased possibly suggesting the potential of enhancing oncological discrimination capacity through inter pass motion correction.", "Doi": "10.1109/TRPMS.2022.3227576", "Key Words": ["inter-pass motion correction", "non-rigid registration", "parametric imaging", "whole-body dynamic positron emission tomography (pet)"]}