{"Title": "Intelligent Resource Allocation for Edge-Cloud Collaborative Networks: A Hybrid DDPG-D3QN Approach", "Doi": "10.1109/TVT.2023.3253905", "Authors": ["h. hu", "d. wu", "f. zhou", "x. zhu", "r. q. hu", "h. zhu"], "Key Words": ["cooperative offloading", "deep reinforcement learning", "dynamic offloading", "mobile edge computing (mec)"], "Abstract": "to handle the ever increasing iot devices with computation intensive and delay critical applications it is imperative to leverage the collaborative potential of edge and cloud computing. in this paper we investigate the dynamic offloading of packets with finite block length  fbl  in an edge cloud collaboration system consisting of multi mobile iot devices  mids  with energy harvesting  eh  multi edge servers and one cloud server  cs  in a dynamic environment. the optimization problem is formulated to minimize the average long term service cost defined as the weighted sum of mid energy consumption and service delay with the constraints of the available resource the energy causality the allowable service delay and the maximum decoding error probability. to address the problem involving both discrete and continuous variables we propose a multi device hybrid decision based deep reinforcement learning  drl  solution named ddpg d3qn algorithm where the deep deterministic policy gradient  ddpg  and dueling double deep q networks  d3qn  are invoked to tackle continuous and discrete action domains respectively. specifically we improve the actor critic structure of ddpg by combining d3qn. it utilizes the actor part of ddpg to search for the optimal offloading rate and power control of local execution. meanwhile it combines the critic part of ddpg with d3qn to select the optimal server for offloading. simulation results demonstrate the proposed ddpg d3qn algorithm has better stability and faster convergence while achieving higher rewards than the existing drl based methods. furthermore the edge cloud collaboration approach outperforms non collaborative schemes.", "Pub Date": "2023-08-25"}