{"Title": "Interpatient Heartbeat Classification Using Modified Residual Attention Network With Two-Phase Training and Assistant Decision", "Authors": ["y. wang", "g. zhou", "c. yang"], "Pub Date": "2023-01-11", "Abstract": "state of the art studies on automatic heartbeat classification have made efforts to improve supraventricular ectopic beat  sveb  detection but resulted in a low positive predictive value  ppv  of sveb and poor performance of other categories under the interpatient paradigm. this article proposes a novel algorithm for heartbeat classification by the means of deep learning combined with feature extraction which enhances the performance and can be applied to an automatic electrocardiogram  ecg  analysis. it is an improved residual attention network  iranet  that combines attention module residual inception block and bidirectional long short term memory  bilstm  layer to process single heartbeat segments directly. a two phase training method is presented to change the weights in a planned way to deal with the imbalance of distinguishable features. an assistant decision for the deep learning based model enhances the ppv of sveb effectively. under the interpatient paradigm on the massachusetts institute of technology and beth israel hosipital  mit bih  arrhythmia database the overall accuracy  acc  of four classes achieves 0.9548. for sveb class the ppv is significantly improved to 0.7557 with the sensitivity  sen  and an  $f1$  score of 0.7392 and 0.7474 respectively. for ventricular ectopic beat  veb  class the sen ppv and  $f1$  score achieve 0.9575 0.8500 and 0.9005 respectively and the numbers are 0.9663 0.9873 and 0.9767 for normal beat class. for fusion beat class the numbers are 0.7964 0.3597 and 0.4954 respectively. the proposed algorithm gets competitive results with the state of the art studies and there is a notable improvement in the detection of sveb", "Doi": "10.1109/TIM.2022.3232646", "Key Words": ["assistant decision", "heartbeat classification", "improved residual attention network (iranet)", "interpatient paradigm", "two-phase training"]}