{"Title": "Intelligent Practices of Large Language Models in Digital Government Services", "Doi": "10.1109/ACCESS.2024.3349969", "Authors": ["j. han", "j. lu", "y. xu", "j. you", "b. wu"], "Key Words": ["digital government", "governmental counseling", "gcallm", "large language models", "effective assistance"], "Abstract": "large language models have been widely used in open domain tasks with significant results as well as being able to perform zero sample closed ended questions based on internal knowledge stored in the parameters during pre training to answer the task. however this internalized knowledge may be insufficient or the knowledge may be outdated in responding to government service consultation scenarios which may result in the inability of the large language models to perform accurate and rigorous answers and provide effective assistance. this issue has attracted widespread attention but there is a lack of datasets for relevant research. therefore in this paper we take beijing as an example to collect all kinds of common service counseling questions from its government website and the corresponding official answers as a dataset which contains the daily counseling questions encountered by the citizens including common questions about medical insurance social insurance provident fund flexible employment and government private interaction. therefore this paper designs a domain specific language model  gcallm  for government service consultation based on this scenario. by fine tuning the large language models for knowledge injection the fine tuned model helps the large language models improve their performance in governmental service consulting scenarios by providing contextual information. and it solves the problem of not being able to answer precisely allowing for more rigor and accuracy of the answers. in addition the response information is answered in seven major national languages to improve the construction of digital government consulting services. a large number of experiments have proved that the model can produce accurate responses in this scenario in the field of governmental counseling.", "Pub Date": "2024-01-19"}