{"Title": "Intelligent Intrusion Detection for Internet of Things Security: A Deep Convolutional Generative Adversarial Network-Enabled Approach", "Doi": "10.1109/JIOT.2021.3112159", "Authors": ["y. wu", "l. nie", "s. wang", "z. ning", "s. li"], "Key Words": ["convolutional neural network (cnn)", "edge computing", "generative adversarial network (gan)", "intrusion detection"], "Abstract": "with the rapid advance of internet of things  iot  it is difficult for cloud centric computing to meet the requirements of low latency and ease of use. as an open and distributed system edge computing integrates computing networking storage and applications. it provides intelligent services on the edge of an iot. the edge network is composed of various wireless and wired networks and the computing and storage resources of edge nodes are limited. these conditions make the edge network expose to a variety of cyber attacks. additionally it is difficult for an iot edge node to support large scale network data collection and detection for iot security. although big data enabled intrusion detection algorithms can ensure the high accuracy of intrusion detection systems it is stressful for resource limited edge nodes to implement those algorithms in iot. motivated by these challenges we propose an intelligent intrusion detection algorithm implemented by big data mining based on a fuzzy rough set generative adversarial network  gan  and convolutional neural network  cnn . in our method we first propose a fuzzy rough set based algorithm to perform feature selection for big data via iot. then we take advantage of the efficient feature extraction capabilities of cnn for implementing intrusion detection based on selected features. furthermore after combining cnn and gan we propose an intelligent algorithm to realize intrusion detection in a variety of scenarios. finally the proposed method is compared with existing methods for evaluation. simulation results show that our method has up to 4% higher accuracy than existing methods.", "Pub Date": "2023-02-06"}