{"Title": "Intelligent Framework for Auditory and Speech Impaired Individuals by Accelerating Sign Image Analysis using Graph Data Science", "Doi": "10.1109/DISCOVER58830.2023.10316697", "Authors": ["a. t. r", "b. shamantha rai", "p. g. rithesh pakkala", "n. h r", "p. p. alva", "v. n. v"], "Key Words": ["indian sign language", "sign language recognition", "sign language translation", "image analysis", "graph data science", "deep learning"], "Abstract": "the prevalence of auditory and speech impairment in india is a significant public health concern affecting a huge number of individuals across the country. the existing body of research believes that sign language is directly equivalent to spoken language ignoring the linguistic aspects of sign language. therefore an inventive end to end system for translating and recognising sign language is required in order to facilitate real time communication between users of sign language and those who do not. by integrating sign language recognition  slr  and sign language translation  slt  techniques the system incorporates a deep learning network that analyses images for detection after being trained on a sizable dataset of hand gestures and landmark estimation using the mediapipe library thus ensuring accurate real time recognition of sign gestures. the slt module utilizes graph data science and networkx to construct a directed weighted graph of indian sign language  isl  gestures and their corresponding english translations facilitating the translation of gesture sequences into coherent english sentences. the study highlights the effectiveness and potential of combining slr and slt approaches using cnn is a dependable communication aid that enables people with speech and hearing problems to converse fluently with non sign language users. also an extensive evaluation of a comprehensive dataset consisting of 56200 images demonstrates outstanding performance and an impressive accuracy of 98.64% in recognizing and translating gestures.", "Pub Date": "2023-11-17"}