{"Title": "Intelligent Salp Swarm Scheduler With Fitness Based Quasi-Reflection Method for Scientific Workflows in Hybrid Cloud-Fog Environment", "Doi": "10.1109/TASE.2022.3170549", "Authors": ["n. rizvi", "d. ramesh", "p. c. s. rao", "k. mondal"], "Key Words": ["cloud computing", "fog computing", "fuzzy swarm schedular", "makespan", "salp swarm algorithm", "fitness based quasi-reflection", "isss-fqr", "workflow scheduling"], "Abstract": "the burgeoning volume of data from the iot applications and intelligent devices processed on the cloud data centers can lead to network congestion and transmission delay. compared to cloud computing fog computing focuses on ubiquitous connected heterogeneous devices and addresses the transmission latency by placing the fog nodes at the network edge. concerning the limited resources of fog nodes enable the computationally intensive tasks to offload on the cloud resources. scheduling of deadline constrained workflows with minimum execution cost is challenging due to complex and uncertain computation offloading problems. therefore an intelligent fuzzy scheduler is designed to offload tasks characterized with uncertain parameters to the appropriate resources. a new salp swarm algorithm has been exploited to learn and optimize fuzzy task resource allocation rules. in addition to this to overcome the shortcomings of the salp swarm algorithm it is employed with one of the best opposition methods named  fitness based quasi reflection method. the inclusion of the opposition method enhances the proposed isss fqr  intelligent salp swarm scheduler with the fitness based quasi reflection method  approach and improves the learning process. simulation studies on the benchmark workflows are carried out to demonstrate the efficacy of isss fqr. isss fqr has been compared with the classical algorithms including chemical reaction optimization and ant colony optimization algorithms for workflow scheduling problems  cr ac  cost makespan aware scheduling  deadline based cmas  and directional and non local convergent particle swarm optimization  dncpso . from the analyzed result isss fqr outperforms the rest of the classical algorithms which proves the effectiveness of isss fqr. note to practitioners‚äîthis paper provides a novel method called isss fqr for minimizing the cost of execution of iot applications while satisfying the deadline constraint. an intelligent fuzzy scheduler is designed to offload tasks characterized with uncertain parameters to the appropriate resources. the isss fqr combines the salp swarm algorithm and the obl method named fqr to learn the task resource allocation rules. it is compared with three state of the art algorithms called cr ac deadline based cmas and dncpso. from the analyzed result it has been observed that isss fqr outperforms the previous algorithms.", "Pub Date": "2023-04-06"}