{"Title": "Investigation of Noise Properties in the InP HEMT for LNAs in Qubit Amplification: Effects From Channel Indium Content", "Authors": ["j. li", "j. bergsten", "a. pourkabirian", "j. grahn"], "Pub Date": "2024-03-27", "Abstract": "the inp high electron mobility transistor  hemt  is employed in cryogenic low noise amplifiers  lnas  for the readout of faint microwave signals in quantum computing. the performance of such lnas is ultimately limited by the properties of the active  $\\mathrm {in {x}ga {1 x}as}$  channel in the inp hemt. in this study we have investigated the noise performance of 100 nm gate length inp hemts used in cryogenic lnas for amplification of qubits. the channel indium content in the inp hemts was 53 60 and 70%. hall measurements of the epitaxial materials and dc characterization of the inp hemts confirmed the superior transport properties of the channel structures. an indirect method involving an lna and small signal noise modeling was used for extracting the channel noise with high accuracy. under noise optimized bias we observed that the 60% indium channel inp hemt exhibited the lowest drain noise temperature. the difference in lna noise temperature among inp hemts became more pronounced with decreasing drain voltage and current. an average noise temperature and average gain of 3.3 k and 21 db respectively for a 4‚äì8 ghz three stage hybrid cryogenic lna using 60% indium channel inp hemts was measured at a dc power consumption of  $108 ~\\mu \\text{w}$ . to the best of the authors‚äô knowledge this is a new state of the art for a c band lna operating below 1 mw. the higher drain noise temperature observed for 53 and 70% indium channels inp hemts can be attributed to a combination of thermal noise in the channel and real space transfer of electrons from the channel to the barrier. this report gives experimental evidence of an optimum channel indium content in the inp hemt used in lnas for qubit amplification.", "Doi": "10.1109/JEDS.2024.3371905", "Key Words": ["drain noise temperature", "inp high-electron-mobility transistor (hemt)", "indium channel", "low-noise amplifier (lna)", "qubit amplification"]}