{"Title": "IoT Edge-Computing-Enabled Efficient Localization via Robust Optimal Estimation", "Doi": "10.1109/JIOT.2022.3200095", "Authors": ["s. qin", "x. guo"], "Key Words": ["edge computing", "internet of things (iot)", "robust linear programming (lp)", "source localization", "taylor series"], "Abstract": "source localization within wireless sensor networks  wsns  is one of the critical technologies in the internet of things  iot . as the number of network nodes increases so does the amount of data and computational requirement. it is imperative to introduce edge computing. however there are still two issues when running existing wireless location algorithms on edge nodes  1  conventional low complexity approaches are easily affected by the bias generated in complex environments leading to low locating accuracy and 2  the optimization algorithms considering the bias have good performances but they are calculation efficiency low on edge nodes. this study proposes a computationally efficient and high precision location method to tackle the troubles. precisely we first introduce our previous research to construct a bias considered nonconvex problem with a linear objective. then we propose an angle assisted taylor series with zero truncation error to linearize the second order cone  soc  constraint in the established problem. next we resort to the mini max criterion to eliminate the angular uncertainty and get a robust linear programming  lp  problem with an optimal solution. so far we have obtained a convex problem of low complexity. to ensure the calculated efficiency of the proposed problem on edge nodes we proceed to give the solving process of the problem. moreover we provide a constraints tracking mechanism to reduce the number of iterations in the solution procedure improving computational efficiency. simulations and experiments demonstrate that the proposed method with similar locating accuracy to state of the art optimization algorithms exhibits much higher computing efficiency on edge nodes.", "Pub Date": "2022-12-22"}