{"Title": "IoT-Enabled Secure and Scalable Cloud Architecture for Multi-User Systems: A Hybrid Post-Quantum Cryptographic and Blockchain-Based Approach Toward a Trustworthy Cloud Computing", "Authors": ["r. r. irshad", "s. hussain", "i. hussain", "j. a. nasir", "a. zeb", "k. m. alalayah", "a. a. alattab", "a. yousif", "i. m. alwayle"], "Pub Date": "2023-10-02", "Abstract": "cloud computing has revolutionized organizational operations by providing convenient on demand access to resources. the emergence of the internet of things  iot  has introduced a new paradigm for collaborative computing leveraging sensors and devices that generate and process vast amounts of data thereby resulting in challenges related to scalability and security making the significance of conventional security methods even more pronounced. consequently in this paper we propose a novel scalable and secure cloud architecture  ssca  that integrates iot and cryptographic techniques aiming to develop scalable and trustworthy cloud systems thus enabling multi user systems and facilitating simultaneous access to cloud resources by multiple users. the design adopts a decentralized approach utilizing multiple cloud nodes to handle user requests efficiently and incorporates multicast and broadcast rekeying algorithm  mbra  to ensure the privacy and confidentiality of user information utilizing a hybrid cryptosystem that combines mbra post quantum cryptography  pqc  and blockchain technology. leveraging iot devices the architecture gathers data from distributed sensing resources and ensures the security of collected information through robust mbra pqc encryption algorithms while the blockchain ensures that the confidential data is stored in distributed and immutable records. the proposed approach is applied to several datasets and the effectiveness is validated through various performance metrics including response time throughput scalability security and reliability. the results highlight the effectiveness of the proposed ssca showcasing a notable reduction in response time by 1.67 seconds and 0.97 seconds for 250 and 1000 devices respectively in comparison to the mhe is cpmt. likewise ssca demonstrated significant improvements in the auc values exhibiting enhancements of 6.30% 6.90% 7.60% and 7.30% at the 25 user level and impressive gains of 5.20% 9.30% 11.50% and 15.40% at the 50 user level when compared to the mhe is cpmt eam scss and shcef models respectively.", "Doi": "10.1109/ACCESS.2023.3318755", "Key Words": ["blockchain", "iot-enabled cloud architecture", "post-quantum cryptography", "artificial intelligence", "scalability", "multi-user systems", "decentralized approach"]}