{"Title": "IoT-Based Non-Intrusive Automated Driver Drowsiness Monitoring Framework for Logistics and Public Transport Applications to Enhance Road Safety", "Doi": "10.1109/ACCESS.2023.3244008", "Authors": ["m. a. khan", "t. nawaz", "u. s. khan", "a. hamza", "n. rashid"], "Key Words": ["adas", "driver drowsiness", "road safety", "driver monitoring", "iot", "edge computing", "mobile application", "road accidents", "cloud computing"], "Abstract": "the exponential growth in road accidents has led to a need for continuous driver monitoring to enhance road safety. existing techniques rely on vehicle sensor based and behavior analysis based approaches where the behavior analysis based approaches are generally considered more desirable as they enable reliable detection of a more elaborate set of driver behaviors. they are categorized as intrusive and non intrusive approaches. unlike intrusive approaches that generally rely on constant direct human contact with sensors  physiological signals  and are sensitive to artifacts non intrusive approaches offer a more effective behavior monitoring using computer vision based techniques. this paper proposes an end to end non intrusive iot based automated framework to monitor driver behaviors designed specifically for logistic and public transport applications. it consists of an embedded system edge computing and cloud computing modules and a mobile phone application in an attempt to provide a holistic unified solution for drowsiness detection monitoring as well as evaluation of drivers. drowsiness detection is based on detecting sleeping yawning and distraction behaviors using an image processing based technique. to minimize the effects of latency throughput and packet losses edge computing is performed using commercial off the shelf embedded boards. moreover a cloud hosted real time database for remote monitoring on interactive android mobile application has been set up where admin can add multiple drivers to get drowsiness notifications along with other useful related information for driver evaluation. an extensive experimental testing has been performed obtaining encouraging results. an overall accuracy of 96% is achieved along with an enhanced robustness portability and usability of the proposed framework.", "Pub Date": "2023-02-15"}