{"Title": "IoTFuzz: Automated Discovery of Violations in Smart Homes With Real Environment", "Doi": "10.1109/JIOT.2023.3325851", "Authors": ["x. ban", "m. ding", "s. liu", "c. chen", "j. zhang"], "Key Words": ["digital twin", "fuzzing", "internet of things (iot)", "model checking", "natural language processing (nlp)", "safety and security"], "Abstract": "smart homes  shs  are rapidly evolving to incorporate intelligent features including environment management home automation and human‚äìmachine interactions. however safety and security risks of shs hinder their wide adoption. many work attempts to provide defense mechanisms to ensure safety and security against interrule vulnerabilities and spoofing attacks. this article proposes iotfuzz a fuzzing framework that dynamically address cyber security and physical safety aspects of shs through targeted policies. iotfuzz mutates the inputs from policies human activities indoor environment and real life outdoor weather conditions. in addition to the binary status of devices the continuous value status in shs is leveraged to perform mutation and simulation. the policies are expressed as temporal logic formulas with time constraints. for large scale testing iotfuzz employs digital twins to simulate normal behaviors outdoor environment impacts and human activities in shs. moreover iotfuzz can also intelligently infer rule policy correlation based on natural language processing  nlp  techniques. the evaluation of iotfuzz in a configured sh with 15 rules and 10 predefined unique policies demonstrates its effectiveness in revealing the impacts of real life outdoor environment. the experimental results demonstrate a range of violations with a maximum of 4154 violations and a minimum of 41 violations observed over an 8 year period under varying weather conditions. iotfuzz also identifies the potential risks associated with improper human activities accounting for up to 35.4% of risky situations in shs.", "Pub Date": "2024-03-08"}