{"Title": "IPCC7: Post-Quantum Encryption Scheme Based on a Perfect Dominating Set in 3-Regular Graph", "Authors": ["j. ryu", "y. kim", "s. yoon", "j. -s. kang", "y. yeom"], "Pub Date": "2024-01-11", "Abstract": "post quantum cryptography  pqc  has been actively explored to meet the requirements arising with the rapid development of quantum computers. the national institute of standards and technology  nist  conducted a competition to establish the next generation cryptographic standards. while previous competitions selected a single cryptographic standard this competition aimed to standardize several algorithms based on various mathematical problems since the security of pqc has not been studied as extensively as that of legacy cryptosystems. the recent exclusion of the isogeny based key establishment algorithm sike from the competition emphasizes the necessity of exploring cryptographic algorithms based on various fundamental problems. in this study we propose the improved perfect code cryptosystem 7  ipcc7  a new post quantum encryption scheme as an improved version of the perfect code cryptosystem  pcc  based on combinatorics conceptualized by koblitz. the security of our cryptosystem relies on the intractability of finding the perfect dominating set in a given graph. a pcc proposed previously by koblitz did not receive much attention because of its low efficiency for handling higher order polynomials. to overcome these drawbacks we used the product of low degree polynomials and demonstrated the feasibility of a graph based encryption scheme. ipcc7 has some limitations for use as a general purpose pqc. however considering its relatively small key size  768 bytes public key and 64 bytes secret key  fast decryption speed  2.0 gbps  and usable encryption speed  8.6mbps  ipcc7 is particularly suitable for environments with low memory constraints such as white box encryptions.", "Doi": "10.1109/ACCESS.2024.3349704", "Key Words": ["graph-based encryption", "perfect code cryptosystems", "perfect dominating function", "perfect dominating set", "post-quantum cryptography"]}