{"Title": "IRIS-A New Distributed Research Infrastructure on Applied Superconductivity", "Authors": ["l. rossi", "p. arpaia", "c. attanasio", "g. avallone", "f. avitabile", "l. balconi", "e. bellingeri", "e. beneduce", "t. benson", "c. bernini", "a. bersani", "a. bianchi", "f. broggi", "s. burioli", "p. campana", "m. cannav√≥", "l. canonica", "m. cialone", "c. cirillo", "m. cuoco", "d. d'agostino", "m. d. franco", "m. d. torre", "e. de matteis", "s. de pasquale", "b. d. girolamo", "a. esposito", "s. farinon", "g. fiorillo", "u. gambardella", "r. gargiulo", "g. grauso", "a. leo", "e. leo", "s. m. felis", "a. malagoli", "s. mariotto", "d. marr√©", "g. maruccio", "f. miletto", "a. g. monteduro", "r. musenich", "l. parodi", "d. pedrini", "m. prioli", "m. putti", "s. rizzato", "l. sabbatini", "a. saggese", "c. santini", "e. sarnelli", "a. selce", "c. severino", "f. severino", "m. sorbi", "s. sorti", "m. statera", "a. traverso", "r. valente", "a. vannozzi"], "Pub Date": "2024-01-11", "Abstract": "in the frame of the next generation europe program the eu program to boost after covid recovery the italian minister of university and research has funded a project called innovative research infrastructure for applied superconductivity  iris . new laboratories will be built or upgraded in six poles  milan  hub of the infrastructure  genoa frascati naples salerno and lecce to carry out basic research on magnetism and superconducting materials test of wires tapes and large current cables superconducting magnets construction with advanced instrumentation power tests of magnets and a special facility for high current high voltage superconducting lines. the program will be executed over three years and then will operate for at least 10 years. it includes two first demonstrators  one hts magnet to be operated at 10‚äì20 k and a superconducting line of 1 gw  40 ka‚äì25 kv  about 140 m long. the demonstrators anticipate the main scope of the investment in the iris infrastructure  to support the use of superconductivity for improving sustainability by decreasing the energy consumption without compromising performance. this article describes the global iris project.", "Doi": "10.1109/TASC.2023.3341984", "Key Words": ["accelerator magnets", "dc power transmission lines", "hts magnets", "large scale superconductivity", "superconducting magnets"]}