{"Title": "IRS Aided MEC Systems With Binary Offloading: A Unified Framework for Dynamic IRS Beamforming", "Doi": "10.1109/JSAC.2022.3228605", "Authors": ["g. chen", "q. wu", "r. liu", "j. wu", "c. fang"], "Key Words": ["intelligent reflecting surface (irs)", "mobile edge computing", "dynamic beamforming", "resource allocation", "binary offloading", "computation rate"], "Abstract": "in this paper we develop a unified dynamic intelligent reflecting surface  irs  beamforming framework to boost the sum computation rate of an irs aided mobile edge computing  mec  system where each device follows a binary offloading policy. specifically the task of each device has to be either executed locally or offloaded to mec servers as a whole with the aid of given number of irs beamforming vectors available. by flexibly controlling the number of times for irs reconfiguring phase shifts the system can achieve a balance between the performance and associated signalling overhead. we aim to maximize the sum computation rate by jointly optimizing the computational mode selection for each device offloading time allocation and irs beamforming vectors across time. since the resulting optimization problem is non convex and np hard there are generally no standard methods to solve it optimally. to tackle this problem we first propose a penalty based successive convex approximation algorithm where all the associated variables in the inner layer iterations are optimized simultaneously and the obtained solution is guaranteed to be locally optimal. then we further derive the offloading activation condition for each device by deeply exploiting the intrinsic structure of the original optimization problem. according to the offloading activation condition a low complexity algorithm based on the successive refinement method is proposed to obtain high quality suboptimal solutions which are more appealing for practical systems with a large number of devices and irs elements. moreover the optimal condition for the proposed low complexity algorithm is revealed. the effectiveness of the proposed algorithms is demonstrated through numerical examples. in addition the results illustrate the practical significance of the irs in mec systems for achieving coverage extension and supporting multiple energy limited devices for task offloading and also unveil the fundamental performance cost tradeoff embedded in the proposed dynamic irs beamforming framework.", "Pub Date": "2023-01-18"}