{"Title": "IRS-Aided Wireless Powered MEC Systems: TDMA or NOMA for Computation Offloading?", "Doi": "10.1109/TWC.2022.3203158", "Authors": ["g. chen", "q. wu", "w. chen", "d. w. k. ng", "l. hanzo"], "Key Words": ["irs", "wireless powered mobile edge computing", "dynamic beamforming", "noma", "tdma"], "Abstract": "anintelligent reflecting surface  irs  aided wireless powered mobile edge computing  wp mec  system is conceived where each device‚äôs computational task can be divided into two parts for local computing and offloading to mobile edge computing  mec  servers respectively. both time division multiple access  tdma  and non orthogonal multiple access  noma  schemes are considered for uplink  ul  offloading. to fully unleash the potential benefits of the irs employing multiple irs beamforming  bf  patterns vectors in the considered operating frame to create time selectivity channels i.e. dynamic irs bf  dibf  is in principle possible at the cost of additional signaling overhead. to strike a balance between the system performance and associated signalling overhead we propose three cases of dibf configurations based on the maximum number of irs reconfiguration times. the degree of freedom provided by the irs may introduce different impacts on the tdma and noma based ul offloading schemes. thus it is still fundamentally unknown which multiple access scheme is superior for mec ul offloading by considering the impact of the irs. to answer this question we provide a comprehensively theoretical performance comparison for the tdma and noma based offloading schemes under the three cases of dibf configurations by characterizing their achievable computation rate. analytical results demonstrate that offloading adopting tdma can achieve the same computation rate as that of noma when all the devices share the same irs bf vector during the ul offloading. by contrast computation offloading exploiting tdma outperforms noma when the irs bf vector can be flexibly adapted for ul offloading. then we propose computationally efficient algorithms by invoking alternating optimization for solving their associated computation rate maximization problems. our numerical results demonstrate the significant performance gains achieved by the proposed designs over various benchmark schemes and also unveil that the optimal time allocated to downlink wireless power transfer can be effectively reduced with the aid of irss which is beneficial for both the system‚äôs spectral efficiency and its energy efficiency.", "Pub Date": "2023-02-10"}