{"Title": "Joint Service Migration and Resource Allocation in Edge IoT System Based on Deep Reinforcement Learning", "Doi": "10.1109/JIOT.2023.3332421", "Authors": ["f. liu", "h. yu", "j. huang", "t. taleb"], "Key Words": ["cloud", "deep reinforcement learning (drl)", "edge computing", "internet of things (iot)", "long short term memory (lstm)", "multiaccess edge computing (mec)", "parameterized deep q-networks (pdqns)", "resource allocation", "service migration"], "Abstract": "multiaccess edge computing  mec  provides services for resource sensitive and delay sensitive internet of things  iot  applications by extending the capabilities of cloud computing to the edge of the networks. however the high mobility of iot devices  e.g. vehicles  and the limited resources of edge servers  ess  affect the service continuity and access latency. service migration and reasonable resource  re  allocation consequently become needed to ensure quality of service  qos . however service migration results in additional latency. in addition different mobile iot users have different resource requirements and different resource allocation policies of target ess also determine whether service migration is necessary. subsequently how to jointly optimize service migration and resource allocation  smra  is a challenge that needs to be carefully addressed. to this end this article investigates the joint optimization problem of smra in mec environments to minimize the access delay of iot users. it proposes a joint smra algorithm based on deep reinforcement learning  drl  which takes into account the mobility of iot users and decides whether to migrate services where to migrate and how to allocate resources through the long short time memory  lstm  algorithm and the parameterized deep  $q$  network  pdqn  algorithm. moreover the pdqn algorithm effectively solves the discrete continuous hybrid action space challenge in the smra problem. finally we conduct evaluation using a real world data set of beijing cab trajectories to verify the effectiveness and superiority of our proposed smra solution.", "Pub Date": "2024-03-27"}