{"Title": "Joint Air-Ground Distributed Federated Learning for Intelligent Transportation Systems", "Doi": "10.1109/TITS.2023.3265416", "Authors": ["s. s. shinde", "d. tarchi"], "Key Words": ["vehicular edge computing", "federated learning", "aerial networks", "markov decision process"], "Abstract": "supported by some of the major revolutionary technologies such as internet of vehicles  iovs  edge computing and machine learning  ml  the traditional vehicular networks  vns  are changing drastically and converging rapidly into one of the most complex highly intelligent and advanced networking systems mostly known as intelligent transportation system  its . recently distributed ml techniques such as federated learning  fl  have gained huge popularity mainly for their advantages in terms of intelligence sharing and privacy concerns. vns are a natural contender for exploiting fl for solving challenging problems  however their limited resources dynamic nature high speed and reduced latency requirements often become the bottleneck. v2x communication technologies allow vehicular terminals  vts  to share their valuable local environment parameters and become aware of their surroundings. such information can be utilized to build a more sustainable and affordable fl platform for serving vts. gaining from recently introduced 3d architectures integrating terrestrial and aerial edge computing layers we present here a distributed fl platform able to distribute the fl process on a 3d fashion while reducing the overall communication cost for providing vehicular services. the framework is defined as a constrained optimization problem for reducing the overall fl process cost through a proper network selection between various nodes. we have modeled the fl network selection problem as a sequential decision making process through a markov decision process  mdp  with time dependent state transition probabilities. a computation efficient value iteration algorithm is adapted for solving the mdp. comparison with various benchmark methods shows the overall improvement in terms of latency energy and fl performance.", "Pub Date": "2023-08-30"}