{"Title": "Joint Optimization of Coverage and Reliability for Application Placement in Mobile Edge Computing", "Doi": "10.1109/TSC.2023.3296742", "Authors": ["f. chen", "j. zhou", "x. xia", "y. xiang", "x. tao", "q. he"], "Key Words": ["application placement", "application reliability", "approximation algorithm", "integer programming", "low-latency services", "mobile edge computing", "optimization"], "Abstract": "mobile edge computing  mec  provides a new distributed computing paradigm that overcomes the inability of cloud computing to offer low end to end latency. in a mec environment app vendors can deliver lower latency services to mobile app users by placing applications on edge servers in close proximity to app users. from an app vendor perspective an optimal edge application placement strategy under a budget  $k$k  constraint aims to place application instances on $k$k edge servers within a specific area to maximize user coverage. however edge servers may be subject to failure due to multiple reasons e.g. hardware faults software exceptions cyber attacks etc. app users served by failed edge servers need to access applications from remote cloud servers if they cannot access any other edge servers. this impacts app users‚äô quality of experience significantly. thus app vendors need to consider the reliability of the edge server network when choosing edge servers for placing their application instances. we make the first attempt in this paper to tackle this problem of joint optimization of coverage and reliability for edge application placement  eap cr . we formulate this problem as a constrained optimization problem and prove its $\\mathcal {np}$np hardness theoretically. then we propose an optimal approach to find the optimal solutions with the integer programming technique an approximation approach is also proposed to find approximate solutions for large scale eap cr problems. we evaluate eap $opt$opt and eap $apx$apx against three relevant approaches through experiments conducted on a widely used real world data set and a synthetic data set. the results demonstrate that our proposed approaches can solve the eap cr problem effectively and efficiently.", "Pub Date": "2023-12-14"}