{"Title": "Joint Task Offloading and Resource Allocation for Vehicular Edge Computing Based on V2I and V2V Modes", "Doi": "10.1109/TITS.2022.3230430", "Authors": ["w. fan", "y. su", "j. liu", "s. li", "w. huang", "f. wu", "y. liu"], "Key Words": ["edge computing", "internet of vehicles", "computation offloading", "resource allocation", "v2i", "v2v"], "Abstract": "in an internet of vehicle  iov  scenario vehicular edge computing  vec  exploits the computing capabilities of the vehicles and roadside unit  rsu  to enhance the task processing capabilities of the vehicles. resource management is essential to the performance improvement of the vec system. in this paper we propose a joint task offloading and resource allocation scheme to minimize the total task processing delay of all the vehicles through task scheduling channel allocation and computing resource allocation for the vehicles and rsu. different from the existing works our scheme  1  considers task diversity by profiling the tasks of the vehicles by multiple attributes including data size computation amount delay tolerance and task type  2  considers vehicle classification by dividing the vehicles into 4 sets according to whether they have task offloading requirements or provide task processing services  3  considers task processing flexibility by deciding for each vehicle to process its tasks locally to offload the tasks to the rsu via v2i  vehicle to infrastructure  connections or to the other vehicles via v2v  vehicle to vehicle  connections. an algorithm based on the generalized benders decomposition  gbd  and reformulation linearization  rl  methods is designed to optimally solve the optimization problem. a heuristic algorithm is also designed to provide the sub optimal solution with low computational complexity. we analyze the convergence and complexity of the proposed algorithms and conduct extensive simulations in 6 scenarios. the simulation results demonstrate the superiority of our scheme in comparison with 4 other schemes.", "Pub Date": "2023-03-29"}