{"Title": "Joint Channel Estimation and Reinforcement-Learning-Based Resource Allocation of Intelligent-Reflecting-Surface-Aided Multicell Mobile Edge Computing", "Doi": "10.1109/JIOT.2023.3334286", "Authors": ["w. xu", "j. yu", "y. wu", "d. h. -k. tsang"], "Key Words": ["channel estimate", "intelligent reflecting surface (irs)", "mobile edge computation", "multicell networks", "proximal policy optimization (ppo)", "reinforcement learning (rl)"], "Abstract": "due to the massive computing demands of the internet of things mobile edge computing  mec  has been extensively investigated as a means of providing computation intensive and latency sensitive services at the network edge. with increasing density of base stations  bss  users are simultaneously served by multiple bss leading to the multicell mec environment. intelligent reflecting surface  irs  provides a promising solution for constructing the virtual line of sight  los  links between cell edge users  ceus  and bss. in this article we investigate the joint channel estimation and resource allocation in the irs aided multicell mec system. instead of assuming the perfect channel state information  csi  we propose a three phase channel estimation method to obtain the csi. our purpose is to minimize the total joint energy and latency cost  jelc  in terms of both task execution latency and energy consumption in the irs aided multicell mec problem by jointly optimizing the task offloading volume precoding matrix and irs phase shifts. we propose a quadratically constrained program  qcp  assisted proximal policy optimization  ppo  reinforcement learning algorithm with two modules  i.e. qcp optimizer and ppo agent  execute iteratively. the qcp optimizer is utilized to compute the offloading decision variables and the ppo agent is adapted to determine the optimal channel precoding matrix and the phase shifts of irs. numerical results validate that our qcp assisted ppo algorithm executes more rapidly than benchmarks. moreover the proposed qcp assisted ppo algorithm delivers the best performance compared to benchmarks. furthermore the multicell irs aided mec framework yields additional performance gains compared to those without irs.", "Pub Date": "2024-03-27"}