{"Title": "Joint Resource Scheduling for UAV-Enabled Mobile Edge Computing System in Internet of Vehicles", "Doi": "10.1109/TITS.2022.3224320", "Authors": ["l. sun", "l. wan", "j. wang", "l. lin", "m. gen"], "Key Words": ["internet of vehicle", "mec system", "unmanned aerial vehicles", "resource assignment"], "Abstract": "the sudden outbreak of covid-19 brings many unpredictable situations to human travel such as temporarily closed highways parking lots etc. the scenarios mentioned above will lead to a large backlog of vehicles and the requirements of internet of vehicle  iov  applications increase sharply in a period of short time correspondingly. mobile edge computing  mec  is a key enabling technology that can guarantee the diverse requirements of iov applications through the optimization of resource scheduling. however the sharp increasing in requirements of iov applications caused by the congestion of highways or parking lots still bring great challenges to the deployment of traditional mec. therefore in this paper we construct an unmanned aerial vehicle  uav  enabled mec system in which the data generated from iov applications is processed by offloading to uavs with mec servers to ensure the efficiency of data processing and the response time of iov applications. in order to approximate real world uav enabled mec system we consider the stochastic offloading and downloading processing time. moreover the priority constraints of sensors from the same vehicle are taken into consideration since they have different importance degrees. then we propose an markov network based cooperative evolutionary algorithm  mncea  to search out the optimal uav scheduling solution to guarantee the shortest response time in which the solution space is divided into multiple sub solution spaces with the help of mn structure and parameters. finally we construct multiple simulation experiments with different probability distributions to simulate uncertainty factors. the simulation results verify the validity of mncea compared with the state of the art methods which is reflected by the shortest response time of requirements of iov applications.", "Pub Date": "2023-12-01"}