{"Title": "Joint Task Partitioning and Parallel Scheduling in Device-Assisted Mobile Edge Networks", "Doi": "10.1109/JIOT.2023.3341062", "Authors": ["y. li", "x. ge", "b. lei", "x. zhang", "w. wang"], "Key Words": ["deep reinforcement learning (drl)", "device-assisted mobile edge networks", "fairness", "parallel scheduling (ps)", "task partitioning (tp)"], "Abstract": "with the development of the internet of things  iot  certain iot devices have the capability to not only accomplish their own tasks but also simultaneously assist other resource constrained devices. therefore this article considers a device assisted mobile edge computing system that leverages auxiliary iot devices to alleviate the computational burden on the edge computing server and enhance the overall system performance. in this study computationally intensive tasks are decomposed into multiple partitions and each task partition can be processed in parallel on an iot device or the edge server. the objective of this research is to develop an efficient online algorithm that addresses the joint optimization of task partitioning  tp  and parallel scheduling  ps  under time varying system states posing challenges to conventional numerical optimization methods. to address these challenges a framework called online task partitioning action and parallel scheduling policy generation  otpps  is proposed which is based on deep reinforcement learning  drl . specifically the framework leverages a deep neural network  dnn  to learn the optimal partitioning action for each task by mapping input states. furthermore it is demonstrated that the remaining ps problem exhibits np hard complexity when considering a specific tp action. to address this subproblem a fair and delay minimized task scheduling  fdmts  algorithm is designed. extensive evaluation results demonstrate that otpps achieves near optimal average delay performance and consistently high fairness levels in various environmental states compared to other baseline schemes.", "Pub Date": "2024-04-09"}