{"Title": "Joint Optimization of Computation Offloading and Resource Allocation in C-RAN With Mobile Edge Computing Using Evolutionary Algorithms", "Doi": "10.1109/ACCESS.2023.3322650", "Authors": ["s. singh", "d. h. kim"], "Key Words": ["computation offloading", "genetic algorithm", "binary pso", "profit in mec"], "Abstract": "mobile edge computing has been widely recognized as a key enabler for new latency sensitive applications on resource constrained mobile devices. the objective to offload a computationally intensive task to a cloud server is in general intended to reduce the system‚äôs energy consumption and or latency. in this paper we attempt to examine how profitable computation offloading is from a service provider‚äôs perspective. the joint optimization of radio and computing resources along with offloading decisions results in a mixed integer nonlinear optimization problem which belongs to the class of np hard problems. to counter this challenge we decouple the offloading decision from the resource allocation problem. initially approximately optimal offloading decisions are determined using evolutionary algorithms such as genetic algorithms and binary particle swarm optimization algorithms. after several iterations of the evolutionary process to make offloading decisions the optimal solution is ultimately obtained that performs resource allocation based on exact calculation of the profit value. for faster execution of the evolutionary algorithm instead of using an optimization solver to find the exact solution we use a novel approach to seeding the initial population and a regression based machine learning method to predict the optimal resource allocation values to minimize the objective function evaluation time. according to the simulations performed as part of this study the proposed evolutionary algorithms outperform existing spectral efficiency based offloading algorithm in terms of profitability with shorter execution times as well. the effects of resource availability and the parameters of the algorithm on the profitability of offloading are also examined.", "Pub Date": "2023-10-19"}