{"Title": "Joint Communication and Computation Design in Transmissive RMS Transceiver Enabled Multi-Tier Computing Networks", "Doi": "10.1109/JSAC.2022.3228553", "Authors": ["z. li", "w. chen", "z. liu", "h. tang", "j. lu"], "Key Words": ["reconfigurable meta-surface (rms) transceiver", "multi-tier computing network", "block coordinate descent (bcd) technique", "successive convex approximation (sca)", "difference-convex (dc) programming"], "Abstract": "in this paper a novel transmissive reconfigurable meta surface  rms  transceiver enabled multi tier computing network architecture is proposed for improving computing capability decreasing computing delay and reducing base station  bs  deployment cost in which transmissive rms equipped with a feed antenna can be regarded as a new type of multi antenna system. we formulate a total energy consumption minimization problem by a joint optimization of subcarrier allocation task input bits time slot allocation transmit power allocation and rms transmissive coefficient while taking into account the constraints of communication resources and computing resources. this formulated problem is a non convex optimization problem due to the high coupling of optimization variables which is np hard to obtain its optimal solution. to address the above challenging problems block coordinate descent  bcd  technique is employed to decouple the optimization variables to solve the problem. specifically the joint optimization problem of subcarrier allocation task input bits time slot allocation transmit power allocation and rms transmissive coefficient is divided into three subproblems to solve by applying bcd. then the decoupled three subproblems are optimized alternately by using successive convex approximation  sca  and difference convex  dc  programming until the convergence is achieved. numerical results verify that our proposed algorithm is superior in reducing total energy consumption compared to other benchmarks.", "Pub Date": "2023-01-18"}