{"Title": "Joint Communication and Computation Cooperation in Wireless-Powered Mobile-Edge Computing Networks With NOMA", "Doi": "10.1109/JIOT.2023.3236089", "Authors": ["s. zeng", "x. huang", "d. li"], "Key Words": ["cooperative computation offloading", "mobile-edge computing (mec)", "nonorthogonal multiple access (noma)", "wireless power transfer (wpt)"], "Abstract": "incorporating wireless power transfer  wpt  into mobile edge computing  mec  is an effective way to enhance the self sustainability of the mec network. however it is susceptible to the effect of double far near. meanwhile inspired by the fact that nonorthogonal multiple access  noma  has shown its great potential in improving the spectral efficiency of the network over orthogonal multiple access this article investigates a cooperative computation offloading scheme for a basic three node wireless powered mec scenario with noma where users overcome the effect of double far near through joint communication and computation cooperation. specifically we consider a ‚äúharvest then offload‚äù protocol composed of three stages. in the first stage users harvest wireless energy signals from the access point  ap . in the second and third stages based on noma users offload their partial computing tasks on the same time‚äìfrequency resource block by using the harvested energy in which the near user can cooperatively compute and forward the computing task of the far user. we formulate an optimization problem to minimize the transmission energy consumption of the ap by jointly optimizing the transmission power the offloading coefficient and the duration of each stage. due to the nonconvexity of the formulated problem we first transform it into an equivalent one by using the variable substitution method. then we propose an efficient iterative algorithm based on the successive convex approximation  sca  and lagrangian duality method to solve this transformed problem. simulation results show that the proposed algorithm has good convergence and the proposed scheme can achieve the best performance compared with several baseline schemes which highlights the superiority of the proposed scheme.", "Pub Date": "2023-05-17"}