{"Title": "Joint Computing, Pushing, and Caching Optimization for Mobile-Edge Computing Networks via Soft Actor‚ÄìCritic Learning", "Doi": "10.1109/JIOT.2023.3323433", "Authors": ["x. gao", "y. sun", "h. chen", "x. xu", "s. cui"], "Key Words": ["caching", "computing", "deep reinforcement learning (drl)", "mobile-edge computing (mec) network", "pushing", "soft actor‚äìcritic (sac)"], "Abstract": "mobile edge computing  mec  networks bring computing and storage capabilities closer to edge devices which reduces latency and improves network performance. however to further reduce transmission and computation costs while satisfying user perceived quality of experience a joint optimization in computing pushing and caching is needed. in this article we formulate the joint design problem in mec networks as an infinite horizon discounted cost markov decision process and solve it using a deep reinforcement learning  drl  based framework that enables the dynamic orchestration of computing pushing and caching. through the deep networks embedded in the drl structure our framework can implicitly predict user future requests and push or cache the appropriate content to effectively enhance system performance. one issue we encountered when considering three functions collectively is the curse of dimensionality for the action space. to address it we relaxed the discrete action space into a continuous space and then adopted soft actor‚äìcritic learning to solve the optimization problem followed by utilizing a vector quantization method to obtain the desired discrete action. additionally an action correction method was proposed to compress the action space further and accelerate the convergence. our simulations under the setting of a general single user single server mec network with dynamic transmission link quality demonstrate that the proposed framework effectively decreases transmission bandwidth and computing cost by proactively pushing data on future demand to users and jointly optimizing the three functions. we also conduct extensive parameter tuning analysis which shows that our approach outperforms the baselines under various parameter settings.", "Pub Date": "2024-03-08"}