{"Title": "Joint Service Quality Control and Resource Allocation for Service Reliability Maximization in Edge Computing", "Doi": "10.1109/TCOMM.2022.3227968", "Authors": ["w. zhang", "s. zeadally", "h. zhou", "h. zhang", "n. wang", "v. c. m. leung"], "Key Words": ["edge computing", "resource allocation", "service quality control", "service reliability", "low-complexity optimization"], "Abstract": "edge computing is a commonly used paradigm for providing low latency computation services by locally deploying computation and storage resources close to the user equipments  ues . since the computation resource demand of the offloaded tasks of a ue is naturally a random variable it is possible that the real time computation capacity demand of a resource limited hosting virtual machine  vm  or edge computing server  ecs  is larger than its computation capacity causing unexpected delay or delay jitter to the services which should be avoided if possible for delay sensitive applications. we consider an edge computing scenario wherein the transmission links are unmanageable and computation resource demands of vm servers are stochastic. we propose a novel logistic function based service reliability probability  srp  estimation model without specifying the distributions of the resource demands. we study the average srp maximization problem  asrpmp  in a vm based edge computing server  ecs  by jointly optimizing the service quality ratios  sqrs  and the computation resource allocations and we propose an alternative optimization algorithm  aoa  by decomposing the problem into a resource allocation problem  rap  and a service quality control problem  sqcp . based on the derived analytical solutions of the two subproblems we propose an effective and low complexity heuristic aoa  haoa  to solve the asrpmp. the simulation results obtained from both synthetic gaussian workload data and planetlab trace data demonstrate that given the same target sqr or computation resource the proposed method can achieve similar performance compared with the convex aoa  caoa  method with much higher complexity and can improve the reliability of the services compared with the baseline weighted allocation method  wam  in both high and low srp regimes.", "Pub Date": "2023-02-15"}