{"Title": "Joint Content Caching and Recommendation in Opportunistic Mobile Networks Through Deep Reinforcement Learning and Broad Learning", "Doi": "10.1109/TSC.2023.3247611", "Authors": ["d. yu", "t. wu", "c. liu", "d. wang"], "Key Words": ["broad learning", "content caching", "d2d offloading", "recommendation", "reinforcement learning"], "Abstract": "edge caching has been a research hotspot of the mobile edge computing  mec  in recent years which is an effective way to ease the burden of traffic in cellular networks. it places contents to the edge of the networks and assists contents transmission via device to device  d2d  links. traditional caching strategies strictly depend on the personal preferences of users and they are scarcely possible to reduce the transmission cost while ensuring the high effectiveness. fortunately recent studies have found that the combination of caching and recommendation can effectively improve the efficiency of edge caching and reduce the transmission cost. in this article we jointly consider the content caching and recommendation through opportunistic mobile networks  omns  to reduce the cost of content service center  csc . in order to obtain the optimal caching and recommendation solutions with sparse rating matrix we propose a joint content caching and recommender system  jccrs . in jccrs a broad incremental learning based collaborative filtering algorithm named bilcf is first proposed to predict the missing ratings. afterwards we quantify the relationship between each pair of mobile users  mus  according to their mobility similarity and preference. the content caching and recommendation problem is then modeled as a non linear integer programming  nlip  problem and we prove that it belongs to np hard. to solve this problem a deep deterministic policy gradient  ddpg  based content caching and recommendation method named dcrm is further proposed to obtain the approximate optimal solutions. extensive experiments on both a realistic dataset and a synthetic dataset validated by the realistic data show that the proposed algorithms outperform other baseline methods under different scenarios.", "Pub Date": "2023-08-08"}