{"Title": "Joint Communication and Computation Offloading for Ultra-Reliable and Low-Latency With Multi-Tier Computing", "Doi": "10.1109/JSAC.2022.3227088", "Authors": ["d. van huynh", "v. -d. nguyen", "s. chatzinotas", "s. r. khosravirad", "h. v. poor", "t. q. duong"], "Key Words": ["alternating optimization", "multi-tier computing", "ultra-reliable and low latency communications"], "Abstract": "in this paper we study joint communication and computation offloading  jcco  for hierarchical edge cloud systems with ultra reliable and low latency communications  urllc . we aim to minimize the end to end  e2e  latency of computational tasks among multiple industrial internet of things  iiot  devices by jointly optimizing offloading probabilities processing rates user association policies and power control subject to their service delay and energy consumption requirements as well as queueing stability conditions. the formulated jcco problem belongs to a difficult class of mixed integer non convex optimization problem making it computationally intractable. in addition a strong coupling between binary and continuous variables and the large size of hierarchical edge cloud systems make the problem even more challenging to solve optimally. to address these challenges we first decompose the original problem into two subproblems based on the unique structure of the underlying problem and leverage the alternating optimization  ao  approach to solve them in an iterative fashion by developing newly convex approximate functions. to speed up optimal user association searching we incorporate a penalty function into the objective function to resolve uncertainties of a binary nature. two sub optimal designs for given user association policies based on channel conditions and random user associations are also investigated to serve as state of the art benchmarks. numerical results are provided to demonstrate the effectiveness of the proposed algorithms in terms of the e2e latency and convergence speed.", "Pub Date": "2023-01-18"}