{"Title": "Joint Optimization of Server and Service Selection in Satellite-Terrestrial Integrated Edge Computing Networks", "Doi": "10.1109/TVT.2023.3320187", "Authors": ["y. gao", "z. yan", "k. zhao", "t. de cola", "w. li"], "Key Words": ["edge server placement", "energy consumption minimization", "mobile edge computing (mec)", "satellite-terrestrial integrated network", "service placement"], "Abstract": "the convergence of terrestrial and non terrestrial  e.g. satellite communications  infrastructures has been attracting more and more attention from connectivity stakeholders given the forthcoming future sixth generation  6g  communication paradigm thanks to ubiquitous coverage and broadcast multicast capabilities offered by satcom. with the advent of promising concepts such as the internet of space things  iost  the potential for applying edge computing in space has become particularly appealing. in particular in orbit computing services are provided employing edge servers placed on satellites which can inherently offer storage and computation capacity. however an open problem is to find out onboard which satellite edge servers should be placed and how distributed edge computing services could be offered. in this respect this article proposes satellite terrestrial integrated edge computing networks  stecn  aiming at minimizing the average response latency and average energy consumption by jointly selecting the optimal deployment of servers and services. first we propose a general network framework for the stecn. then we develop a heuristic algorithm based on k medoids clustering and non dominated sorting genetic algorithm ii  nsga ii  to solve the optimization problem. specifically we achieve the optimal placement of edge servers by exploiting the k medoids clustering method. in terms of service deployment the conducted performance analysis shows that the proposed solutions can approach the pareto front using the nsga ii technique. finally the proposed heuristic algorithm is compared with two benchmark algorithms by means of simulations verifying the effectiveness of our proposed algorithm. to the best of our knowledge this article is the first work considering server placement and service deployment in stecn.", "Pub Date": "2024-02-12"}