{"Title": "Joint 3-D Position Deployment and Traffic Offloading for Caching and Computing-Enabled UAV Under Asymmetric Information", "Doi": "10.1109/JIOT.2022.3223349", "Authors": ["b. zhang", "m. wang", "j. -l. yu", "c. guo", "z. han"], "Key Words": ["asymmetric information", "caching and computing resources", "contract theory", "internet of things (iot)", "unmanned aerial vehicles (uavs)"], "Abstract": "to offload the rapidly increasing video traffic in the internet of things  iot  the caching and computing enabled unmanned aerial vehicles  uavs  have become a paradigm in alleviating the pressure of wireless backhauls of the mobile network operator  mno  and improving the quality of service  qos  of subscribers of content providers  cps  especially in the situations where fixedly deployed small cell base stations  sbss  are not applicable. however the resources in the uav are costly and limited while rational cps are reluctant to reveal their willingness of leasing. taking such asymmetric information into consideration the problem that how the mno leases the caching and computing resources to different cps is formulated into a contract design problem in which the uav‚äôs 3 d position deployment is also involved. to find the optimal solutions the proposed problem is decoupled into two subproblems. in the position deployment subproblem the 3 d position of the uav is analyzed and the hovering height and coverage radius are jointly optimized to maximize the offloading volume during the life of the uav. with the derived optimal position of the uav the individual rationality  ir  and incentive compatibility  ic  constraints in the contract design subproblem are simplified and a low complexity algorithm based on the alternating direction method of multipliers  admms  is proposed to find the optimal contract. finally the effectiveness of the proposed scheme is verified by simulation and a comparative analysis is carried out in terms of save latency saved bandwidth and utility.", "Pub Date": "2023-03-23"}