{"Title": "Joint User Association, Resource Allocation, and Beamforming in RIS-Assisted Multi-Server MEC Systems", "Doi": "10.1109/TWC.2023.3304019", "Authors": ["w. he", "d. he", "x. ma", "x. chen", "y. fang", "w. zhang"], "Key Words": ["multi-access edge computing", "reconfigurable intelligent surface", "user association", "beamforming", "load balancing", "resource allocation"], "Abstract": "multi access edge computing  mec  is a promising solution to supporting resource intensive applications on mobile devices  mds  which enables computation offloading from mds to edge servers at their proximities. however the quality of the communication links and the limited communication and computing resources significantly impact the performance of mec systems. in this paper we leverage the emerging reconfigurable intelligent surfaces  riss  to assist the computation offloading and balance the computing workloads in a multi server mec system with limited communication and computing resources. specifically when a nearby edge server is overwhelmed by multiple computing tasks some mds can be redirected to potentially distant but lighter loaded edge servers by employing passive beamforming enabled by riss. thus to maximize the task completion rate we formulate a joint optimization problem for user association passive beamforming at riss receive beamforming at bss and computing resource allocation on edge servers. since the problem is a mixed integer nonlinear programming  minlp  which is challenging to solve we first decompose it into two tractable subproblems through the block coordinate descent  bcd  technique and then solve them by the penalty dual decomposition  pdd  method and a swap matching based algorithm respectively. numerical results demonstrate that the task completion rate can be significantly increased by incorporating riss into multi server mec systems. besides the proposed algorithms outperform other benchmark schemes in terms of both the task completion rate and the design complexity.", "Pub Date": "2024-04-10"}