{"Title": "Joint DNN Partition and Resource Allocation Optimization for Energy-Constrained Hierarchical Edge-Cloud Systems", "Doi": "10.1109/TVT.2022.3219058", "Authors": ["y. su", "w. fan", "l. gao", "l. qiao", "y. liu", "f. wu"], "Key Words": ["hierarchical edge-cloud systems", "dnn partition", "computing resource allocation", "end-to-end delay", "energy budget"], "Abstract": "hierarchical edge cloud systems collaboratively utilize the resources of both the edge server and central cloud enabling deep neural network  dnn  partition between the edge and cloud to accelerate the inference. however the limited energy budgets of both the edge server and central cloud restrict them from providing optimal dnn inference services. moreover considering the high dynamics in stochastic environments the long term system performance should be optimized under long term energy constraints. how to improve the long term dnn inference performance in such energy constrained hierarchical edge cloud systems is less studied by existing related works. in this paper we aim to jointly optimize dnn partition and computing resource allocation to minimize the long term average end to end delay of multiple types of deep learning  dl  tasks while guaranteeing the energy consumption of the edge server and central cloud within their energy budgets. based on the lyapunov optimization technique and reinforcement learning we design a novel deep deterministic policy gradient based dnn partition and resource allocation  ddpra  algorithm to train policy to decide dnn partition dynamically by observing the environment. moreover the ddpra algorithm is embedded with a heuristic computing resource allocation  hcra  algorithm which effectively reduces the complexity of policy training by decoupling and optimizing the computing resource allocation separately. we analyze the complexity of our algorithms and conduct extensive simulations. the numerical results demonstrate the superiority of our algorithm in comparison with 5 other schemes in multiple scenarios.", "Pub Date": "2023-03-14"}