{"Title": "Joint Use of a Low Thermal Resolution Thermal Camera and an RGB Camera for Respiration Measurement", "Authors": ["z. khan", "m. rusanen", "m. arvonen", "t. lepp√§nen", "s. s√§rkk√§"], "Pub Date": "2023-12-22", "Abstract": "recently joint use of thermal camera and rgb camera has emerged as a potential solution for respiration measurement. bulky and large thermal cameras with high thermal resolution have been mostly used in thermal imaging based respiration measurement studies. we aim to present a method for respiration measurement using an rgb camera and a low thermal resolution thermal camera. thermal cameras with low thermal resolution are small in size and easily portable allowing flexible and a simple implementation of the measurement system. first the cameras were calibrated and synchronized using calibration objects and sound analysis tools respectively. second a cross spectrum mapping method was developed which was followed by the extraction of the respiration signal. third the extracted and reference respiration signals were aligned. in the last step of the proposed method a signal processing framework was applied to the estimated and reference respiration signals. the performance of the cross spectrum mapping method was visually evaluated. the mapping method performed well when a participant had little to no head movements  however the performance decreased when head movements were present. our analysis showed that there is a relatively good agreement between the proposed and the reference respiration measurement methods. the number of breathing cycles from the estimated respiration signal was computed with a decent accuracy. however the accuracy of measuring breathing rate is low compared to the previous studies. the estimated breathing patterns were measured with better accuracy than in the previous work. this study demonstrates that respiration measurement can be done by the joint use of an rgb camera and thermal camera that has a low thermal resolution with a decent level of accuracy.", "Doi": "10.1109/TIM.2023.3334345", "Key Words": ["breathing measurement", "camera calibration", "camera synchronization", "noncontact method", "rgb imaging", "thermal imaging"]}