{"Title": "Judging Knowledge by its Cover: Leveraging Large Language Models in Establishing Criteria for Knowledge Graph Sources Selection", "Doi": "10.1109/ICITDA60835.2023.10427395", "Authors": ["h. hendrik", "a. e. permanasari", "s. fauziati", "s. s. kusumawardani"], "Key Words": ["knowledge graphs construction", "knowledge source selection", "large language models", "website evaluation criteria", "criteria development approach"], "Abstract": "the knowledge graph  kg  is a widely used paradigm for knowledge representation that leverages graph structures. it facilitates the discovery of relationships and provides context across various domains. despite its popularity there a notable lack of emphasis on quality control during the kg construction process particularly concerning the selection of knowledge sources. our paper addresses this research gap by introducing criteria for selecting high quality websites during the data acquisition phase of kg construction. we propose a set of criteria‚äîcredibility relevance content quality coverage comprehensiveness and accessibility‚äîthat serves as a benchmark for evaluating potential online knowledge sources for kgs. we determine the weight of each criterion through expert judgment and validation using large language models  large language model  representing artificial intelliegence technologies. our panel consisting of academicians and practitioners ranks the criteria by importance with the rank ordered centroid and rank reciprocal weighting methods generating weights from these rankings. we employ four large language model  google bard openai chatgpt 4 anthropic claude 2 and meta llama 2. our findings suggest that large language model can effectively validate human weighting results as evidenced by a high correlation  pearson $r > 0.9$  between human and large language model criterion weights. furthermore hypothesis testing reveals no significant differences  $p > 0.8$  with the models demonstrating high internal consistency. our study offers valuable insights for academics and industry professionals seeking to improve kg construction processes and establish standards for data quality and verification.", "Pub Date": "2024-02-16"}