{"Title": "Key Reduction in Multi-Key and Threshold Multi-Key Homomorphic Encryptions by Reusing Error", "Authors": ["z. koo", "j. -w. lee", "j. -s. no", "y. -s. kim"], "Pub Date": "2023-05-31", "Abstract": "as cloud computing and artificial intelliegence as a service are provided it is increasingly necessary to deal with privacy sensitive data. to deal with the sensitive data there are two cases of outsourcing process  i  many clients participate dynamically ii  many clients are pre determined. the solutions for protecting sensitive data in both cases are the multi key homomorphic encryption  mkhe  scheme and the threshold multi key homomorphic encryption  tmkhe  scheme. however these schemes may be difficult for clients with limited resources to perform mkhe and tmkhe. in addition due to the large size of the evaluation keys in particular multiplication and rotation keys the communication between the clients and server that provide outsourcing service increases. also the size of the evaluation keys that the server must hold is tremendous in particular for the multiplication and rotation keys which are essential for bootstrapping operation. in this paper we propose a variant of mkhe and tmkhe with reduced evaluation keys. to reduce the size of the evaluation keys we propose a variant of ring learning with errors  rlwe  called rlwe reusing errors  rerlwe . rerlwe generates other components by reusing the error that is used when generating an rlwe sample. we prove that rlwe can be reduced to rerlwe and propose modified evaluation keys under the rerlwe assumption which are the modified multiplication and rotation keys. for mkhe multiplication and rotation keys are reduced by 66% and 25% respectively. for tmkhe a multiplication and rotation keys are reduced by 50% and 25% respectively.", "Doi": "10.1109/ACCESS.2023.3277862", "Key Words": ["homomorphic encryption (he)", "multi-key homomorphic encryption (mkhe)", "ring learning with error (rlwe)", "threshold multi-key homomorphic encryption (tmkhe)"]}