{"Title": "KINA: Karatsuba Initiated Novel Accelerator for Ring-Binary-LWE (RBLWE)-Based Post-Quantum Cryptography", "Authors": ["p. he", "y. tu", "j. xie", "h. s. jacinto"], "Pub Date": "2023-09-22", "Abstract": "along with the national institute of standards and technology  nist  post quantum cryptography  pqc  standardization process lightweight pqc related research and development have also gained substantial attention from the research community. ring binary learning with errors  rblwe  a ring variant of binary lwe  blwe  has been used to build a promising lightweight pqc scheme for emerging internet of things  iot  and edge computing applications namely the rblwe based encryption scheme  rblwe enc . the parameter settings of rblwe enc however are not in favor of deploying typical fast algorithms like number theoretic transform  ntt . following this direction in this work we propose a karatsuba initiated novel accelerator  kina  for efficient implementation of rblwe enc. overall we have made several coherent interdependent stages of efforts to carry out the proposed work  1  we have innovatively used the karatsuba algorithm  ka  to derive the major arithmetic operation of rblwe enc into a new form for high performance operation  2  we have then effectively mapped the proposed algorithm into an efficient hardware accelerator with the help of a number of optimization techniques  and 3  we have also provided detailed complexity analysis and implementation comparison to demonstrate the superior performance of the proposed kina e.g. the proposed design with  $u=2$  involves 64.71% higher throughput and 15.37% less area delay product  adp  than the state of the art design for  $n=512$   virtex 7 . the proposed kina offers flexible processing speed and is suitable for high performance applications like iot servers. this work is expected to be useful for lightweight pqc development.", "Doi": "10.1109/TVLSI.2023.3302289", "Key Words": ["karatsuba initiated novel accelerator (kina)", "lightweight", "polynomial multiplication", "post-quantum cryptography (pqc)", "ring-binary-learning-with-errors (rblwe)"]}