{"Title": "Label Enhancement-Based Multiscale Transformer for Palm-Vein Recognition", "Authors": ["h. qin", "c. gong", "y. li", "x. gao", "m. a. el-yacoubi"], "Pub Date": "2023-04-06", "Abstract": "vein biometrics is a high security and privacy preserving identification technology that has received increasing attentions. although deep neural networks  dnns  such as convolutional neural networks  cnns  have been investigated for vein recognition and achieved a significant improvement in accuracy they still fail to model long range pixel dependencies in an image. moreover their performance is limited because the one hot label vector employed for training may ignore the relevance among labels. to address these problems we propose le msvt a label enhancement based multiscale vein transformer for palm vein recognition in this article. first we propose a multiscale vein transformer  msvt  to learn robust and multiscale features which consists of a convolutional block that captures the local information and a self attention block that extracts scale dependencies among images with different scales. second to capture the relevance among labels we explore a graph convolutional network based label enhancement  gcnle  approach to recover the realistic label distribution for vein classification improvement. gcnle exploits a multilayer perception to learn an effective label correlation matrix for extracting the relation information between an input image and multiple training images from different classes. the label distribution vector is generated and then combined with the one hot label to compute a realistic label distribution of the input image. finally we apply gcnle to msvt to obtain le msvt which is trained in an end to end way to further improve the feature representation capacity of the msvt classifier. we conduct extensive experiments in terms of msvt performance and le msvt improvements on three public palm vein databases  the experimental results show that the resulting msvt outperforms other vein identification approaches and achieves the best performance among existing approaches and gcnle can greatly improve the performance of msvt among other deep learning based classifiers.", "Doi": "10.1109/TIM.2023.3261909", "Key Words": ["deep learning", "graph convolutional network (gcn)", "label enhancement (le)", "palm-vein identification", "transformer"]}