{"Title": "Large Language Model Empowered by Domain-Specific Knowledge Base for Industrial Equipment Operation and Maintenance", "Doi": "10.1109/SRSE59585.2023.10336112", "Authors": ["h. wang", "y. -f. li"], "Key Words": ["industrial equipment operations and maintenance", "large language model", "domain-specific knowledge base"], "Abstract": "industrial equipment operations and maintenance  ieom  refers to ensuring the normal safe and reliable operation of industrial facilities which covers condition monitoring equipment maintenance troubleshooting repair and maintenance and system optimization. currently the advancements in artificial intelligence have greatly improved the efficiency and effectiveness of ieom. however its robustness and generalization in practical applications still need to be improved. large language models  llms  like chatgpt have recently made breakthrough progress demonstrating highly intelligent language comprehension capabilities. therefore they are expected to drive a new round of transformation in ieom promoting the automation and intelligence of the entire ieom process. however when using llms for practical industrial applications existing llms have fatal limitations as they severely lack domain specific expertise. this makes it difficult for llms to handle technical issues in the industrial field. to this end this study explores a new solution  llms empowered by domain specific knowledge base  llm dskb . this paper provides a detailed introduction to the core components and implementation details of llm dskb including the knowledge base text embedding vectorized retrieval etc. the performance of llm dskb is analyzed using real industrial cases and the results demonstrate that llm dskb can provide more accurate specific and industrially relevant results compared to traditional llms. this solution will drive the application of llms in the industrial field significantly enhancing the efficiency effectiveness and quality of ieom.", "Pub Date": "2023-12-11"}