{"Title": "Large-Scale Cooperative Task Offloading and Resource Allocation in Heterogeneous MEC Systems via Multiagent Reinforcement Learning", "Doi": "10.1109/JIOT.2023.3292387", "Authors": ["z. gao", "l. yang", "y. dai"], "Key Words": ["curriculum learning", "multiaccess edge computing (mec)", "reinforcement learning (rl)", "resource allocation", "task offloading"], "Abstract": "in multiaccess edge computing  mec  systems existing task offloading methods have provided ultrashort latency services for heterogeneous tasks on mobile devices  mds . nevertheless the complexity of mec systems grows exponentially with the number of mds or edge servers  ess  so learning a good offloading policy is a huge challenge when the number of mds or ess is large. moreover mds are often unable to find optimal ess for offloading since the restricted ess infrastructures and the spatiotemporally imbalanced task offloading requirements. to solve these problems we propose a curriculum spatiotemporal multiagent actor‚äìcritic  cstmaac  based task offloading method. each es is regarded as an agent and the problem is formulated as a multiobjective optimization task. to adapt to the large scale mec systems we first introduce an evolutionary curriculum learning by gradually raising the number of trained es agents in a phased way. second to facilitate the coordination of the offloading policies among geographically distributed ess we design an attention based centralized critic network. besides a delayed access mechanism is introduced that uses information about future task processing competition to capture the impact of potential future task processing contention and help es agents obtain a better offloading strategy. finally critic network is expanded to multicritics and a dynamic weight mechanism is designed to adaptively optimize multiobjectives and obtain a good balance for multiple objectives. real world data sets used in experiments demonstrate that cstmaac raises task completion rates and total utility by 13.01%‚äì15.21% and 16.89%‚äì18.32% compared with the existing algorithms.", "Pub Date": "2024-01-08"}