{"Title": "Large Language and Text-to-3D Models for Engineering Design Optimization", "Doi": "10.1109/SSCI52147.2023.10371898", "Authors": ["t. rios", "s. menzel", "b. sendhoff"], "Key Words": ["large language models", "generative ai", "text-to-3d", "simulation-based optimization", "design optimization"], "Abstract": "the current advances in generative artificial intelligence for learning large neural network models with the capability to produce essays images music and even 3d assets from text prompts create opportunities for a manifold of disciplines. in the present paper we study the potential of deep text to 3d models in the engineering domain and focus on the chances and challenges when integrating and interacting with 3d assets in computational simulation based design optimization. in contrast to traditional design optimization of 3d geometries that often searches for the optimum designs using numerical representations e.g. b spline surfaces natural language challenges the optimization framework by requiring a different interpretation of variation operators while at the same time may ease and motivate the human user interaction. here we propose and realize a fully automated evolutionary design optimization framework using shap e a recently published text to 3d asset network by openai in the context of aerodynamic vehicle optimization. for representing text prompts in the evolutionary optimization we evaluate  a  a bag of words approach based on prompt templates and wordnet samples and  b  a tokenisation approach based on prompt templates and the byte pair encoding method from gpt4. in our experiments we show the text based representations allow the optimizer to find better performing designs. however it is important to ensure that the designs generated from prompts are within the object class of application i.e. diverse and novel designs need to be realistic. furthermore more research is required to develop methods where the strength of text prompt variations and the resulting variations of the 3d designs share causal relations to some degree to improve the optimization.", "Pub Date": "2024-01-01"}