{"Title": "LARS: A Latency-Aware and Real-Time Scheduling Framework for Edge-Enabled Internet of Vehicles", "Doi": "10.1109/TSC.2021.3106260", "Authors": ["s. hu", "g. li", "w. shi"], "Key Words": ["computation offloading", "task scheduling", "internet of vehicles (iov)", "edge computing"], "Abstract": "with the development of internet of things and mobile computing the explosive proliferation of latency sensitive applications raises high computation demands for mobile devices. to this end offloading computation of applications to edge enabled internet of vehicles  iov  has emerged as an effective solution. however most of the existing studies on this issue assume that iov can be easily formed in the practical environment and neglect the dependency relationship between tasks of the offloading application. in this article we first give several observations based on the analysis results of the real traffic dataset to verify the feasibility of aggregating vehicular resources in the real world. then we design a latency aware real time scheduling framework for the edge enabled iov named lars in which mobile users can offload applications to lars and the offloading tasks can be scheduled to the appropriate vehicular resources in real time. first we propose a clustering based algorithm to generate herds which treats connected vehicles as edge computation resources to provide cooperative computing services. second considering the dependency relationship between tasks in the job we present a greedy based task scheduling algorithm for offloading jobs the objective of which is to minimize the total latency of the job as well as maximize the resource utilization of herds. the simulation experiment based on the real traffic dataset shows that herds generated by the proposed clustering based algorithm can maintain a stable period to provide computing service and the experiments on testbed include two case studies demonstrate that the superiority of the proposed scheme compared to baselines in terms of latency and resource utilization.", "Pub Date": "2023-02-06"}