{"Title": "Latency-Aware Computation Offloading in Multi-RIS-Assisted Edge Networks", "Doi": "10.1109/OJCOMS.2024.3361383", "Authors": ["a. huang", "l. qu", "m. j. khabbaz"], "Key Words": ["reconfigurable intelligent surface (ris)", "mobile edge computing", "latency minimization", "alternating optimization"], "Abstract": "mobile edge computing  mec  has a widely established merit of bringing powerful computing servers to geographically closer locations to computationally limited devices  hence reducing the task offloading latency from these devices to the servers. however the frequent communication between devices and edge servers increases the network wide traffic therefore stands in the way of enjoying notable improvements in network wide latency. the optimization of this problem becomes of utmost importance to boldly underline the advantages of mec based task offloading. reconfigurable intelligent surfaces  riss  offer the potential to improve wireless transmission environment thereby contributing to achieving this objective. this paper addresses a network wide latency optimization problem in the context of multi ris assisted mec offloading scenarios. this problem is herein subdivided into two sub problems namely   ${a}$   path selection and  ${b}$   joint optimization of ris phases and offloading volume. the cascaded channel gain is derived for  ${a}$  . a balanced trade off is sought between passive beamforming gain and reflection loss by reformulating  ${a}$   as a shortest path problem using graph theory  gt .  ${b}$   requires a different approach than the typical successive convex approximation  sca  technique used for single ris. instead a semi definite relaxation  sdr  method is adopted to transform the non convex sub problem into a convex one solved efficiently using an alternating optimization  ao  approach. the results of extensive simulations and numerical analyses reported herein reveal the notable latency reduction potency of multi ris assisted mec systems by respectively 24% as compared to their ris agnostic counterparts and by 15.34% when compared to systems incorporating a single ris.", "Pub Date": "2024-02-23"}