{"Title": "Latency Minimization Oriented Hybrid Offshore and Aerial-Based Multi-Access Computation Offloading for Marine Communication Networks", "Doi": "10.1109/TCOMM.2023.3306581", "Authors": ["m. dai", "n. huang", "y. wu", "l. qian", "b. lin", "z. su", "r. lu"], "Key Words": ["multi-access mobile edge computing", "hybrid offshore and aerial-based computing offloading", "resource allocation", "noma", "fdma"], "Abstract": "the explosively increasing development of marine communication networks will improve the quality of service  qos  of marine applications  e.g. ocean farm and marine tourism  which has attracted much attention from both academia and industrial in recent years. however real time data processing for diverse marine tasks  especially those computing intensive and latency sensitive tasks  is still challenging due to the limited marine communication and computing resources. mobile edge computing  mec  driven by powerful computing capability is envisioned as a promising solution to address the issue for resource constrained marine services. in this paper we propose a hybrid offshore and aerial based multi access edge computing scheme in marine communication networks to improve the qos of marine applications. specifically we consider a scenario that both offshore base station and unmanned aerial vehicles  uavs  are equipped with edge servers and the computation workloads of unmanned surface vehicle  usv  can be simultaneously offloaded to offshore base station and uavs via multi access manner. to minimize the latency of completing usv‚äôs workloads and reduce usv‚äôs energy consumption we formulate a joint optimization problem to optimize the offloading decision transmission time and computing rate allocation with the objective of minimizing the maximum workloads latency  mmwl . exploiting the features of the formulated problem we present a layered structure approach and decompose it into three subproblems. we propose efficient algorithms to obtain the optimal solutions and validate the optimality of the proposed algorithms. finally we provide simulation results and analysis to demonstrate the effectiveness and efficiency of the proposed scheme and algorithms in comparison with benchmark algorithms.", "Pub Date": "2023-11-17"}