{"Title": "Layer-Aware Containerized Service Orchestration in Edge Networks", "Doi": "10.1109/TNSM.2022.3217134", "Authors": ["m. dolati", "s. h. rastegar", "a. khonsari", "m. ghaderi"], "Key Words": ["containerized network function", "edge computing", "layer sharing", "popularity-aware orchestration", "service function chaining", "virtualization"], "Abstract": "edge computing provides computational resources in the vicinity of end users to reduce delay compared to traditional remote clouds. however the capacity of edge resources usually is not sufficient for the required computational demands. therefore it is necessary to design methods for employing these resources in an efficient manner. on the other hand network function virtualization  nfv  is a promising solution to use the network resources in a more flexible way than traditional schemes. although more focus has been on realization of nfv systems via virtual machines so far recent studies show that container based solutions can improve efficiency thanks to lightweight implementation and layered structure of containers. nonetheless to the best of our knowledge there is no comprehensive study on the problem of orchestrating services composed of a chain of containerized network functions in edge networks. in this paper we consider this scenario when service requests are submitted to the system and address important aspects of this problem such as downloading and sharing container layers and steering traffic among network functions. we present the formulation of the problem as an integer linear program  ilp  and prove its np hardness. then to handle this problem we propose rcco a polynomial time algorithm based on ideas from deterministic and randomized rounding framework. our results from extensive evaluations show that the bandwidth consumption of the proposed algorithm compared to the optimal algorithm is higher by only about 4% while it can outperform baselines from literature by more than 37%.", "Pub Date": "2023-06-29"}