{"Title": "Learning to Summarize Chinese Radiology Findings With a Pre-Trained Encoder", "Doi": "10.1109/TBME.2023.3280987", "Authors": ["z. jiang", "x. cai", "l. yang", "d. gao", "w. zhao", "j. han", "j. liu", "d. shen", "t. liu"], "Key Words": ["abstractive summarization", "chinese chest radiology report", "pre-trained language model", "task-oriented pre-training objective"], "Abstract": "automatic radiology report summarization has been an attractive research problem towards computer aided diagnosis to alleviate physicians‚äô workload in recent years. however existing methods for english radiology report summarization using deep learning techniques cannot be directly applied to chinese radiology reports due to limitations of the related corpus. in response to this we propose an abstractive summarization approach for chinese chest radiology report. our approach involves the construction of a pre training corpus using a chinese medical related pre training dataset and the collection of chinese chest radiology reports from department of radiology at the second xiangya hospital as the fine tuning corpus. to improve the initialization of the encoder we introduce a new task oriented pre training objective called pseudo summary objective on the pre training corpus. we then develop a chinese pre trained language model called chinese medical bert  cmbert  which is used to initialize the encoder and fine tuned on the abstractive summarization task. in testing our approach on a real large scale hospital dataset we observe that the performance of our proposed approach achieves outstanding improvement compared with other abstractive summarization models. this highlights the effectiveness of our approach in addressing the limitations of previous methods for chinese radiology report summarization. overall our proposed approach demonstrates a promising direction for the automatic summarization of chinese chest radiology reports offering a viable solution to alleviate physicians‚äô workload in the field of computer aided diagnosis.", "Pub Date": "2023-11-21"}