{"Title": "Legal Case Classification Using Machine Learning with NLP", "Doi": "10.1109/ICDSAAI59313.2023.10452618", "Authors": ["m. s. tomar", "v. gupta"], "Key Words": ["binary classification", "bert", "lr", "naive bayes", "svm", "legal case prediction", "text classification"], "Abstract": "in india offences occur daily  crime can be minor or severe. the indian jurisdiction system provides justice in every severity of the case. however reporting a crime to get justice requires proper steps. cases involving murder fall under criminal cases while cases related to a family dispute over a property fall under civil cases. accurately dividing legal circumstances into civil and criminal categories is essential for efficient legal case management and decision making processes. in recent years deep learning models have advanced significantly in problems in evolving natural language processing. this study offers a strategy based on bert for classifying legal cases as civil or criminal. the recommended model fine tunes the early halting and modifies the bert base model using a hyperparameter on a corpus of labelled court case documents using bert‚äôs ability to gather contextual information and precise relationships between words and sentences. the attention mechanism in bert enables the model to understand the nuances of the legal dataset and distinguish between civil and criminal scenarios based on the given legal context. experimental results on a large dataset of legal cases show our method‚äôs effectiveness and excellent accuracy precision recall and f1score in categorizing legal cases. the bert based model exhibits promising potential for automating case categorization enabling efficient case management assisting legal professionals in decision making processes and assisting regular people in making informed decisions by providing insightful analyses and predictions based on the available data with an accuracy of 92.9 and an f1 score of 0.93.", "Pub Date": "2024-03-04"}