{"Title": "LEO Satellite and UAVs Assisted Mobile Edge Computing for Tactical Ad-Hoc Network: A Game Theory Approach", "Doi": "10.1109/JIOT.2023.3299950", "Authors": ["x. lin", "a. liu", "c. han", "x. liang", "k. pan", "z. gao"], "Key Words": ["ad-hoc network", "exact potential game (epg)", "leo satellite", "mobile edge computing (mec)", "stackelberg game", "unmanned aerial vehicle (uav)"], "Abstract": "as an emerging technology mobile edge computing  mec  network paradigm provides great computing potential for edge services which has been widely applied in friendly city environment. however there are still many challenges to deploy mec technology in harsh tactical communication environment due to poor communication conditions limited computational resources and hostile malicious interference. thus this article investigates the computational resource pricing and task offloading strategy in tactical mec ad hoc network which consists of multiple tactical edge nodes ground mec servers unmanned aerial vehicle mec  uav mec  servers and a low earth orbit mec  leo mec  satellite server. each edge node can offload its partial computation intensive task to the mec servers to reduce computational delay and energy consumption. first a multileader and multifollower stackelberg game  mlmf sg  which includes leader subgame for mec servers and follower subgame for edge nodes is proposed to formulate the interaction between servers and edge nodes. it has been proved that there exists a stackelberg equilibrium  se  in the proposed mlmf sg. in order to decrease the delay energy consumption and resource overhead the follower subgame is further formulated as a multimode computation task offloading game. with the help of the exact potential game  epg  we prove that the follower subgame can converge to the nash equilibrium  ne . to achieve the se a hierarchical distributed iterative algorithm is designed to maximize the utilities of the leaders and followers. finally the simulation results demonstrate that the proposed scheme can achieve better performance compared with the existing schemes.", "Pub Date": "2023-11-20"}