{"Title": "Leveraging Edge Computing for Minimizing Base Station Energy Consumption in Multi-Cell (N)OMA Downlink Systems", "Doi": "10.1109/OJCOMS.2024.3354074", "Authors": ["m. ashraf", "t. riihonen", "k. g. lee"], "Key Words": ["data compression", "edge computing", "energy minimization", "non-orthogonal multiple access", "orthogonal multiple access", "power allocation"], "Abstract": "in this paper we suggest that the combination of edge computing in the form of data compression with communication at the base stations  bss  for transmissions to their associated multiple downlink users  dus  is advantageous for minimizing the total energy consumption. we assume that the individual dus have minimum rate requirements along with outage probability constraints. then we set the resource allocation to minimize the total energy consumption  the sum of compression energy and transmission energy  for the bss with orthogonal and non orthogonal multiple access  oma and noma  transmission schemes while taking into account the quality of service  qos  constraints of individual dus. the formulated optimization problems are non convex and difficult to solve. therefore the energy minimization problems are decomposed into smaller problems and low complexity solutions are obtained. specifically for the single cell scenario we use lagrange duality theory and karush‚äìkuhn‚äìtucker conditions to obtain closed form global optimal solutions. it is revealed that the optimal resource allocation at the bs is determined by a du specific parameter named path loss factor. this finding is then used to obtain the optimal resource allocation for the multi cell scenario and two iterative algorithms with guaranteed convergence are proposed to solve the energy minimization problems for noma and oma transmission schemes. next the effectiveness of the proposed approaches are demonstrated with the help of simulation results. it is found that the bss can exploit the flexibilities in minimum rate requirements and outage probability requirements and compress the data of individual dus before transmission in an attempt toward reducing the total consumed energy.", "Pub Date": "2024-02-01"}