{"Title": "Lightweight LAE for Anomaly Detection With Sound-Based Architecture in Smart Poultry Farm", "Doi": "10.1109/JIOT.2023.3318298", "Authors": ["v. goyal", "a. yadav", "s. kumar", "r. mukherjee"], "Key Words": ["autoencoder (ae)", "deep learning (dl)", "edge computing (ec)", "internet of things (iot)", "long short-term memory (lstm)", "smart poultry farming"], "Abstract": "in poultry farms the internal environment and movement of birds directly impacts health of birds. timely analysis of internal environment data is important as it may lead to an unhealthy environment for birds. traditionally data analysis techniques were performed on the data collected from the internet of things  iot  devices in the cloud. however cloudbased solutions are constrained by the lower data bandwidth available in the poultry farms situated in rural areas. also iot devices have limited computational capabilities. the increase in processing capabilities of the iot device facilitates the data analysis on the device itself termed as edge computing. hence an edge iot based model has been proposed to monitor and detect anomalies of the internal environment of the farm. raspberry pi 4 is used as an edge device in place of the high cost edge graphics processing units  gpus . a light weight deep learning  dl  algorithm long short term memory based autoencoder has been used for inferences on the multivariate data set acquired from various installed sensors. the proposed model has outperformed several existing methods by achieving an f1 score and recall of 0.9627 and 0.959 respectively at edge platforms. the performance of light weight dl model on edge devices is same as that of original model with inference time of 2 ms per event. this leads to inclusion of raspberry pi 4 at edge nodes which can be a new opportunity for low cost solutions. furthermore a novel sound based architecture is proposed to increase the movement of birds inside the farm that directly improves the health of birds.", "Pub Date": "2024-02-21"}