{"Title": "LightCert4IoTs: Blockchain-Based Lightweight Certificates Authentication for IoT Applications", "Doi": "10.1109/ACCESS.2023.3259068", "Authors": ["a. garba", "d. khoury", "p. balian", "s. haddad", "j. sayah", "z. chen", "z. guan", "h. hamdan", "j. charafeddine", "k. al-mutib"], "Key Words": ["iots", "certificate", "blockchain", "pki", "authentication", "5g"], "Abstract": "the proliferation of the internet of things  iot  within the emergence of five generation  5g  networks has received a huge attention in both industrial and academic domains. a 5g network is a cornerstone of realizing the full potential of the iot which interconnects billions of devices wirelessly. however wireless communication in iot devices reveals tremendous security risks in different dimensions and precisely in the distribution of the user certificates. the existing x.509 pki or the proposed decentralized pki based on blockchain solutions have lacked practicality and continue to have security flaws or have not yet gained widespread acceptance owing to complexity and deployment issues. we present a lightweight certificate in size  lightcert4iots  that is not issued by certification authorities  cas  due to the cost and complexity of the assignment of a signed certificate. in lightcert4iots first an end user  i.e. mobile and iot devices  issues a self signed certificate and lets local registration authorities  lras /edge nodes to verify and validate the binding identity self signed certificate of the users through the ethereum blockchain where the ethereum network is used as the global notary for the iot light certificates by saving them in the blockchain immutable ledger. the lightcert4iots leverages the advantages of blockchain technology and smart contracts to address the existing challenges of pki certificates in iot devices which neatly achieve certificate issuance update and revocation more securely and efficiently. finally the lightcert4iots experimental results show that lightcert as compared to relevant solutions baselines achieves reasonable overheads and is suitable for use in low  constrained iot devices where the memory and processor power are optimized.", "Pub Date": "2023-03-27"}