{"Title": "Lightning Talk: Trinity - Assured Neuro-symbolic Model Inspired by Hierarchical Predictive Coding", "Doi": "10.1109/DAC56929.2023.10247803", "Authors": ["s. jha"], "Key Words": ["assurance", "machine learning", "robust learning", "predictive processing"], "Abstract": "this paper describes the core concepts and challenges in developing trinity   a high assurance neuro symbolic approach to trustworthy and resilient machine learning for applications in open world contested and rapidly evolving environments. the two central concepts in trinity are a neuro symbolic factored world model that identifies entities activities and complex events and the notion of surprise against this world model that is used for self adaptation and learning as well as runtime assurance. the world model is not derived purely as a bottom up inference from sensors treating each observation as independent uncorrelated input  instead we iteratively interleave bottom up inference  conditioned on context  with top down predictions and context identification using a three layered hierarchical predictive processing  hpp  stack. thus the neuro symbolic inference in trinity is bidirectional ‚äì learning based bottom up pull that is uncertainty driven and reasoning based symbolic top down push that is decision driven. the progressively symbolic higher layers capture a larger context than the bottom layers finally culminating in the highest layer implemented using large language models. any surprise arising from the mismatch between the top down prediction and the bottom up inference is used for the continual adaptation of trinity. the inference in trinity produces a factored temporal world model as the result of perception. the predictions are accompanied by a quantitative measure of surprise from the 3 layered hpp stack. this surprise corresponds to the confidence of the model in its current inference. the continuous monitoring and adaptation accompanied by risk analysis make trinity robust to semantic adversarial perturbations and more efficiently generalizable to novelties. the hierarchical nature of trinity also enables adaptation of the architecture to the available compute resources.", "Pub Date": "2023-09-15"}