{"Title": "Lightweight Unified Collaborated Relinquish Edge Intelligent Gateway Architecture With Joint Optimization", "Doi": "10.1109/ACCESS.2023.3307808", "Authors": ["r. ramya", "s. ramamoorthy"], "Key Words": ["intelligent edge architecture", "patching", "subquadratic sorting", "joint optimization", "resource sharing", "cauchy distribution"], "Abstract": "edge computing is a distributed computing paradigm that brings computation and data storage closer to the data sources. hence the existing edge computing technique heterogeneous upload of data causes unacceptable loss in data processing with backdoor functionality problems. hence a novel lightweight unified collaborated relinquish  lucr  edge gateway architecture with isochronal patching is proposed to manage the dynamic updation process and increase the processing capacity and the isochronal patching is utilized to prevent backdoor functionality problems and also manage the considerable amount of hardware and software resources with its lightweight architecture. the existing approach does not take into account traversing methods leading to results that take into account challenges and have a limited amount of resources available. a novel aggregative subquadratic continual cauchy neural networks  nn  has been developed in which resources in esp aggregates are sorted in subquadratic sorting based on capacity vector and given to continual cauchy nn that provides resource sharing for esps resolve the contemplate problem among esps and increase availability. to solve the gap in providing joint optimization of edge server data processing and esp resource utilization a novel permutated block lasso boundary minimization optimization has been proposed in which edge server and esp processes are managed with appropriate boundary minimization in the sequence thereby achieving low power consumption high availability throughput quality of service and computational efficiency. the proposed system is implemented in the python platform and the result obtained shows that the proposed system has a high qos and throughput as well as low cost energy consumption and demand vector due to balancing edge server operation and resource sharing.", "Pub Date": "2023-08-29"}