{"Title": "Lightweight Multiscale Convolutional Networks With Adaptive Pruning for Intelligent Fault Diagnosis of Train Bogie Bearings in Edge Computing Scenarios", "Doi": "10.1109/TIM.2022.3231325", "Authors": ["a. ding", "y. qin", "b. wang", "l. jia", "x. cheng"], "Key Words": ["bearing fault diagnosis", "deep learning", "edge computing", "multiscale convolution", "neural network pruning"], "Abstract": "intelligent fault diagnosis of train bogie bearings based on edge computing is a promising technology to ensure the safety and reliability of train operation which can give fault diagnosis systems better real time performance and lower communication costs. lightweight diagnosis networks are the core of this technology. however existing lightweight diagnosis networks have the following limitations  1  they lack a lightweight learning mechanism for edge computing scenarios to deal with time scale changes of bearing fault features when trains operate under variational conditions and 2  an adaptive neural network pruning technique synchronized with training is expected to avoid the repetitive and cumbersome processes of traditional pruning techniques. to overcome the above limitations this article proposes a new multiscale lightweight network with adaptive pruning for the intelligent diagnosis fault of train bogie bearings in edge computing scenarios. first weight sharing multiscale convolutions  wsmscs  are developed to capture multi time scale features from vibration signals with extremely low computing costs. then inverse separable convolution  isc  blocks are built to further capture high level features and an adaptive pruning technique that does not require artificial jobs is proposed to eliminate useless network structures concurrently with training. finally diagnostic results are obtained through a dense layer activated by softmax. experimental results demonstrate that the accuracy and complexity of the proposed network are superior to other state of the art lightweight bearing fault diagnosis networks under varying operating conditions. furthermore the proposed networks can be deployed on more general edge devices.", "Pub Date": "2023-01-13"}