{"Title": "Location Privacy-Aware and Energy-Efficient Offloading for Distributed Edge Computing", "Doi": "10.1109/TWC.2023.3257197", "Authors": ["y. he", "x. he", "r. jin", "h. dai"], "Key Words": ["distributed edge computing", "location-privacy", "matrix sequential probability ratio test (msprt)", "lyapunov optimization"], "Abstract": "driven by the ever increasing scale and intensity of the computing tasks arising from various mobile applications distributed edge computing has fostered wide research interests. it can effectively reduce the task processing delay by partitioning the original large scale task into several small subtasks and offloading them to multiple edge nodes  ens  for parallel computing. in edge computing as the mobile user usually tends to offload computing tasks to closer ens to save transmit power the attacker may stealthily infer user location by exploiting this feature. although there have been some pioneering works on offloading related location privacy they mainly focused on the scenario where each task can only be offloaded to a single en and may not be directly applicable to distributed edge computing. besides the privacy issues considered in existing works are mainly based on good heuristics and there is still a lack of concrete examples of location privacy attacks in edge computing. to the best of our knowledge the location privacy issue in distributed edge computing still remains largely unexplored in existing literature. with this consideration a location inference attack based on matrix sequential probability ratio test  msprt  is identified in this work. besides a countermeasure based on dynamic multi en selection is proposed together with a location privacy aware and energy efficient distributed offloading scheme based on the generic lyapunov optimization framework. both theoretic analysis and simulations based on real world channel measurements are employed to validate the feasibility of the identified mpsrt attack and the effectiveness of the proposed defense scheme.", "Pub Date": "2023-11-10"}