{"Title": "Location-Aware and Delay-Minimizing Task Offloading in Vehicular Edge Computing Networks", "Doi": "10.1109/TVT.2023.3298599", "Authors": ["y. xia", "h. zhang", "x. zhou", "d. yuan"], "Key Words": ["vehicular edge computing", "location-aware", "task offloading", "delay-minimizing", "task partition"], "Abstract": "vehicular edge computing  vec  has been reported as a new computation paradigm to meet the low latency requirement in vehicular networks. in this article we study a novel location aware task offloading mechanism in a vec based single vehicle multi cell  svmc  scenario where the task can be equally partitioned into multiple subtasks. different from existing work task uploading and computing are taken into account in a parallel way. taking the impact of the uncertainty of vehicle location on task uploading time into account single cell offloading and multi cell offloading are investigated respectively. hence the scheduling problem is studied with the objective of minimization task processing delay by jointly designing the amount of offloaded subtasks for multiple cells where the task offloading decision over the small timescale is investigated due to small scale fading. the problem turns out to be a min max optimization problem which can be transformed into a minimum problem of the absolute value function. for single cell offloading a low complexity multi time slot offloading  mtso  algorithm is proposed by jointly optimizing the amount of offloaded subtasks for multiple time slots. for multi cell offloading a multi cell and multi time slots offloading  mcmtso  algorithm is proposed by jointly optimizing the amount of offloaded subtasks for multiple time slots in multiple cells with low complexity. simulation results review that the proposed algorithm can effectively reduce the task processing delay. for single cell offloading the task processing delay of mtso is reduced by 40.5% compared to partial offloading  po  while for multi cell case the mcmtso scheme can reduce the task processing delay by 24.3% compared to po.", "Pub Date": "2023-12-18"}