{"Title": "Long-Term Over One-Off: Heterogeneity-Oriented Dynamic Verification Assignment for Edge Data Integrity", "Doi": "10.1109/TMC.2023.3294180", "Authors": ["y. zhao", "y. qu", "y. xiang", "c. shi", "f. chen", "l. gao"], "Key Words": ["edge data integrity", "lyapunov optimization", "efficiency", "resource heterogeneity", "edge intelligence"], "Abstract": "edge intelligence  ei  a burgeoning research area motivates app vendors to cache data replicas on geographically distributed edge servers to deliver better services. on the downside this benefit also incurs more data integrity audit overhead on app vendors which calls for more efficient edge data integrity  edi  verification approaches. however existing edi solutions totally rely on an implicit resource homogeneity assumption edge servers have identical resource availability throughout edi inspection execution in each round but it rarely holds in reality. the edge servers with insufficient computation and or communication capacity greatly limit overall edi verification efficiency from a round perspective. thus in this work we release the identified impractical assumption and accordingly study the edi dynamic verification assignment  dva  problem for the first time. the problem aims to maximize the number of data replicas being verified in the long term under the constraints of verification delay in resource limited environments. in this way app vendors merely need to check the integrity of selected data replicas in each round for efficiency improvement. specifically we first formalize the dva problem as a delay constrained long term stochastic optimization problem and further prove its $\\mathcal {np}$np hardness. to resolve the problem efficiently we decompose it to an easy to handle form and then develop a polynomial time priority based approach named dva p with a theoretical analysis of its time complexity and performance bound. finally experimental evaluations validate that dva p can be seamlessly incorporated into existing edi solutions to enhance overall verification efficiency while guaranteeing verification performance.", "Pub Date": "2024-04-04"}