{"Title": "Love of Variety Based Latency Analysis for High Definition Map Updating: Age of Information and Distributional Robust Perspectives", "Doi": "10.1109/TIV.2022.3224655", "Authors": ["d. chen", "y. zhu", "d. wang", "h. wang", "j. xie", "x. -p. zhang", "z. han"], "Key Words": ["high definition map", "autonomous driving", "federated analytics", "love of variety", "age of information", "distributional robust chance constrained optimization"], "Abstract": "high definition  hd  map is a key technology that enables autonomous driving which has the characteristic of frequent updates and low delay requirements. in order to minimize the hd map updating latency this paper jointly considers the generation and transmission processes of hd map. the generation process of hd map relies heavily on the data captured by different types of sensors which is modeled by the federated analytics process. also in order to quantify the diversity of utilized sensors the concept of love of variety is introduced in this paper. then considering hd map is composed of dynamic and static layers that have different latency requirements during the transmission process this paper proposes a method to allocate edge server capacity to each hd map layer such that the overall information staleness can be minimized. firstly the deterministic edge capacity case is discussed and the solution is derived by obtaining the karush kuhn tucker conditions. then considering the practice that an edge server provides services to multiple attached devices simultaneously contentions among these devices make available capacity for the autonomous vehicle variational. therefore an uncertain edge capacity case is discussed as well where the uncertainty is described by wasserstein metrics and the problem is reformulated into distributional robust chance constrained optimization problem. and for the low latency purpose we utilize an inner approximation to reduce the complexity of the original problem and find a suboptimal solution. finally simulation results demonstrate the effectiveness of our proposed methods that achieves the lowest latency for hd map updating.", "Pub Date": "2023-03-20"}