{"Title": "Low-Power Lane Detection Unit With Sliding-Based Parallel Segment Detection Accelerator for FPGA", "Doi": "10.1109/ACCESS.2023.3348478", "Authors": ["h. yun", "d. park"], "Key Words": ["autonomous driving", "lane detection", "canny edge detection", "hough transform", "fpga acceleration", "low power design"], "Abstract": "recently with the development of semiconductors and vlsi  very large scale integrated circuit  the technology required for autonomous driving is rapidly developing. one of the technologies that cannot be left out is the lane detection function. lane recognition requires a lot of data from the camera sensor. as a result the data size increases making it difficult to process on a lightweight embedded board. this paper proposes a sliding based parallel segment image processing method to solve this problem. most boards in autonomous vehicles are lightweight so the technique has been designed to reduce computation and power consumption. after fetching the image‚äôs pixel data grayscale conversion gaussian smoothing sobel operator non maximum suppression and hysteresis are performed in parallel. lanes were detected by performing a hough transform operation on an image for which edge detection was completed in parallel. due to the nature of parallel processing it is more effective when image input is continuous and numerous than single image processing. this algorithm is written in c language and vhdl  vhsic hardware description language  for two parts in the board de1 soc fpga  field programmable gate array  and hps  hard processor system. due to the use of the c language and vhdl parallel programming uses 3.1 times less time twice as much memory and slightly more power than sequential programming. for hardware languages such as verilog the computation algorithms have been converted to a fixed point. when comparing hps and fpga the fpga consumed significantly fewer resources with 18 times shorter run time 50 times fewer clock cycles 3 times less power and 183 times less energy. this provides a substantial benefit.", "Pub Date": "2024-01-11"}