{"Title": "Low-Latency Scheduling Approach for Dependent Tasks in MEC-Enabled 5G Vehicular Networks", "Doi": "10.1109/JIOT.2023.3309940", "Authors": ["z. wang", "g. sun", "h. su", "h. yu", "b. lei", "m. guizani"], "Key Words": ["5g", "dependent tasks", "internet of vehicles (iov)", "multiaccess edge computing (mec)", "resource allocation"], "Abstract": "with the development of the internet of vehicles  iov  multiaccess edge computing  mec  technology places computing resources closer to users at edge nodes enabling faster more reliable and secure computing services. in the mec enabled iov networks task offloading scheduling as an effective method to alleviate the computational burden on vehicles is gaining increasing attention. however with the intelligent and networked development of vehicles the complex data dependency between in vehicle tasks brings challenges to offloading scheduling. in contrast to many existing methods that solely address individual tasks there is a growing need to tackle interrelated tasks within the iov framework. this includes tasks like processing vehicle sensor data gathering and analyzing road condition information facilitating collaborative decision making among vehicles and optimizing traffic signal systems. our objective is to address the broader challenge of offloading dependent tasks as this closely aligns with real world scenes and requirements. in this article we propose a priority based task scheduling algorithm  pbtsa  to minimize processing delay when the tasks are interdependent. pbtsa proposes a method that can better measure the data transmission and calculation delay of the iov networks. we first model dependent tasks as a directed acyclic graph  dag  and then use the reverse breadth first search  rbfs  algorithm to generate the priority of each subtask and finally according to the priority with low complexity to offload subtasks greedily to minimize task processing delay. we compare the pbtsa with the other two existing algorithms through simulations. the results show that the pbtsa can effectively reduce the task processing delay and can reach close to 10%.", "Pub Date": "2024-02-05"}