{"Title": "Low-Cost Assistive Body Temperature Screening System to Combat Communicable Infectious Diseases Leveraging Edge Computing and Long-Range and Low-Power Wireless Networks", "Doi": "10.1109/JIOT.2022.3215484", "Authors": ["l. gu", "m. mukherjee", "m. guo", "j. lloret", "r. matam"], "Key Words": ["crowd screening system", "lightweight ai/ml algorithms", "low-cost wireless edge infrastructures"], "Abstract": "in recent days due to the emergence of communicable infectious diseases healthcare and medical technologies are expected to play a critical role. the advancement of communication and sensor network technologies has accelerated mass screening systems to combat the disease. human temperature detection is one of the measurements for crowd screening in public places. nevertheless it is challenging to design a fast lightweight and easy to deploy contact less crowd screening system in the outdoor environment due to several factors such as environmental effect background temperature deployment cost and remote operation. the state of the art is mainly based on either hand held devices or high cost infrared cameras in only designated places. this article presents an end to end contactless assistive method for human body temperature screening systems starting from collecting raw temperature data using a thermal camera to identify the suspected individual for combating communicable infectious diseases. we leverage the computing storage and communication resources offered by edge computing. in particular we deploy a lightweight version of mobilenet v2 in resource constrained raspberry pi 4b to detect the human‚äôs head and body from the thermal image and use a classifier to determine the temperature from the raw temperature data. moreover we leverage a low power and long range wireless network for the exchange of model parameters between raspberry pi and the remote server. the experiments show that although the detection accuracy is not very high we can reduce the bottleneck from screening time and reduce the exposure for the individuals because of the reduced bottleneck. our proposed solution is implemented in python and is available under the open source mit license at https //github.com mitunhub/hawk i.", "Pub Date": "2023-02-20"}