{"Title": "Lyapunov-Guided Delay-Aware Energy Efficient Offloading in IIoT-MEC Systems", "Doi": "10.1109/TII.2022.3206787", "Authors": ["h. wu", "j. chen", "t. n. nguyen", "h. tang"], "Key Words": ["delay-sensitive and compute-intensive (dsci)-type tasks", "energy efficient", "industrial internet of things (iiot)", "mobile edge computing (mec)", "workload offloading"], "Abstract": "with the increasingly humanized and intelligent operation of industrial internet of things  iiot  systems in industry 5.0 delay sensitive and compute intensive  dsci  devices have proliferated and their demand for low latency and low power consumption has become more and more eager. in order to extend the battery life and improve the quality of user experience we can offload dsci type workloads to mobile edge computing  mec  servers for processing. however offloading massive amounts of tasks will incur higher energy consumption which is a severe test for the limited battery capacity of devices. in addition the delay caused by frequent communication between iiot devices and mec cannot be ignored. in this article we first formulate the stochastic computation offloading problem to minimize long term energy consumption. then we construct a virtual queue using perturbed lyapunov optimization techniques to transform the problem of guaranteeing task deadlines into a stable control problem for the virtual queue. based on this a novel delay aware energy efficient  daee  online offloading algorithm is proposed which can adaptively offload more tasks when the network quality is good. meanwhile it delays transmission in the case of poor connectivity but ensures that the deadline is not violated. moreover we theoretically demonstrated that daee can enable the system to achieve an energy delay tradeoff and analyzed the feasibility of constructing virtual queues to assist the actual queue offloading tasks. finally simulation results show that daee performs well in minimizing energy consumption and maintaining low latency especially for dsci type tasks.", "Pub Date": "2022-12-15"}