{"Title": "Machine Learning Techniques Applied to the Development of a Fall Risk Index for Older Adults", "Doi": "10.1109/ACCESS.2023.3299489", "Authors": ["a. millet", "a. madrid", "j. m. alonso-weber", "l. rodr√≠guez-ma√±as", "r. p√©rez-rodr√°-guez"], "Key Words": ["fall risk prediction", "knowledge-based models", "older population", "frailty", "machine learning", "ehr datasets", "natural language processing"], "Abstract": "falls are a leading cause of unintentional trauma related deaths worldwide and a significant contributor to elderly dependence. to address this the goal of this project was to predict recurrent falls in the older population using machine learning techniques with the aim of reducing the number of falls and their consequences. to achieve this a dataset obtained from getafe university hospital‚äôs geriatric falls unit was used  obtained from the hospital‚äôs electronic health records . this extensive dataset was one the key strengths of our work. feature extraction was performed through natural language processing which recognized pre defined patterns and helped build the profiles of the 304 older adults who composed the dataset. the proposed data system was comprised of four main blocks  the senior‚äôs profile and environment clinical information and tests carried out in the hospital medications and different diseases they presented. using the extracted attributes and data from those 304 older adults this project compared the performance of various machine learning techniques in their ability to classify older adults between future fallers and non fallers. training different models and ensembles and comparing the results we obtained that bagging with random forest as base model is the best classifier predicting accurately 75.8% of the data with 70.0% sensitivity and 80.5% specificity. ultimately this research project aimed at setting the first stone to a larger study that could help monitoring older adults and obtaining dynamic and automatic predictions of falls.", "Pub Date": "2023-08-16"}