{"Title": "Machine Learning for Fake News Detection on Social Media Text", "Doi": "10.1109/ICAICCIT60255.2023.10465880", "Authors": ["a. bhogi", "a. dasari", "n. sharma", "n. garg"], "Key Words": ["natural language processing (nlp)", "passive aggressive classifier (pac)", "decision tree (dt)", "logistic regression (lr)", "and random forest (rf)"], "Abstract": "in today digital age the swift spreading of information has revolutionized the way for news consumers and makes them informed. however this convenience comes with a downside ‚äì the propagation of fake news which can spread misinformation manipulate public opinions and undermine the credibility of legitimate sources. the term \"fake news\" refers to intentionally fabricated or misleading information that is frequently presented as news for a variety of cognitive processes including commercial social or political gain. machine learning  ml  with its ability to analyze large datasets and discern patterns has emerged as a promising solution for tackling the issue of fake news. by leveraging techniques such as natural language processing  nlp  classification algorithms and anomaly detection ml models can be trained to identify and differentiate between authentic news and fake news. that in turn prevents the news consumer from misleading prevent a product or service from defame and also helps in political defaming. machine learning algorithms can be used to analyze historical data and make accurate predictions about whether news fakes or not. in this study the proposed machine learning based news analysis model utilizes feature selection technique to categorize the news. the model explores different classification algorithms including decision tree  dt  passive aggressive classifier  pac  logistic regression  lr  and random forest  rf  to build the fake news prediction model. the experimental results show that the passive aggressive classifier outperforms other models with an accuracy rate of 93%. the proposed model can help news channels  social media and consumers to distinguish between fake and real news and minimize the risk of misleading.", "Pub Date": "2024-03-20"}