{"Title": "Machine Learning in Chaos-Based Encryption: Theory, Implementations, and Applications", "Authors": ["j. hwang", "g. kale", "p. p. patel", "r. vishwakarma", "m. aliasgari", "a. hedayatipour", "a. rezaei", "h. sayadi"], "Pub Date": "2023-11-14", "Abstract": "chaos based encryption is a promising approach to secure communication due to its complexity and unpredictability. however various challenges lie in the design and implementation of efficient low power attack resistant chaos based encryption schemes with high encryption and decryption rates. in addition machine learning  ml  has emerged as a promising tool for enhancing the growing security and efficiency concerns and maximizing the potential of emerging computing platforms across diverse domains. with the rapid advancements in technology and the increasing complexity of computing systems ml offers a unique approach to addressing security challenges and optimizing performance. this paper presents a comprehensive study on the application of ml techniques to secure chaotic communication for wearable devices with an emphasis on chaos based encryption. the theoretical foundations of ml for secure chaotic communication are discussed including the use of ml algorithms for signal synchronization noise reduction and encryption. various ml algorithms such as deep neural networks support vector machines decision trees and ensemble learning methods are explored for designing chaos based encryption algorithms. this paper places a greater emphasis on methodological aspects metrics and performance evaluation of machine learning algorithms. in addition the paper presents an in depth investigation into state of the art ml assisted defense and attacks on chaos based encryption schemes covering their theoretical foundations and practical implementations. furthermore a review of the potential advantages and limitations associated with the utilization of ml techniques in secure communication systems and encryption is provided. the study extends to exploring the diverse range of applications that can benefit from ml assisted encryption such as secure communication in the internet of things  iots  cloud computing and wireless networks. overall we provide insights into the applications of ml for secure chaotic communication in wearable devices its challenges and opportunities offering a foundation for further research and development and facilitating advancements in the field of secure chaotic communication.", "Doi": "10.1109/ACCESS.2023.3331320", "Key Words": ["quantum computing", "quantum-safe", "chaos", "chaotic map", "encryption", "side channel attacks", "machine learning", "artificial intelligence", "hardware security"]}