{"Title": "Machine-Learning-Based Qubit Allocation for Error Reduction in Quantum Circuits", "Authors": ["t. lecompte", "f. qi", "x. yuan", "n. -f. tzeng", "m. h. najafi", "l. peng"], "Pub Date": "2023-09-14", "Abstract": "quantum computing is a quickly growing field with great potential for future technology. quantum computers in the current noisy intermediate scale quantum  nisq  era face two major limitations 1  qubit count and 2  error vulnerability. although quantum error correction methods exist they are not applicable to the current size of computers requiring thousands of qubits while current nisq systems have hundreds at most. it is therefore imperative to improve the reliability of the circuits as much as possible to make them robust to the errors that will occur. one common approach is to adjust the compilation process of a circuit to create a final circuit with improved reliability. however there are many decisions to be made when compiling that affect the final performance of the circuit two of the most critical ones being the mapping of logical to physical qubits  the qubit allocation problem  and the movement of qubits to satisfy two qubit gate adjacency requirements  the qubit routing problem . we focus on solving the qubit allocation problem and identifying initial layouts that reduce error. to identify these layouts we combine reinforcement learning with a graph neural network  gnn  based q network for analyzing both the connections and error rates of the graphlike backend of superconducting quantum computers to make mapping decisions creating a gnn assisted compilation  gnaqc  strategy. we provide both the circuit and the properties of the target backend as input to guide the decision making process. we work with the ibm qiskit applications programming interface to compile and simulate our quantum circuits. we train the architecture using a set of four backends and six circuits and find that gnaqc generally outperforms preexisting qubit allocation algorithms increasing final relative output fidelity by roughly 12.7%.", "Doi": "10.1109/TQE.2023.3301899", "Key Words": ["fidelity", "graph neural networks (gnns)", "quantum compilation", "qubit allocation"]}