{"Title": "MadFed: Enhancing Federated Learning With Marginal-Data Model Fusion", "Doi": "10.1109/ACCESS.2023.3315654", "Authors": ["e. seo", "e. elmroth"], "Key Words": ["federated learning", "edge computing", "data heterogeneity", "data-driven approaches", "label set augmentation", "data skewness"], "Abstract": "as the demand for intelligent applications at the network edge grows so does the need for effective federated learning  fl  techniques. however fl often relies on non identically and non independently distributed local datasets across end devices which could result in considerable performance degradation. prior solutions such as model driven approaches based on knowledge distillation meta learning and transfer learning have provided some reprieve. however their performance suffers under heterogeneous local datasets and highly skewed data distributions. to address these challenges this study introduces the marginal data fusion federated learning  madfed  approach a groundbreaking fusion of model  and data driven methodologies. by utilizing marginal data madfed mitigates data distribution skewness improves the maximum achievable accuracy and reduces communication costs. furthermore the study demonstrates that the fusion of marginal data can significantly improve performance even with minimal data entries such as a single entry. for instance it provides up to a 15.4% accuracy increase and 70.4% communication cost savings when combined with established model driven methodologies. conversely relying solely on these model driven methodologies can result in poor performance especially with highly skewed datasets. significantly madfed extends its effectiveness across various fl algorithms and offers a unique method to augment label sets of end devices thereby enhancing the utility and applicability of federated learning in real world scenarios. the proposed approach is not only efficient but also adaptable and versatile promising broader application and potential for widespread adoption in the field.", "Pub Date": "2023-09-26"}