{"Title": "MADRL-Based Joint Edge Caching and Bitrate Selection for Multicategory 360¬∞ Video Streaming", "Doi": "10.1109/JIOT.2023.3287187", "Authors": ["j. zeng", "x. zhou", "k. li"], "Key Words": ["bitrate selection", "edge caching", "multiagent deep reinforcement learning (madrl)", "multicategory 360¬∞ video streaming", "quality of experience (qoe)"], "Abstract": "360¬∞ video streaming has gained increasing attraction in the current popular virtual reality ar and mr applications which can provide users with an immersive experience. in tile based 360¬∞ video streaming edge caching and bitrate selection strategies are jointly designed to improve users‚äô quality of experience  qoe  which incorporates video quality and rebuffer. however the existing qoe driven approaches use a unified qoe function to guide the decisions of edge caching and bitrate selection which neglect the impact of video quality and rebuffer on different categories of 360¬∞ videos thus failing to provide high average qoe for users. in this article we propose a multiagent deep reinforcement learning based joint edge caching and bitrate selection strategy for multicategory 360¬∞ video streaming to improve users‚äô average qoe. the key idea is to employ different edge caching and bitrate selection strategies for different video categories to enable fine grained performance optimization. based on multicategory 360¬∞ video streaming we first model a joint edge caching and bitrate selection problem as a multiagent cooperative markov decision process with the goal of maximizing users‚äô average qoe. next an field of view aware multiagent soft actor‚äìcritic  fa masac  algorithm is designed to help agents collaboratively learn optimal edge caching and bitrate selection decisions in a distributed way in which each video category is treated as an agent. finally experimental results on real world data sets show that our proposed strategy can greatly benefit users‚äô average qoe compared to existing strategies.", "Pub Date": "2023-12-27"}