{"Title": "Mapping Climate Themes From 2008-2021‚ÄîAn Analysis of Business News Using Topic Models", "Doi": "10.1109/ACCESS.2023.3256530", "Authors": ["s. umamaheswaran", "v. dar", "e. sharma", "j. s. kurian"], "Key Words": ["climate change", "media", "topic models", "nlp", "computational social sciences", "experiment"], "Abstract": "india and other developing economies are receiving more attention in the context of climate change due to their rapid rates of economic expansion and large populations. in terms of absolute emissions india surpassed china and the u.s. in 2018 to become the third largest emitter. solving this wicked problem calls for climate action across the stakeholder spectrum involving governments business communities and citizens. while extant literature has focused significantly on the role of governments and individual perceptions the business sector needs to be more represented. in this study we consider business news media as a platform that reflects the industry engagement in climate change and as a source of information on climate change for business decision makers. hence understanding the topic and themes in the nexus of climate and business is important to evaluate the business sector‚äôs stance towards climate change and how it has evolved. this work explores business news related to climate change using natural language techniques. we first experiment with three topic modeling techniques such as lda nmf and bertopic on the business news and two more benchmark news datasets. our test data is derived from digital news archives of ‚äôthe economic times‚äì india‚äôs leading business news daily. we evaluate the performance based on quantitative metrics commonly used for topic models. we choose the algorithm that provides the highest precision for climate specific information represented by the test dataset. we then apply the algorithm with the best performance as evaluated by the experiment to a large corpus of indian climate news from e.t. spanning from 2008  2021. we present how different themes including industry engagement evolved over the last two decades. the results suggest that climate cooperation has the highest contribution in the corpus with other themes on resource management energy and business gaining traction in recent years.", "Pub Date": "2023-03-21"}