{"Title": "Marine IoT Systems With Space‚ÄìAir‚ÄìSea Integrated Networks: Hybrid LEO and UAV Edge Computing", "Doi": "10.1109/JIOT.2023.3287196", "Authors": ["s. jung", "s. jeong", "j. kang", "j. kang"], "Key Words": ["edge computing", "internet of things (iot)", "low-earth orbit (leo) satellite", "marine networks", "successive convex approximation (sca)", "unmanned aerial vehicles (uavs)"], "Abstract": "marine internet of things  iot  systems have grown substantially with the development of nonterrestrial networks  ntns  via aerial and space vehicles in the upcoming sixth generation  6g  thereby assisting environment protection military reconnaissance and sea transportation. due to the unpredictable climate changes and the extreme channel conditions of maritime networks however it is challenging to efficiently and reliably collect and compute a huge amount of maritime data. in this article we propose a hybrid low earth orbit  leo  and unmanned aerial vehicle  uav  edge computing method in space‚äìair‚äìsea integrated networks for marine iot systems. specifically two types of edge servers mounted on uavs and leo satellites are endowed with computational capabilities for the real time utilization of a sizable data collected from ocean iot sensors. our system aims at minimizing the total energy consumption of the battery constrained uav by jointly optimizing the bit allocation of communication and computation along with the uav path planning under latency energy budget and operational constraints. for availability and practicality the proposed methods are developed for three different cases according to the accessibility of the leo satellite ‚äúalways on‚äù ‚äúalways off‚äù and ‚äúintermediate disconnected‚äù by leveraging successive convex approximation  sca  strategies. via numerical results we verify that significant energy savings can be accrued for all cases of leo accessibility by means of joint optimization of bit allocation and uav path planning compared to partial optimization schemes that design for only the bit allocation or trajectory of the uav.", "Pub Date": "2023-11-20"}