{"Title": "MEC-Assisted Real-Time Data Acquisition and Processing for UAV With General Missions", "Doi": "10.1109/TVT.2022.3203704", "Authors": ["y. zeng", "j. tang"], "Key Words": ["data acquisition", "data processing", "mobile edge computing", "trajectory optimization", "unmanned aerial vehicles"], "Abstract": "as a promising technology unmanned aerial vehicles  uavs  enabled information gathering has received intensive interest in both academia and industry in recent years. however the familiar paradigm namely data collection can hardly fulfill the active and real time information gathering demands of many thriving smart applications such as smart grid where the uav needs to serve as an intelligent aerial entity gathering and analysing the information of surroundings actively and timely. to this aim this article studies the paradigm data acquisition where the uav dynamically gathers information by on board sensors. we consider a general mission scenario where a uav acquires data in real time which needs to be timely processed with the assistance of a mobile edge computing server. to address the real time characteristics we construct a novel theoretical data acquisition rate model based on which the real time processing quality of requirement  qor  is defined. we respectively minimize the uav energy consumption and mission completion time under the constraints including real time processing qor and uav mobility by jointly optimizing the uav trajectory resources allocation and time duration. to tackle these highly complex problems we propose efficient algorithms by means of successive convex approximation and block coordinates descent techniques where a closed form solution for the uav transmission and computation resources allocation is rigorously derived. moreover we consider a practical multi location trajectory optimization where the uav needs to traverse multiple target locations or areas in addition to the initial and final locations. the simulation results demonstrate the significant system performance gains brought by the proposed design and the effectiveness of the algorithms.", "Pub Date": "2023-01-13"}