{"Title": "MESON: A Mobility-Aware Dependent Task Offloading Scheme for Urban Vehicular Edge Computing", "Doi": "10.1109/TMC.2023.3289611", "Authors": ["l. zhao", "e. zhang", "s. wan", "a. hawbani", "a. y. al-dubai", "g. min", "a. y. zomaya"], "Key Words": ["deep reinforcement learning (drl)", "mobile edge computing (mec)", "task offloading", "vehicular edge computing (vec)", "vehicular networks"], "Abstract": "vehicular edge computing  vec  is the transportation version of mobile edge computing  mec  in road scenarios. one key technology of vec is task offloading which allows vehicles to send their computation tasks to the surrounding roadside units  rsus  or other vehicles for execution thereby reducing computation delay and energy consumption. however the existing task offloading schemes still have various gaps and face challenges that should be addressed because vehicles with time varying trajectories need to process massive data with high complexity and diversity. in this paper a vec based computation offloading model is developed with consideration of data dependency of tasks. the minimization of the average response time and average energy consumption of the system is defined as a combinatorial optimization problem. to solve this problem we propose a mobility aware dependent task offloading  meson  scheme for urban vec and develop a drl based algorithm to train the offloading strategy. to improve the training efficiency a vehicle mobility detection algorithm is further designed to detect the communication time between vehicles and rsus. in this way meson can avoid unreasonable decisions by lowering the size of the action space. moreover to improve the system stability and the offloading successful rate we design a task priority determination scheme to prioritize the tasks in the waiting queue. the experimental results show that meson is superior compared to other task offloading schemes in terms of the average response time average system energy consumption and offloading successful rate.", "Pub Date": "2024-04-04"}