{"Title": "MetaVSID: A Robust Meta-Reinforced Learning Approach for VSI-DDoS Detection on the Edge", "Doi": "10.1109/TNSM.2022.3200924", "Authors": ["x. -s. vu", "m. ma", "m. bhuyan"], "Key Words": ["meta-reinforcement learning", "vsi-ddos", "edge cloud", "covariate shift", "downsampling"], "Abstract": "the explosive growth of end devices that generate massive amounts of data requires close proximity computing resources for processing at the network‚äôs edge. having geographic distributions and limited resources of edge nodes or servers opens several doors for attackers to exploit them primarily to the detriment of deployed services  one of the recent attacks is very short intermittent distributed denial of services  vsi ddos . deep learning based models have been developed to detect and mitigate such attacks but cause the degrading quality of models due to covariate shifts when deployed in real world environments. therefore we propose a new approach called metavsid to detect vsi ddos attacks in edge clouds using meta reinforcement learning followed by ensemble learning to increase the robustness of the model in detecting vsi ddos attacks early. the proposed model can capture dynamic patterns of vsi ddos attacks from which it identifies manipulated services and increase service availability when covariate shifts at deployment time. we carry out extensive experiments to validate the metavsid using both testbed and benchmark datasets. via the meta reinforced downsampling process the proposed method improves sample efficiency leading to cost effective policies. moreover the optimized policies are generalized to adapt to dynamic changes in the training distribution. our experimental results demonstrate that metavsid stably achieves better performance in multiple evaluation settings with the difference from baseline models from 1.5% to 7.5% in terms of auc for both vsi ddos and ddos detection especially under covariate shift settings.", "Pub Date": "2023-06-29"}