{"Title": "MetaEmotionNet: Spatial‚ÄìSpectral‚ÄìTemporal-Based Attention 3-D Dense Network With Meta-Learning for EEG Emotion Recognition", "Authors": ["x. ning", "j. wang", "y. lin", "x. cai", "h. chen", "h. gou", "x. li", "z. jia"], "Pub Date": "2023-12-22", "Abstract": "emotion recognition has become an important area in affective computing. emotion recognition based on multichannel electroencephalogram  eeg  signals has gradually become popular in recent years. however on one hand how to make full use of different eeg features and the discriminative local patterns among the features for various emotions is challenging. existing methods ignore the complementarity among the spatial‚äìspectral‚äìtemporal features and discriminative local patterns in all features which limits the classification performance. on the other hand when dealing with cross subject emotion recognition existing transfer learning  tl  methods need a lot of training data. at the same time it is extremely expensive and time consuming to collect the labeled eeg data which is not conducive to the wide application of emotion recognition models for new subjects. to solve the above challenges we propose a novel spatial‚äìspectral‚äìtemporal based attention 3 d dense network  sst net  with meta learning named metaemotionnet for emotion recognition. specifically metaemotionnet integrates the spatial‚äìspectral‚äìtemporal features simultaneously in a unified network framework through two stream fusion. at the same time the 3 d attention mechanism can adaptively explore discriminative local patterns. in addition a meta learning algorithm is applied to reduce dependence on training data. experiments demonstrate that the metaemotionnet is superior to the baseline models on two benchmark datasets.", "Doi": "10.1109/TIM.2023.3338676", "Key Words": ["affective computing", "attention mechanism", "electroencephalogram (eeg)", "emotion recognition", "meta-learning"]}