{"Title": "Methodological Support of Methods for Converting the Interface Structure Model into UML Visual Models of the UML Diagram", "Doi": "10.1109/R10-HTC57504.2023.10461934", "Authors": ["y. lipko", "a. sviridov", "s. belikova", "m. kucherova"], "Key Words": ["technical system design", "interface model", "interface structure", "logic of working with a technical system", "project communication"], "Abstract": "specialists in the field of engineering systems design conduct a large number of studies related to the problem of communication of participants in the development process  designers developers and domain experts  while in practice the final system acts as the object of design and not the models of the informatization object   this leads to the problem of a ‚äúgap in expectations‚äù of the user. the problem arises due to the fact that the programmatically implemented interface is the result of the subjective perception of designers and developers about the scenarios required for the user to use technical systems which is at odds with the logic of the system which is the rules for the use of a technical system to solve professional user tasks. the emerging informational or semantic gap is associated with the difference in competencies and priorities of specialists involved in the process of creating technical systems and increases even more with increasing complexity of the systems being developed and accordingly the involvement of more specialists. the proposed research is aimed at reducing labor costs for the design of technical systems by increasing the conceptual integrity of the design results as well as reducing the semantic gap by focusing attention not on the technical system project but on the automation object by involving the system user  domain expert  to form an idea of how the developed technical system will be used for professional tasks and the creation of methodological support for the extraction of expert knowledge and the formation of a model of the interface structure. to ensure the conceptual integrity of the design solution at all stages of the development lifecycle the paper proposes a methodological basis for converting the user representation in the form of an interface structure model developed in into visual models of the uml diagram which will allow to obtain unified representations reflecting various aspects of the description and application of technical systems.", "Pub Date": "2024-03-19"}