{"Title": "MicrosMobiNet: A Deep Lightweight Network With Hierarchical Feature Fusion Scheme for Microscopy Image Analysis in Mobile-Edge Computing", "Doi": "10.1109/JIOT.2023.3317878", "Authors": ["s. biswas", "s. barma"], "Key Words": ["bright-field microscopy image", "depth-wise separable (dws) convolution", "hierarchical feature fusion (hff)", "lightweight deep architecture", "mobile-edge computing"], "Abstract": "in recent advancements of lightweight deep architectures for edge devices most of the works follow a typical mobilenet pipeline designed for computer vision tasks which is not very appropriate for microscopy image analysis. certainly the design of the dedicated lightweight network for highly complex microscopy image analysis has not been attempted so far. therefore this work proposes a new deep lightweight network ‚äúmicrosmobinet‚äù having multiscale feature extraction mechanism for bright field microscopy image analysis on a mobile edge computing framework. it consists of three key attributes‚äîdepth wise separable convolution for making the network lightweight multiple kernels with hierarchical feature fusion to extract complex features and residual connection to keep network deep. experimental validations have been conducted by two different microscopy image data sets‚äîplant  potato tuber  and histopathology  cancer cell  generated by two different image generation modalities. in the experiment multiclass and multilabel classification tasks have been evaluated by measuring accuracy f1 score and error. in the ablation study the key attributes of the network have been verified. the results and analysis show that the microsmobinet can achieve classification accuracy up to 98.43% and 96.25% for plant and cancer cells with minimum error 8.38% and 10.03% respectively. in a comparative study the microsmobinet outperforms the existing lightweight state of the art methods with fewer parameters  1.9m  and flops count  42m . finally the new network has been implemented on an edge device smartphone  android platform  which is working satisfactorily with high speed  140 ms  and very low memory  7.4 mb . hence the network exhibits its superiority in bright field microscopy image analysis on mobile edge computing platforms in a lightweight deep learning framework.", "Pub Date": "2024-02-21"}