{"Title": "Minimizing Age of Usage Information for Capturing Freshness and Usability of Correlated Data in Edge Computing Enabled IoT Systems", "Doi": "10.1109/TMC.2023.3312130", "Authors": ["x. xie", "h. wang"], "Key Words": ["age of information", "internet of things", "scheduling", "usability", "correlated information", "reinforcement learning"], "Abstract": "age of information  aoi  is a popular metric of data freshness however it neglects the usability of data. in light of this we introduce a new metric age of usage information  aoui  which can jointly capture the freshness and usability of correlated data in the internet of things in a fine grained manner. based on the proposed metric we investigate the optimization problem of minimizing average aoui where the correlated nodes transmit data to the destination via noisy channels. to seek the optimal data scheduling policy we first develop a virtual queue based  vq  policy under the assumption that the priori knowledge of the channel state is known. then considering the case where the channel state is unknown we utilize the model free characteristic of double deep q network  ddqn  to design an improved exploration based ddqn  ie ddqn  policy which does not require a priori knowledge of the channel state. furthermore we investigate the development of joint data scheduling and usage policy and introduce decoupled action branches to improve the structure of the neural network of ddqn proposing a decoupling action based ddqn  da ddqn  policy. simulation results show that the proposed vq ie ddqn and da ddqn policies all exhibit superior performance compared to baseline algorithms such as the classical ddqn method and the greedy policy of scheduling the node with the largest product of aoui and usable factor which may be due to the consideration of the stability of the virtual queue the improvement of the exploration process and the reconstruction of the neural network structure respectively.", "Pub Date": "2024-04-04"}