{"Title": "Min‚ÄìMax Latency Optimization for IRS-Aided Cell-Free Mobile Edge Computing Systems", "Doi": "10.1109/JIOT.2023.3322751", "Authors": ["n. li", "w. hao", "f. zhou", "z. chu", "s. yang", "o. muta", "h. gacanin"], "Key Words": ["cell-free network", "intelligent reflecting surface (irs)", "min‚äìmax latency", "mobile edge computing (mec)"], "Abstract": "mobile edge computing  mec  is expected to provide low latency computation service for wireless devices  wds . however when wds are located at cell edge or communication links between base stations  bss  and wds are blocked the offloading latency will be large. to address this issue we propose an intelligent reflecting surface  irs  assisted cell free mec system consisting of multiple bss and irss for improving the transmission environment. consequently we formulate a min‚äìmax latency optimization problem by jointly designing multiuser detection  mud  matrices irss‚äô reflecting beamforming vectors wds‚äô offloading data size and edge computing resource subject to constraints on edge computing capability and irss phase shifts. to solve it an alternating optimization algorithm based on the block coordinate descent  bcd  technique is proposed in which the original nonconvex problem is decoupled into two subproblems for alternately optimizing computing and communication parameters. in particular we optimize the mud matrix based on the second order cone programming  socp  technique and then develop two efficient algorithms to optimize irss‚äô reflecting vectors based on the semi definite relaxation  sdr  and successive convex approximation  sca  techniques respectively. numerical results show that employing irss in cell free mec systems outperforms conventional mec systems resulting in up to about 60% latency reduction can be attained. moreover numerical results confirm that our proposed algorithms enjoy a fast convergence which is beneficial for practical implementation.", "Pub Date": "2024-02-21"}