{"Title": "MLM-WR: A Swarm-Intelligence-Based Cloud‚ÄìEdge‚ÄìTerminal Collaboration Data Collection Scheme in the Era of AIoT", "Doi": "10.1109/JIOT.2023.3309959", "Authors": ["j. lu", "z. qu", "a. liu", "s. zhang", "n. n. xiong"], "Key Words": ["artificial intelligence of things (aiot)", "cloud‚äìedge‚äìterminal collaboration", "sensing difference discovery", "swarm intelligence", "task assignment", "truthful workers discovery"], "Abstract": "mobile crowd sensing  mcs  is a cloud‚äìedge‚äìterminal collaboration model that relies on edge terminal devices or ‚äúworkers‚äù to sense data and build applications for cloud hosted platforms. however to ensure high quality application development recruiting truthful workers in the edge network is crucial. with the emergence of artificial intelligence  artificial intelliegence  the internet of things  iot  is entering a new era known as artificial intelliegence of things  aiot . this article proposes an artificial intelliegence enabled mcs system which includes mlm wr a cloud‚äìedge‚äìterminal collaboration data collection scheme for aiot. mlm wr leverages swarm intelligence to match truthful workers with sensing tasks enabling efficient and effective data collection for aiot applications. the matching theory is applied from two perspectives  1  truthful workers discovery and 2  sensing difference discovery. to identify truthful workers we adjust their credibility based on the deviation of their sensing data with ground truth data  gtd  obtained through collaboration with the unmanned aerial vehicle  uav . in the sensing difference discovery we obtain workers‚äô sensing attribute reliability by calculating attribute data errors and incorporate absolute and relative sensing location preferences to determine workers‚äô sensing quality at different locations. additionally mlm wr employs the particle swarm optimization  pso  algorithm to assign workers while considering sensing attribute and location reliability and recruitment cost thus addressing the tradeoff between recruitment cost and data quality. the effectiveness of our approach is demonstrated through extensive evaluations where mlm wr outperformed the state of the art approaches.", "Pub Date": "2023-12-27"}