{"Title": "MLPKV: A Local Differential Multi-Layer Private Key-Value Data Collection Scheme for Edge Computing Environments", "Doi": "10.1109/TIFS.2023.3256124", "Authors": ["x. xu", "z. fan", "m. trovati", "f. palmieri"], "Key Words": ["local differential privacy", "key-value data collection", "multi-layer networks", "edge computing"], "Abstract": "the existing solutions related to local differential privacy  ldp  in multi layer networks for edge computing scenarios present several limitations in both key value data heavy hitter identification and related frequency and mean estimation tasks. first existing ldp approaches cannot effectively use edge nodes to improve their utility performance. secondly there are many network transmission tasks in edge computing which have relatively high requirements for communication and storage costs. furthermore the traditional privacy budget allocation cannot attain the best utilization. to solve the above problems we propose mlpkv a local differential multi layer private key value data collection scheme for edge computing structured into three phases  dimensional reduction padding length estimation and estimation. an improved ec olh algorithm is used to offload the computing efforts related to aggregation and estimation to edge nodes for achieving greater efficiency. in the dimensional reduction phase a candidate set is generated to prune the domain of original data which improves the estimation. in addition our method groups users for completing the tasks in each phase to avoid additional errors caused by dividing the privacy budget and proposes a new user division with an optimal grouping ratio. finally the proposed method was implemented in a proof of concept prototype system. we compare mlpkv with baseline methods such as privkv and pckv. experimental results on both synthetic and real world datasets show that our method achieves better utility for heavy hitter identification frequency and mean estimations than other state of the art mechanisms. for small data sets our approach also provides high accuracy estimation with a low privacy budget.", "Pub Date": "2023-03-21"}