{"Title": "Mobile Edge-Based Information-Centric Network for Emergency Messages Dissemination in Internet of Vehicles: A Deep Learning Approach", "Doi": "10.1109/ACCESS.2023.3288420", "Authors": ["s. rizwan", "g. husnain", "f. aadil", "f. ali", "s. lim"], "Key Words": ["artificial neural network", "deep learning", "internet of vehicles", "internet of things", "information-centric networking", "mobile edge computing"], "Abstract": "with the rapid advancement of internet of things  iot  communication technologies the internet of vehicles  iov  has gained significant attention for providing the real time exchange of emergency traffic information among vehicles and road side units  rsu  to improve ultimate driving experiences and road safety. information centric networking  icn  has emerged as a novel networking architecture that shifts the communication model from internet protocol  ip  based host centric to content centric architecture. icn provides support to push and pull based messages for efficient content dissemination and retrieval by aiming at content names rather than ip addresses. the mobile edge computing  mec  paradigm facilitates proximity based real time traffic applications and services reducing the content retrieval latency from the core network without the excessive broadcast overhead. deep learning  dl  techniques have been tremendously successful in detecting the severity of real time traffic data. the integration of dl based ann model for edge based icn iov brings real time traffic prediction content caching and forwarding of push based messages closer to the target area. furthermore the deployment of mobile edge servers at critical network positions enhances the availability and responsiveness of the name based content in the icn paradigm. in this paper we propose mobile edge based emergency messages dissemination scheme  memds  to deliver push based messages delivery at the event reported geographical location. we also propose a hybrid dl based artificial neural network  ann  and memds model to detect and predict the severity of the safety application under real traces from different cities based on specific parameters. the simulation results demonstrate that the proposed scheme significantly improves the data delivery ratio average delay hop count content retrieval delay and network overhead than dcn and flooding techniques. secondly the proposed hybrid model successfully detects the severity of the request with the highest accuracy precision recall and f1 scores values of 96% than benchmark models using real time vehicular datasets.", "Pub Date": "2023-06-27"}