{"Title": "Mobility-Aware Cooperative Caching in Vehicular Edge Computing Based on Asynchronous Federated and Deep Reinforcement Learning", "Doi": "10.1109/JSTSP.2022.3221271", "Authors": ["q. wu", "y. zhao", "q. fan", "p. fan", "j. wang", "c. zhang"], "Key Words": ["asynchronous federated learning", "cooperative caching", "deep reinforcement learning", "vec"], "Abstract": "vehicular edge computing  vec  can learn and cache most popular contents for vehicular users  vus  in the roadside units  rsus  to support real time vehicular applications. federated learning  fl  can protect vus' privacy by sharing vehicles' local models instead of data. in traditional fl the global model is periodically updated by aggregating all vehicles' local models. however vehicles may frequently drive out of the coverage area of vec before they finish the local model training and thus the traditional fl cannot upload all local models as expected which would degrade the accuracy of global model. the asynchronous fl can be performed without aggregating all vehicles' local models thus more local models can be uploaded to improve the accuracy of global model. the vehicle mobility significantly impacts the asynchronous fl. there is no published work considering the vehicle mobility to design the cooperative caching in vec based on asynchronous fl. in addition the caching capacity of rsu is limited and the size of the predicted popular contents usually exceeds the cache capacity of rsu. hence vec should cache the predicted popular contents in different rsus while considering content transmission delay. in this paper we consider vehicle mobility and propose a cooperative caching scheme in the vec based on asynchronous federated and deep reinforcement learning  cafr  to predict popular contents and further obtain the optimal cooperative caching location for the predicted popular contents. extensive experimental results have demonstrated that cafr scheme outperforms other baseline caching schemes.", "Pub Date": "2023-02-22"}