{"Title": "Mobility-Aware Multi-Hop Task Offloading for Autonomous Driving in Vehicular Edge Computing and Networks", "Doi": "10.1109/TITS.2022.3142566", "Authors": ["l. liu", "m. zhao", "m. yu", "m. a. jan", "d. lan", "a. taherkordi"], "Key Words": ["vehicular edge computing", "task offloading", "multi-hop", "mobility", "connectivity"], "Abstract": "vehicular edge computing  vec  has gained increasing interest due to its potential to provide low latency and reduce the load in backhaul networks. in order to meet drastically increasing computation demands from emerging ever growing vehicular applications e.g. autonomous driving abundant computation resources of individual vehicles can play a crucial role in task execution in a vec scenario that can further contribute in considerably improving user experience. this is however an extremely challenging task due to high mobility of vehicles that can easily lead to intermittent connectivity thereby disrupting on going task processing. in this paper we propose a task offloading scheme by exploiting multi hop vehicle computation resources in vec based on mobility analysis of vehicles. in addition to the vehicles within one hop from the task vehicle that generates computation tasks certain multi hop vehicles that meet the given requirements in terms of link connectivity and computation capacity are also leveraged to carry out the tasks offloaded by the task vehicle. an optimization problem is formulated for the task vehicle to minimize the weighted sum of execution time and computation cost of all tasks. a semidefinite relaxation approach with an adaptive adjustment procedure is proposed to solve the formulated optimization problem for obtaining the corresponding offloading decisions. the simulation results show that our proposed offloading scheme can achieve significant improvement in terms of response delay by at least 34% compared with the other algorithms  e.g. local processing and random offloading .", "Pub Date": "2023-02-08"}