{"Title": "Modelling Reoccurrence of Events in an Event-Based Graph Database for Asset Management", "Doi": "10.1109/AiDAS60501.2023.10284664", "Authors": ["m. syafiq", "s. azri", "u. ujang"], "Key Words": ["event-based database", "graph database", "graph temporal data model", "asset management", "arangodb"], "Abstract": "asset maintenance is a crucial stage in the asset life cycle to ensure that assets can operate with maximum efficiency. managing historical information on asset maintenance is critical to predict asset condition and performance. furthermore any asset may undergo a maintenance event multiple times necessitating a proper method to model the reoccurrence of an event. event based databases centred on graph database is a suitable approach to model assets with their maintenance history as they are built based on property graphs allowing flexible storing of multiple attributes. this paper proposed three temporal graph data models to address the problem of storing and modelling multiple interval timestamps for multiple events to support the reoccurrence of maintenance events in an asset management scenario. all data models are described by different relationships and are built on multigraphs grounded on graph theory to support many to many  m n  relationships. evaluation is carried out based on synthetic datasets to evaluate both approaches based on two objectives to evaluate the query performance of both approaches and to assess the ability to query the interval timestamp. we found that the second data model is efficient in querying small amounts of data  however the third data model is more efficient when querying large amounts of data a characteristic of big data. the time complexity of the query on both the second and third data models based on differing amounts of data are quadratic times o n2  corresponding to the nested iteration in the query algorithm. operations based on graph traversals on our second and third data models enable the query of interval timestamps of the events. the proposed data models provide the foundation for modelling multiple related entities for any event based data management based on graph databases and are not limited to asset management scenarios.", "Pub Date": "2023-10-23"}