{"Title": "Modeling of Intermittent Commutation Control of Static Frequency Converter of Pumped Storage Unit Based on PSCAD", "Doi": "10.1109/AEES59800.2023.10469391", "Authors": ["j. zhou", "y. li", "x. zhang", "d. zhang"], "Key Words": ["static frequency converter", "pumped storage", "c language", "pscad"], "Abstract": "static variable frequency starting is the main way to start large synchronous units in pumped storage power stations which has the advantages of stable starting process and fast response speed. static frequency converter  sfc  has become an important part of the frequency conversion start up of the pumping and storage unit. the establishment of electromagnetic transient simulation model is an important basis for the study of dynamic response characteristics such as static variable frequency start up fault characteristics and protection methods of pumping and storage units. however most of the existing researches on the control strategy and simulation model for the conversion start up of the pumping and storage unit focus on the natural commutation process and the simulation of the intermittent commutation stage cannot be well realized. moreover there is no literature on the pscad simulation platform to build the simulation model of the static inverter of the pumping and storage unit. in this paper the control principle of static variable frequency start intermittent circulation process of pumped storage power station is fully studied the rotor starting angle is defined and the corresponding thyristor converter valve triggering sequence under different motor rotor positions is calculated. based on the pscad simulation platform a static variable frequency start up model of the pumping and storage unit is built and a subroutine module is written in c language to interact with pscad to realize thyristor trigger conduction in the intermittent commutation stage. the simulation verifies the correctness and effectiveness of the established model.", "Pub Date": "2024-03-21"}