{"Title": "MOOC-BERT: Automatically Identifying Learner Cognitive Presence From MOOC Discussion Data", "Doi": "10.1109/TLT.2023.3240715", "Authors": ["z. liu", "x. kong", "h. chen", "s. liu", "z. yang"], "Key Words": ["cognitive presence identification", "community of inquiry model", "mooc-bert", "online discussions", "pretrained language model", "text analysis"], "Abstract": "in a massive open online courses  moocs  learning environment it is essential to understand students' social knowledge constructs and critical thinking for instructors to design intervention strategies. the development of social knowledge constructs and critical thinking can be represented by cognitive presence which is a primary component of the community of inquiry model. however identifying learners‚äô cognitive presence is a challenging problem and most researchers have performed this task using traditional machine learning methods that require both manual feature construction and adequate labeled data. in this article we present a novel variant of the bidirectional encoder representations from transformers  bert  model for cognitive presence identification namely mooc bert which is pretrained on large scale unlabeled discussion data collected from various moocs involving different disciplines. mooc bert learned deep representations of unlabeled data and adopted chinese characters as inputs without any feature engineering. the experimental results showed that mooc bert outperformed the representative machine learning algorithms and deep learning models in the performance of identification and cross course generalization. then mooc bert was adopted to identify the unlabeled posts of the two courses. the empirical analysis results revealed the evolution and differences in mooc learners‚äô cognitive presence levels. these findings provide valuable insights into the effectiveness of pretraining on large scale and multidiscipline discussion data in facilitating accurate cognitive presence identification demonstrating the practical value of mooc bert in learning analytics.", "Pub Date": "2023-08-15"}