{"Title": "MotiShare: Incentive Mechanisms for Content Providers in Heterogeneous Time-Varying Edge Content Market", "Doi": "10.1109/TSC.2021.3124419", "Authors": ["q. wang", "s. guo", "j. liu", "c. pan", "l. yang"], "Key Words": ["incentive mechanisms", "edge content market", "stackelberg game", "reinforcement learning"], "Abstract": "with the development of edge computing and sharing economy more services and contents are decentralized to the edge of the network. at present most existing studies combine the content caching with service offloading mechanisms from the perspective of edge services to optimize network performance. however few studies focus on what strategies the content providers  cps  can implement to maximize their utilities. in order to motivate content providers to be more willing to share their contents it is necessary to study the incentive mechanisms in the edge content market so that content audiences  cas  can pay reasonable prices for high quality contents. in this article we first characterize the content supply and demand model the cps‚äô cost and utilities in edge content market by considering both the time sensitivity of edge content and the heterogeneity of cas. furthermore according to the edge content market environment characteristics we divide the edge content market into a monopoly environment where the content is only provided by a certain cp and an open environment where content services are provided by multiple cps. in the monopoly environment we establish a two stage stackelberg game to design the incentive mechanism. in the open environment also we formulate the competitive behavior among cps as a stochastic game. since the cps are not aware of each other strategies and environmental uncertainty the reinforcement learning based algorithm  rlimo  is used to derive the pricing strategy of cp. finally numerical results show that the proposed incentive mechanisms are reliable and effective.", "Pub Date": "2023-02-06"}