{"Title": "MSleepNet: A Semi-Supervision-Based Multiview Hybrid Neural Network for Simultaneous Sleep Arousal and Sleep Stage Detection", "Authors": ["h. liu", "h. zhang", "b. li", "x. yu", "y. zhang", "t. penzel"], "Pub Date": "2024-01-25", "Abstract": "the complexity of sleep disorder diagnosis continuously increases the clinical requirement for simultaneous measurement of sleep arousal and sleep stage which however has not received enough attention from engineering scholars. to the best of our knowledge all previous machine learning based detection methods use the single view mechanism to identify either sleep arousal or sleep stage. in this article a multiview hybrid neural network with semi supervised learning  ssl  named as msleepnet is proposed for simultaneous sleep arousal and sleep stage detection. in particular the features of single channel electroencephalography  eeg  signal from both the time domain and frequency domain are extracted by the improved residual backbone network. then an attention mechanism is introduced to enhance the feature recognition ability in the frequency domain. a multitask classification loss function is also designed to synchronously consider the correlation between sleep arousal and sleep stage. in the classification part of the network the supervised loss and semi supervised loss for each task are effectively combined to alleviate the data imbalance problem and improve the classification accuracy. overnight polysomnographic recordings from two public datasets  sleep heart health study  shhs   $n=200$  and physio2018  $n=100$   and one dataset from a local clinic   $n=60$   were applied to validate msleepnet. experimental results on physio2018 dataset demonstrate that msleepnet achieves an overall accuracy of 0.78 and  $f1$  score of 0.73 for sleep staging and area under the precision recall curve  auprc  of 0.39 and an area under the receiver operating characteristic curve  auroc  of 0.75 for sleep arousal detection. therefore msleepnet framework based on multiview hybrid neural network has shown its potential in intelligent sleep monitory for synchronizing sleep arousal and sleep stage measurement with only very limited labeled data.", "Doi": "10.1109/TIM.2023.3348898", "Key Words": ["multitask learning (mtl)", "multiview learning", "semi-supervised learning (ssl)", "sleep arousal", "sleep staging"]}