{"Title": "Multi-Microservice Migration Modeling, Comparison, and Potential in 5G/6G Mobile Edge Computing: A Non-Average Parameter Values Approach", "Doi": "10.1109/ACCESS.2023.3342190", "Authors": ["a. rezazadeh", "h. lutfiyya"], "Key Words": ["downtime model", "migration model", "migrror", "service continuity", "service availability", "microservices", "heterogeneous multiple containers", "multi-access/mobile edge computing (mec)", "fog computing", "live migration"], "Abstract": "cloud fog and edge computing integration with future mobile internet of things  iot  devices and related applications in 5g/6g networks will become more practical in the coming years. containers became the de facto virtualization technique that replaced virtual memory  vm . mobile iot applications e.g. intelligent transportation and augmented reality incorporating fog edge have increased the demand for a millisecond scale response and processing time. edge computing reduces remote network traffic and latency. these services must run on edge nodes that are physically close to devices. however classical migration techniques may not meet the requirements of future mission critical iot applications. iot mobile devices have limited resources for running multiple services and client server latency worsens when fog edge services must migrate to maintain proximity in light of device mobility. this study analyzes the performance of the migrror migration method and the pre copy live migration method when the migration of heterogeneous multiple vms containers is considered. this paper presents mathematical models for the stated methods and provides migration guidelines and comparisons for services to be implemented as multiple containers as in microservice based environments. experiments demonstrate that migrror outperforms the pre copy technique and unlike conventional live migrations can maintain less than 10 milliseconds of downtime and reduce migration time with a minimal bandwidth overhead. the results show that migrror can improve service continuity and availability for users. most significant is that the model can use average and non average values for different parameters during migration to achieve improved and more accurate results while other research typically only uses average values. this paper shows that using only average parameter values in migration can lead to inaccurate results.", "Pub Date": "2023-12-19"}