{"Title": "Multicore Federated Learning for Mobile-Edge Computing Platforms", "Doi": "10.1109/JIOT.2022.3224239", "Authors": ["y. bai", "l. chen", "j. li", "j. wu", "p. zhou", "z. xu", "j. xu"], "Key Words": ["client scheduling", "federated learning (fl)", "mobile-edge computing (mec)"], "Abstract": "with increasingly strict data privacy regulations federated learning  fl  has become one of the most often heard machine learning techniques due to its privacy preserving trait. to efficiently implement the fl intelligence researchers recently resort to a newly emerged computing paradigm mobile edge computing  mec  and bring about a burst of works. however most existing works neglect practical issues in mec systems e.g. device heterogeneity unstable channel conditions and unknown user mobility. any of them if not handled properly can cause fatal failures to fl. this article proposed a novel fl framework called multicore fl  mc fl  to help fl intelligence land successfully on realistic mec systems. a distinct feature of mc fl is maintaining and training multiple global models  gms  that exhibit different tradeoffs between learning performances and computational complexity. while this modification seems simple it can effectively handle the device heterogeneity and device status variations and improve the compatibility and robustness of fl. furthermore mc fl employs a partial client participation scheme that allows participating clients to vary across time. this enables mc fl to function under uncertain mobile environments. we rigorously prove the convergence of the designed mc fl framework. in particular we propose an online client scheduling scheme for mc fl to judiciously schedule clients for training multiple gms in a manner that minimizes the completion time of mc fl. we also provide a service provisioning scenario with mc fl to show how service subscribers could benefit from multiple gms and improve their quality of experience  qoe . we evaluate our method on real world data sets and the results show that mc fl outperforms state of the art benchmarks.", "Pub Date": "2023-03-23"}