{"Title": "Multi-Tier GPU Virtualization for Deep Learning in Cloud-Edge Systems", "Doi": "10.1109/TPDS.2023.3274957", "Authors": ["j. kennedy", "v. sharma", "b. varghese", "c. rea√±o"], "Key Words": ["accelerators", "containers", "edge computing", "migration", "virtualization"], "Abstract": "accelerator virtualization offers several advantages in the context of cloud edge computing. relatively weak user devices can enhance performance when running workloads by accessing virtualized accelerators available on other resources in the cloud edge continuum. however cloud edge systems are heterogeneous often leading to compatibility issues arising from various hardware and software stacks present in the system. one mechanism to alleviate this issue is using containers for deploying workloads. containers isolate applications and their dependencies and store them as images that can run on any device. in addition user devices may move during the course of application execution and thus mechanisms such as container migration are required to move running workloads from one resource to another in the network. furthermore an optimal destination will need to be determined when migrating between virtual accelerators. scheduling and placement strategies are incorporated to choose the best possible location depending on the workload requirements. this paper presents avec a framework for accelerator virtualization in cloud edge computing. the avec framework enables the offloading of deep learning workloads for inference from weak user devices to computationally more powerful devices in a cloud edge network. avec incorporates a mechanism that efficiently manages and schedules the virtualization of accelerators. it also supports migration between accelerators to enable stateless container migration. the experimental analysis highlights that avec can achieve up to 7x speedup by offloading applications to remote resources. furthermore avec features a low migration downtime that is less than 5 seconds.", "Pub Date": "2023-05-26"}