{"Title": "Multi-Objective Secure Task Offloading Strategy for Blockchain-Enabled IoV-MEC Systems: A Double Deep Q-Network Approach", "Doi": "10.1109/ACCESS.2023.3348513", "Authors": ["k. moghaddasi", "s. rajabi", "f. s. gharehchopogh"], "Key Words": ["internet of vehicles", "mobile edge computing", "blockchain", "double deep q-networks", "task offloading"], "Abstract": "the internet of vehicles  iov  represents a paradigm shift in vehicular communication aiming to enhance traffic efficiency safety and the driving experience by leveraging interconnected vehicles. despite its promise the iov faces challenges such as efficient task offloading energy management and data security. mobile edge computing  mec  emerges as a solution to some of these challenges by bringing computational resources closer to the vehicular network‚äôs edge yet it raises critical concerns regarding resource management service continuity and scalability in dynamic vehicular environments. addressing both iov and mec challenges necessitates robust and dynamic optimization mechanisms. in response to these challenges our study introduces a multi objective approach using double deep q networks  ddqn . this algorithm combines the strengths of deep neural networks  dnns  and deep learning  dl  techniques enabling dynamic decision making that can adapt to changing conditions. by considering multiple objectives the ddqn algorithm allows for a sophisticated trade off analysis efficiently balancing between the different objectives to optimize overall system performance. through the use of blockchain technology known for its secure decentralized structure our model enhances the integrity of data providing a reliable and efficient solution for iov mec systems. we conducted a comparative analysis of our model against the standard deep q network  dqn  and deep deterministic policy gradient  ddpg  algorithms which are prevalent in this field. our model demonstrated significant improvements over these traditional methods  energy consumption was reduced by 26.4% latency decreased by 6.87% and the cost was minimized by 7.41%.", "Pub Date": "2024-01-08"}