{"Title": "Multi-Visual-GRU-Based Survivable Computing Power Scheduling in Metro Optical Networks", "Doi": "10.1109/TNSM.2023.3314272", "Authors": ["t. yu", "h. yang", "q. yao", "a. yu", "y. zhao", "s. liu", "y. li", "j. zhang", "m. cheriet"], "Key Words": ["mo-cpn", "burst traffic prediction", "multi-visual-gru", "computing power scheduling"], "Abstract": "the computing power network  cpn  has emerged as a promising networking paradigm in recent times. since the characteristics of high bandwidth low delay and high reliable communication optical networks have been identified as potential frameworks for establishing the cpn infrastructure across metropolitan areas. in cpn of metropolitan areas owing to the low delay demands of computing power requests the traffic of computing power requests is more likely to be burst than others. the burst traffic leads to the exponential increase of the traffic loads instantly which leads to soft failure in the form of overloading and breaks the tradeoff between resource utilization and load balance which all decline the survivability severely. to solve the problems above this article proposes an architecture named metro optical computing power network  mo cpn  to achieve collaborative scheduling in mo cpn. and proposed a survivable computing power scheduling scheme during burst traffic. where a multi visual gate recurrent unit  mv gru  neural network based on error feedback is constructed to achieve high precision of burst traffic prediction. according to the burst traffic prediction a protection threshold to avoid the overloading of nodes is set. and aiming at multi objectives of low delay and load balancing the computing power spectrum resources burst traffic and protection threshold are used as constraints in the scheduling scheme. the experimental results reveal that our approach can significantly enhance the survivability during burst traffic and improve the utilization of resources. the proposed scheme can also lower the blocking probability and average processing delay which has strong robustness and reliability.", "Pub Date": "2024-02-07"}