{"Title": "Multi-Task Self-Supervised Learning Based Tibetan-Chinese Speech-to-Speech Translation", "Doi": "10.1109/IALP61005.2023.10337040", "Authors": ["r. liu", "y. zhao", "x. xu"], "Key Words": ["tibetan-chinese speech-to-speech translation", "self-supervised learning", "multitask learning", "transformer"], "Abstract": "speech to speech translation tasks are commonly tackled by using a three level cascade system which comprises of speech recognition machine translation and speech synthesis. however this approach suffers from the drawback of error accumulation at each stage. in contrast the direct speech to speech translation model directly converts speech from the source language to the target language without relying on intermediate text generation thereby avoiding the issue of incorrect transmission in cascading systems. currently there exist two categories for direct speech to speech translation methods. the first involves mapping the mel spectrogram of the source language speech to the mel spectrogram of the target language speech. however this method often encounters challenges in convergence and producing the audible speech for the target language. the second type of methods is to learn a self supervised discrete representation of the target language using an unlabeled speech corpus. this method entails training a sequence to sequence model on a real world dataset which then maps the source language speech to the discrete representation of the target language. finally a separately trained vocoder is utilized to convert the discrete unit sequence into a speech waveform. given the limited availability of large scale tibetan chinese parallel speech corpora this work adopts the second method to model tibetan chinese speech to speech translation tasks. additionally a multi task learning framework is designed in this work to enhance the performance of the speech translation model. experimental results demonstrate that the tibetan chinese speech to speech translation model based on multi task self supervised learning outperforms both the model based on spectrogram mapping and the single task self supervised learning model in terms of achieving a higher blue value.", "Pub Date": "2023-12-12"}