{"Title": "Multi-UAV Placement and User Association in Uplink MIMO Ultra-Dense Wireless Networks", "Doi": "10.1109/TMC.2021.3108960", "Authors": ["n. nouri", "f. fazel", "j. abouei", "k. n. plataniotis"], "Key Words": ["3d uav placement", "mobile edge computing", "mimo", "machine learning"], "Abstract": "this paper investigates an unmanned aerial vehicle  uav  enabled network consisting of smart mobile devices and multiple uavs as aerial base stations in a multiple input multiple output  mimo  architecture. mobile devices are partitioned into several clusters and offload their tasks to the uav servers via the non orthogonal multiple access  noma  protocol. the main goal of the paper is to jointly maximize the number of served terrestrial users and their scheduling. moreover the number of uav servers and their 3d placement are optimized. to this end we formulate an optimization problem subject to some quality of service  qos  constraints. the resulting problem is non convex and intractable to solve. therefore we break the problem into two subproblems. we propose an efficient algorithm based on machine learning to solve the first subproblem i.e. optimizing the number of uavs and their 3d placements and the user association. different from existing literature our proposed algorithm can achieve low computational complexity and fast convergence. the second subproblem the user scheduling is non convex too. we utilize the $\\ell  p$‚ñìp norm concept to find a convex upper bound for the subproblem and optimize the user scheduling by applying the successive convex approximation  sca  algorithm. the aforementioned process is performed iteratively until the overall algorithm converges and a near optimal solution is achieved for the optimization problem. moreover the computational complexity of the proposed scheme is analyzed. finally we evaluate the performance of our proposed algorithm via the simulation results. regarding fast convergence and low computational complexity of the proposed algorithm its superior performance is confirmed through numerical results.", "Pub Date": "2023-02-06"}