{"Title": "Multi-Objective Neural Architecture Search for Efficient and Fast Semantic Segmentation on Edge", "Doi": "10.1109/TIV.2023.3332594", "Authors": ["d. ziwen", "y. dong"], "Key Words": ["neural architecture search", "edge computing", "real-time semantic segmentation", "multi-objective nas"], "Abstract": "deploying efficient and fast semantic segmentation networks on edge computing platforms in real world environments is desired and challenging. to address this challenge we propose realtimeseg one of the first semantic segmentation models to be searched by neural architecture search nas  capable of running at real time speed on edge devices. in our neural architecture search we incorporate the inference time and flops  floating point operations  of the target edge devices and the semantic segmentation accuracy as objectives. in this way we construct a multi objective neural architecture search. specifically the multi objective nas loss function is decomposed into three sub objective loss functions which are weighted and summed. we employed knowledge distillation to further enhance the accuracy latency and flops of the discovered network architecture during the search process. as a result we successfully obtained our realtimeseg model. lastly we utilized nvidia tensorrt to accelerate realtimeseg and deployed the accelerated realtimeseg on the target platform for real time semantic segmentation. using a single nvidia titan xp gpu realtimeseg can be obtained within 1.5 days. the experimental results demonstrate that realtimeseg achieved an accuracy of 71.7 miou %  while maintaining a frame rate of 25.25 fps on the nvidia jetson nx using the input resolution of 1024 √ó 2048. and the realtimeseg has a lower flops value of 1.52 g which is 17 18√ó less than sota methods. in realistic scenarios realtimeseg has been successfully deployed on edge computing platforms achieving efficient and fast semantic segmentation results.", "Pub Date": "2024-02-22"}