{"Title": "Multi-UAV-Assisted Federated Learning for Energy-Aware Distributed Edge Training", "Doi": "10.1109/TNSM.2023.3298220", "Authors": ["j. tang", "j. nie", "y. zhang", "z. xiong", "w. jiang", "m. guizani"], "Key Words": ["uav", "federated learning", "resource allocation", "client selection", "drl"], "Abstract": "unmanned aerial vehicle  uav  assisted mobile edge computing  mec  has largely extended the border and capacity of artificial intelligence of things  aiot  by providing a key element for enabling flexible distributed data inputs computing capacity and high mobility. to enhance data privacy for aiot applications federated learning  fl  is becoming a potential solution to perform training tasks locally on distributed iot devices. however with the limited onboard resources and battery capacity of each uav node optimization is required to achieve a large scale and high precision fl scheme. in this work an optimized multi uav assisted fl framework is designed where regular iot devices are in charge of performing training tasks and multiple uavs are leveraged to execute local and global aggregation tasks. an online resource allocation  ora  algorithm is proposed to minimize the training latency by jointly deciding the selection decisions of clients and a global aggregation server. by leveraging the lyapunov optimization technique virtual energy queues are studied to depict the energy deficit. with the help of the actor critic learning framework a deep reinforcement learning  drl  scheme is designed to improve per round training performance. a deep neural network  dnn  based actor module is designed to derive client selection decisions and a critic module is proposed through a conventional optimization method to evaluate the obtained selection decisions. moreover a greedy scheme is developed to find the optimal global aggregation server. finally extensive simulation results demonstrate that the proposed ora algorithm can achieve optimal training latency and energy consumption under various system settings.", "Pub Date": "2024-02-07"}