{"Title": "Multi-Document Summarization Made Easy: An Abstractive Query-Focused System Using Web Scraping and Transformer Models", "Doi": "10.1109/CONIT59222.2023.10205946", "Authors": ["p. isaac ritharson", "d. sujitha juliet", "j. anitha", "s. immanuel alex pandian"], "Key Words": ["abstractive summarization", "multi-document summarization", "query-focused summarization", "transformer models", "web scraping", "api"], "Abstract": "the paper proposes a web based abstractive query focused multi document summarization system that aims to simplify the process of summarizing multiple documents on a given topic. the system leverages a range of technologies and techniques including web scraping natural language processing and transformer models to automate the summarization process and improve the accessibility of information for users. the system is designed to take user input in the form of a query the number of words to be summarized and the number of documents to be referred to. it then utilizes google search engine api integration to retrieve the most relevant webpages based on their ranking and performs web scraping of <p> tags using beautiful soup  bs4  and selenium frameworks. the scraped data undergoes pre processing including stop word removal tokenization using auto tokenizer and visualizing frequency matrix and word cloud plots with seaborn and matplotlib. the system employs a transformer model ‚äòmt5 small pretrained‚äô as the pipeline summarizer. the transformer model ranks the words based on frequency and generates a summary of the text that is coherent concise and relevant to the user‚äôs query. the system delivers the output in the form of a well structured summary that captures the essential information from multiple documents. the experimental results demonstrate the potential of integrating different technologies and techniques to automate the summarization process and provide users with high quality summaries of multiple documents on a given query.", "Pub Date": "2023-08-07"}