{"Title": "Multiuser Physical-Layer Authentication Based on Latent Perturbed Neural Networks for Industrial Internet of Things", "Doi": "10.1109/JIOT.2022.3203514", "Authors": ["r. meng", "x. xu", "h. sun", "h. zhao", "b. wang", "s. han", "p. zhang"], "Key Words": ["deep neural networks (dnns)", "identity security", "industrial internet of things (iiot)", "multiuser physical-layer authentication (pla)"], "Abstract": "recently learning  dl  based physical layer authentication  pla  has attracted much attention since artificial neural networks  anns  can be built to extract useful features from complex wireless environments thus achieving high authentication performance and lightweight deployment in mobile edge computing  mec  industrial internet of things  iiot  scenario. however the low latency characteristic of mec makes it impossible to have much time to obtain sufficient signals for training the authentication system which will cause over fitting issues and deteriorate the authentication performance. data augmentation is an effective method to address this problem. however existing pla with data augmentation can not generate representative and high quality samples consequently lacking generality in the actual identity authentication. to tackle this problem a novel channel impulse response  cir  based multiuser authentication named latent perturbed neural networks  lpnns  is proposed in this article aiming at achieving high authentication performance even when trained a few data. instead of relying on the generation of synthetic samples the proposed lpnn adds gaussian noise in the smooth latent space to avoid underdetermined and poor generalization which has better interpretability. specifically to obtain a better understanding than a black box that connects input cirs to authentication results we defined fingerprint library and provided post hoc explanations to answer the following question  which library examples explain the authentication results issued for a given cir sample? moreover the simulations under the static and dynamic iiot scenarios verify the superiority in authentication accuracy of the proposed lpnn over vanilla deep neural network  dnn  and convolutional neural network  cnn .", "Pub Date": "2022-12-22"}