{"Title": "Multi-Task Matching Mechanism Design for UAV-Assisted MEC Network With Blockchain", "Doi": "10.1109/ACCESS.2023.3332822", "Authors": ["m. wei", "k. xu"], "Key Words": ["mobile edge computing", "unmanned aerial vehicles", "resource allocation", "blockchain", "multi-task offloading", "matching mechanism"], "Abstract": "mobile edge computing  mec  is a technology deployed at the edge of mobile networks to enhance computation capabilities and reduce transmission distances. it has been extensively researched in the context of both the internet of things  iot  and 5g communication. recently unmanned aerial vehicles  uavs  have been integrated into mec networks to create a novel architecture that utilizes line of sight  los  transmission links. in this architecture uavs act as relay nodes to facilitate the offloading of computing tasks from uavs to edge computing stations  ecss . however the problem of creating an incentive system that guarantees the confidentiality and integrity of communication while simultaneously making it easier for uavs and ecss to coordinate a variety of activities remains unsolved. consequently this paper proposes a blockchain based architecture for uav assisted mec networks that addresses the aforementioned issues of security and privacy and investigates the problem of multi task matching based on this architecture. a joint optimization problem is explicitly proposed to maximize both task completion rates and social welfare. consequently the formulated problem is decomposed into two subproblems  1  the double auction problem which aims to maximize societal utility and determines the winning pairs and trading price  and 2  the auction losers matching problem which aims to increase task completion rates. then to identify the appropriate matching pairings and establish the trading price a satisfaction breakeven based double auction  sbda  method is suggested. sequentially two auction losers‚äô second selection schemes the shortest distance  sd  and the largest difference  ld  scheme are proposed to realize second matching to enhance the task completion rate. finally numerical simulations are given to show the effectiveness of the proposed mechanism. particularly the sbda+ld mechanism has the best system utility and overall income compared with other schemes.", "Pub Date": "2023-11-21"}