{"Title": "Multi-User Dynamic Computation Offloading and Resource Allocation in 5G MEC Heterogeneous Networks With Static and Dynamic Subchannels", "Doi": "10.1109/TVT.2023.3285069", "Authors": ["l. liu", "x. yuan", "d. chen", "n. zhang", "h. sun", "a. taherkordi"], "Key Words": ["5g heterogeneous network", "dynamic computation offloading", "offloading strategy", "subchannel assignment scheme", "transmission path decision"], "Abstract": "with the rapid development of mobile edge computing  mec  technology the computationally intensive requests of end devices can be offloaded to mec servers directly which equipped at the edge of wireless networks. through offloading the performances such as the execution delay as well as the energy consumption can be effectively improved which can significantly enhance the quality of user experience. given the dynamics and randomness of computation requests arrival the energy in the battery the radio network environment and the computation resource in the mec server it is a challenge to perform efficient offloading. based on these problems this article proposes dynamic optimization schemes with queuing theory for the cases of the static subchannel and dynamic subchannel during a time slot separately in 5g mec heterogeneous networks with multiple mds equipped with the function of energy harvesting. in the schemes offloading decisions and radio allocation strategies will be dynamically coordinated. they are also jointly allocated along with changing wireless communication resources and computation demands aiming to minimize the system average execution delay. specifically it is assumed that the offloading requests can be transmitted through either macro base stations or small base stations. in the case of the static subchannel a joint resource allocation and computation offloading scheme based on lyapunov optimization and simulated annealing genetic algorithm  saga  is put forward. as for the dynamic subchannel the leader and follower model is adopted and solved by saga and sequential quadratic programming  sqp  method. at last the effectiveness of the proposed schemes is verified through several simulations.", "Pub Date": "2023-11-14"}