{"Title": "Multi-Wavelength Photonic Neuromorphic Computing for Intra and Inter-Channel Distortion Compensations in WDM Optical Communication Systems", "Authors": ["b. wang", "t. f. de lima", "b. j. shastri", "p. r. prucnal", "c. huang"], "Pub Date": "2022-10-25", "Abstract": "digital signal processing  dsp  has been widely applied in optical communication systems to mitigate various signal distortions and has become one of the key technologies that have sustained data traffic growth over the past decade. however the strict energy budget of application specific integrated circuit based dsp chips has prevented the deployment of some powerful but computationally costly dsp algorithms in real applications. as a result fiber nonlinearity induced signal distortions impede fiber communication systems especially in wavelength division multiplexed  wdm  transmission systems. to solve these challenges in dsp there has been a surge of interest in implementing neural networks based signal processing using photonics hardware  i.e. photonic neural networks . photonic neural networks promise to break performance limitations in electronics and gain advantages in bandwidth latency and power consumption in solving intellectual tasks that are unreachable by conventional digital electronic platforms. this work proposes a photonic recurrent neural network  rnn  capable of simultaneously resolving dispersion and both intra and inter channel fiber nonlinearities in multiple wdm channels in the photonic domain for the first time to our best knowledge. furthermore our photonic rnn can directly process optical wdm signals in the photonic domain avoiding prohibitive energy consumption and speed overhead in analog to digital converters  adcs . our proposed photonic rnn is fully compatible with mature silicon photonic fabrications. we demonstrate in simulation that our photonic rnn can process multiple wdm channels simultaneously and achieve a reduced bit error rate compared to typical dsp algorithms for all wdm channels in a pulse amplitude modulation 4 level  pam4  transmission system thanks to its unique capability to address inter channel fiber nonlinearities. in addition to signal quality performance the proposed system also promises to significantly reduce the power consumption and the latency compared to the state of the art dsp chips according to our power and latency analysis.", "Doi": "10.1109/JSTQE.2022.3213172", "Key Words": ["digital signal processing", "neuromorphic computing", "nonlinear optics", "optical fiber communication", "photonic neural network", "signal equalization", "wavelength-division multiplexing"]}