{"Title": "Multiagent Meta-Reinforcement Learning for Optimized Task Scheduling in Heterogeneous Edge Computing Systems", "Doi": "10.1109/JIOT.2023.3241222", "Authors": ["l. niu", "x. chen", "n. zhang", "y. zhu", "r. yin", "c. wu", "y. cao"], "Key Words": ["computation task scheduling", "heterogeneous edge computing systems", "markov decision process (mdp)", "meta-learning", "multiagent proximal policy optimization (ppo)"], "Abstract": "mobile edge computing  mec  brings the potential to address the ever increasing computation demands from the mobile users  mus . in addition to local processing the resource constrained mus in an mec system can also offload computation to the nearby servers for remote execution. with the explosive growth of mobile devices computation offloading faces the challenge of spectrum congestion which in turn deteriorates the overall quality of computation experience. this article hence investigates computation task scheduling in a heterogeneous cellular and wifi mec system. such a system provides both licensed and unlicensed spectrum opportunities. due to the sharing of communication and computation resources as well as the uncertainties we formulate the problem of computation task scheduling among the competing mus in a stationary heterogeneous edge computing system as a noncooperative stochastic game. we propose an approximation based multiagent markov decision process without the global system state observations under which a multiagent proximal policy optimization  ppo  algorithm is derived to solve the corresponding nash equilibrium. when expanding to a nonstationary heterogeneous edge computing system the obtained algorithm suffers from the slow convergence due to constrained adaptability. accordingly we explore meta learning and propose a multiagent meta ppo algorithm which rapidly adapts the control policy learning to the nonstationarity. numerical experiments demonstrate performance gains from our proposed algorithms.", "Pub Date": "2023-06-01"}