{"Title": "Mutually Unbiased Measurements, Hadamard Matrices, and Superdense Coding", "Authors": ["m. farkas", "j. kaniewski", "a. nayak"], "Pub Date": "2023-05-19", "Abstract": "mutually unbiased bases  mubs  are highly symmetric bases on complex hilbert spaces and the corresponding rank 1 projective measurements are ubiquitous in quantum information theory. in this work we study a recently introduced generalisation of mubs called mutually unbiased measurements  mums . these measurements inherit the essential property of complementarity from mubs but the hilbert space dimension is no longer required to match the number of outcomes. this operational complementarity property renders mums highly useful for device independent quantum information processing. it has been shown that mums are strictly more general than mubs. in this work we provide a complete proof of the characterisation of mums that are direct sums of mubs. we then construct new examples of mums that are not direct sums of mubs. a crucial technical tool for this construction is a correspondence with quaternionic hadamard matrices which allows us to map known examples of such matrices to mums that are not direct sums of mubs. furthermore we show that‚äîin stark contrast with mubs‚äîthe number of mums for a fixed outcome number is unbounded. next we focus on the use of mums in quantum communication. we demonstrate how any pair of mums with  $d$  outcomes defines a  $d$  dimensional superdense coding protocol. using mums that are not direct sums of mubs we disprove a recent conjecture due to nayak and yuen on the rigidity of superdense coding for infinitely many dimensions. the superdense coding protocols arising in the refutation reveal how shared entanglement may be used in a manner heretofore unknown.", "Doi": "10.1109/TIT.2023.3269524", "Key Words": ["mutually unbiased bases (mubs)", "mutually unbiased measurements (mums)", "hadamard matrix of unitary operators", "quaternionic hadamard matrix", "perfect sequences", "superdense coding", "rigidity", "shared entanglement"]}