{"Title": "MWG-Net: Multiscale Wavelet Guidance Network for COVID-19 Lung Infection Segmentation From CT Images", "Doi": "10.1109/TIM.2023.3265100", "Authors": ["k. hu", "h. tan", "y. zhang", "w. huang", "x. gao"], "Key Words": ["computed tomography (ct) scans", "covid-19", "infection segmentation", "multiscale", "wavelet guidance"], "Abstract": "recently accurate segmentation of the coronavirus disease 2019  covid 19  infection from computed tomography  ct  scans is critical to the diagnosis and treatment of covid 19. however infection segmentation is a challenging task due to various textures sizes and locations of infections low contrast and blurred boundaries. to address these problems we propose a novel multiscale wavelet guidance network  mwg net  for covid-19 lung infection by integrating the multiscale information of wavelet domain into the encoder and decoder of the convolutional neural network  cnn . in particular we propose the wavelet guidance module  wgm  and wavelet and edge guidance module  wegm . among them the wgm guides the encoder to extract infection details through the multiscale spatial and frequency features in the wavelet domain while the wegm guides the decoder to recover infection details through the multiscale wavelet representations and multiscale infection edge information. besides a progressive fusion module  pfm  is further developed to aggregate and explore multiscale features of the encoder and decoder. notably we establish a covid-19 segmentation dataset  named covid seg 100  containing 5800+ annotated slices for performance evaluation. furthermore we conduct extensive experiments to compare our method with other state of the art approaches on our covid 19 seg 100 and two publicly available datasets i.e. mosmeddata and covid semiseg. the results show that our mwg net outperforms state of the art methods on different datasets and can achieve more accurate and promising covid-19 lung infection segmentation.", "Pub Date": "2023-04-20"}