{"Title": "NaijaFaceVoice: A Large-Scale Deep Learning Model and Database of Nigerian Faces and Voices", "Doi": "10.1109/ACCESS.2023.3282618", "Authors": ["a. a. akinrinmade", "e. adetiba", "j. a. badejo", "o. oshin"], "Key Words": ["convolutional neural network", "face recognition", "fusion", "large-scale", "speaker recognition", "spectrogram-voting", "vote-code"], "Abstract": "the fusion of two or more traits in multimodal biometrics generally improves recognition accuracy. the question is by how much? large scale databases are better suited for training deep learning models for better generalization and accuracy. therefore a large scale multimodal database is beneficial. however publicly available large scale multimodal databases are scarce especially for faces and voices. again because a face image is 2 d while a voice is 1 d there is the challenge of the best way to fuse both. therefore improvements owing to fusion have hitherto yielded marginal improvements. this study proposes a semi automated curation algorithm for the extraction of the faces and voices of target individuals in videos to create a large scale face voice database. the curation technique involves observing the positions at the time of the occurrence of the target subject‚äôs faces and voices in videos. these positions are supplied to a matlab2017b script that detects the faces in the observed regions crops resizes auto labels and writes them to the disk. a second matlab2017b script extracts the audio content within the observed regions auto labels and writes the voice segments to the disk. the created database named naijafacevoice consists of 2656 subjects with over 2 million faces and 195 hours of utterances. the database was employed to develop a large scale recognition system that leveraged convolutional neural networks. robust fusion methods incorporating the proposed spectrogram voting concept significantly improved performance achieving a record equal error rate of 0.0003519% an improvement by a factor of over 450.", "Pub Date": "2023-06-15"}