{"Title": "Named Entity Recognition Based on Boundary Enhanced for Chinese Electronic Medical Records", "Doi": "10.1109/ICTech58362.2023.00025", "Authors": ["x. chen", "t. liu", "g. tang", "y. liu"], "Key Words": ["named entity recognition", "electronic medical records", "boundary enhanced", "information extraction"], "Abstract": "with the continuous popularization of medical informatization the number of medical documents medical guides electronic medical records and other medical texts shows a trend of rapid growth and huge scale. medical texts contain great social value. however most medical texts exist in an unstructured form and cannot be directly applied to products. therefore how to fully explore the potential valuable information has become a hot research direction in the field of natural language processing. named entity recognition is the basic task of natural language processing and also the key task of medical data mining and analysis. it also lays the foundation for downstream tasks such as medical term relationship extraction and medical term standardization. named entity recognition aims to find some key phrases in a large number of texts such as people names place names diseases and drugs. at present named entity recognition has made great achievements in the open field but there are still many problems in the research of named entity recognition in the medical field such as the strong professionalism of entities the long length of some types of entities and the existence of complex entities mixed in chinese and english. aiming at the problem that the length of named entities in existing medical electronic medical records is longer than that in other fields resulting in low extraction accuracy a named entity recognition algorithm based on boundary enhancement is proposed. the model adopts the method of multi task learning which can effectively alleviate the boundary problem caused by the length of medical terms. we have tried various models on our medical electronic medical record data set. experimental results show that this method is simple and effective in medical named entity recognition.", "Pub Date": "2023-09-29"}