{"Title": "Natural Language Processing Approach and Geospatial Clustering to Explore the Unexplored Geotags Using Media", "Doi": "10.1109/Confluence56041.2023.10048848", "Authors": ["s. mehta", "g. jain", "s. mala"], "Key Words": ["geospatial", "gis", "natural language processing", "spatial", "clustering"], "Abstract": "natural language processing  nlp  is a growing field of unstructured data analysis and computational methodology that uses text from a variety of sources. typically natural language processing is used to extract meaning from a large array of corpora in an automated way often using statistical or artificial intelligence methods when data is obtained through web clippings or document searches. geospatial analysis is a field under data science which deal with the processing of satellite images gps  global positioning system  coordinates to build geographic models. there are certain locations which are not exactly geotagged but they can be described through some referenced geotagged location  e.g. \" 200 meters west of qutub minar\"  . geospatial clustering is the method of grouping a set of spatial objects into groups called \"clusters\". objects within a cluster show a high degree of similarity whereas the clusters are as much dissimilar as possible. the goal of clustering is to do a generalization and to reveal a relation between spatial and non spatial attributes. the aeronautical reconnaissance coverage geographic information system  arcgis  toolkit is ideal for this and in particular the arcgis.learn application programming interface  api  provides methods for extracting features with output that can be written directly to a spatial dataframe or feature class. understanding spatial structure use the structure and layout information in pdf  portable document format  files to improve the performance of custom object retrieval. in this project we will be exploring the places or toponyms which are not geotagged and have very less description about them and try to explore these places using geotagged places from the media articles like blogs websites etc.", "Pub Date": "2023-02-22"}