{"Title": "Near-Optimal and Collaborative Service Caching in Mobile Edge Clouds", "Doi": "10.1109/TMC.2022.3144175", "Authors": ["z. xu", "l. zhou", "s. c. -k. chau", "w. liang", "h. dai", "l. chen", "w. xu", "q. xia", "p. zhou"], "Key Words": ["service caching", "mobile edge clouds", "resource sharing", "coalition formation", "strong price of anarchy", "game theory"], "Abstract": "with the development of 5g technology mobile edge computing is emerging as an enabling technique to reduce the response latency of network services by deploying cloudlets at 5g base stations to form mobile edge cloud  mec  networks. network service providers now shift their services from remote clouds to cloudlets of mec networks in the proximity of users. however the permanent placement of network services into an mec network is not economic due to limited computing and bandwidth resources imposed on its cloudlets. a smart way is to cache frequently demanded services from remote clouds to cloudlets of the mec network. in this paper we study the problem of service caching in an mec network under a service market with multiple network service providers competing for both computation and bandwidth resources in terms of virtual machines  vms  in the mec network. we first propose an integer linear program  ilp  solution and a randomized rounding algorithm for the problem without vm sharing among different network service providers. we then devise a distributed and stable game theoretical mechanism for the problem with vm sharing among network service providers with the aim to minimize the social cost of all network service providers through introducing a novel cost sharing model and a coalition formation game. we also analyze the performance guarantee of the proposed mechanism strong price of anarchy  spoa . we third consider the cost  and delay sensitive service caching problem with temporal vm sharing and propose a mechanism with provable spoa. we finally evaluate the performance through extensive simulations and a real world test bed implementation. experimental results demonstrate that the proposed algorithms outperform existing approaches by achieving at least $40\\%$40% lower social cost via service caching and resource sharing among different network service providers.", "Pub Date": "2023-06-05"}