{"Title": "Networking Architecture and Key Supporting Technologies for Human Digital Twin in Personalized Healthcare: A Comprehensive Survey", "Doi": "10.1109/COMST.2023.3308717", "Authors": ["j. chen", "c. yi", "s. d. okegbile", "j. cai", "x. shen"], "Key Words": ["human digital twin", "personalized healthcare", "artificial intelligence", "reinforcement learning", "federated learning", "networking architecture", "life-cycle data management", "pervasive sensing", "on-body communications", "tactile internet", "semantic communications", "multi-access edge computing", "edge-cloud collaboration", "blockchain", "metaverse"], "Abstract": "digital twin  dt  referring to a promising technique to digitally and accurately represent actual physical entities has attracted explosive interests from both academia and industry. one typical advantage of dt is that it can be used to not only virtually replicate a system‚äôs detailed operations but also analyze the current condition predict the future behavior and refine the control optimization. although dt has been widely implemented in various fields such as smart manufacturing and transportation its conventional paradigm is limited to embody non living entities e.g. robots and vehicles. when adopted in human centric systems a novel concept called human digital twin  hdt  has thus been proposed. particularly hdt allows in silico representation of individual human body with the ability to dynamically reflect molecular status physiological status emotional and psychological status as well as lifestyle evolutions. these prompt the expected application of hdt in personalized healthcare  ph  which can facilitate the remote monitoring diagnosis prescription surgery and rehabilitation and hence significantly alleviate the heavy burden on the traditional healthcare system. however despite the large potential hdt faces substantial research challenges in different aspects and becomes an increasingly popular topic recently. in this survey with a specific focus on the networking architecture and key technologies for hdt in ph applications we first discuss the differences between hdt and the conventional dts followed by the universal framework and essential functions of hdt. we then analyze its design requirements and challenges in ph applications. after that we provide an overview of the networking architecture of hdt including data acquisition layer data communication layer computation layer data management layer and data analysis and decision making layer. besides reviewing the key technologies for implementing such networking architecture in detail we conclude this survey by presenting future research directions of hdt.", "Pub Date": "2024-02-26"}