{"Title": "NLP-Crowdsourcing Hybrid Framework for Inter-Researcher Similarity Detection", "Doi": "10.1109/THMS.2023.3319290", "Authors": ["a. correia", "d. guimar√£es", "h. paredes", "b. fonseca", "d. paulino", "l. trigo", "p. brazdil", "d. schneider", "a. grover", "s. jameel"], "Key Words": ["adaptive human‚äìmachine systems", "bidirectional language models", "crowdsourcing", "human‚äìcomputer interaction (hci)", "natural language processing (nlp)", "text-based similarity algorithms", "term frequency-inverse document frequency (tf-idf)"], "Abstract": "visualizing and examining the intellectual landscape and evolution of scientific communities to support collaboration is crucial for multiple research purposes. in some cases measuring similarities and matching patterns between research publication document sets can help to identify people with similar interests for building research collaboration networks and university‚äìindustry linkages. the premise of this work is assessing feasibility for resolving ambiguous cases in similarity detection to determine authorship with natural language processing  nlp  techniques so that crowdsourcing is applied only in instances that require human judgment. using an nlp crowdsourcing convergence strategy we can reduce the costs of microtask crowdsourcing while saving time and maintaining disambiguation accuracy over large datasets. this article contributes a next gen crowd artificial intelligence framework that used an ensemble of term frequency inverse document frequency and bidirectional encoder representation from transformers to obtain similarity rankings for pairs of scientific documents. a sequence of content based similarity tasks was created using a crowd powered interface for solving disambiguation problems. our experimental results suggest that an adaptive nlp crowdsourcing hybrid framework has advantages for inter researcher similarity detection tasks where fully automatic algorithms provide unsatisfactory results with the goal of helping researchers discover potential collaborators using data driven approaches.", "Pub Date": "2023-12-14"}