{"Title": "No-Reference Virtual Reality Image Quality Evaluator Using Global and Local Natural Scene Statistics", "Authors": ["a. k. r. poreddy", "r. b. c. ganeswaram", "b. appina", "p. kokil", "r. b. pachori"], "Pub Date": "2023-10-24", "Abstract": "with the rapid proliferation of virtual reality  vr  technologies the usage of vr in multimedia education and social media platforms has increased due to realistic and immersive 3 d viewing experiences. in particular vr refers to a computer generated synthetic environment where the users can experience  $180^{\\circ} \\times 360^{\\circ} $  spherical vr content through head mounted displays  hmds . due to the  $180^{\\circ} \\times 360^{\\circ} $  viewing range the quality assessment  qa  of vr images becomes quite difficult compared to conventional 2 d image qa  iqa  models. to alleviate this problem in this article we propose a supervised no reference  nr  vr iqa model based on global and local natural scene statistics  nss  of a vr image. the global features are computed based on joint dependencies between adjacent pixels of equirectangular projection  erp  vr image using generalized gaussian distributions  ggds . specifically we compute the model parameters of ggds at multiple scales and show that the model parameters are distortion discriminable. furthermore we compute local features based on statistical properties of spatial and spectral entropy maps of cube map projection  cmp  faces of a vr image. since the local feature extraction is carried out at the cmp face level we compute the average of the face level features to obtain the overall local feature set of a vr image. finally global and local feature sets are combined and given to support vector regressor  svr  to map the quality aware feature set to vr image quality with labels as human assessment scores. the performance of the proposed vr iqa model is verified on three omnidirectional vr iqa datasets such as cviqd oiqa odiqa and one stereoscopic vr iqa dataset namely live s3d vr. experimental results show that the predicted scores of the proposed vr iqa model correlate very well with the subjective scores of the aforementioned vr iqa datasets and achieved state of the art performance numbers compared to the existing 2 d and 3 d iqa models.", "Doi": "10.1109/TIM.2023.3322995", "Key Words": ["cubemap projection (cmp)", "equirectangular projection (erp)", "natural scene statistics (nss)", "support vector regressor (svr)", "virtual reality (vr)"]}