{"Title": "NOMA-Aided Joint Communication, Sensing, and Multi-Tier Computing Systems", "Doi": "10.1109/JSAC.2022.3229447", "Authors": ["z. wang", "x. mu", "y. liu", "x. xu", "p. zhang"], "Key Words": ["beamforming design", "integrated sensing and communication (isac)", "multi-tier computing", "non-orthogonal multiple access (noma)"], "Abstract": "a non orthogonal multiple access  noma  aided joint communication sensing and multi tier computing  jcsmc  framework is proposed. in this framework a multi functional base station  bs  simultaneously carries out target sensing and provide edge computing services to the nearby users. to enhance the computation efficiency the multi tier computing structure is exploited where the bs can further offload the computation tasks to a powerful cloud server  cs . the potential benefits of employing noma in the proposed jcsmc framework are investigated which can maximize the computation offloading capacity and suppress inter functionality interference. based on the proposed framework the transmit beamformer of the bs and computing resource allocation among the bs and cs are jointly optimized to maximize the computation rate subject to the communication computation causality and the sensing quality constraints. both partial and binary computation offloading modes are considered  1  for the partial offloading mode a weighted minimum mean square error based alternating optimization algorithm is proposed to solve the corresponding non convex optimization problem. it is proved that a karush‚äìkuhn‚äìtucker optimal solution can be obtained  2  for the binary offloading mode the resultant highly coupled mixed integer optimization problem is first transformed to an equivalent but more tractable form. then the reformulated problem is solved by utilizing the alternating direction method of multipliers approach to obtain a nearly optimal solution. finally numerical results verify the effectiveness of the proposed algorithms and reveal that  i  the computation rate can be significantly enhanced by exploiting the multi tier computing architecture when the bs is resource limited and ii  the proposed noma aided jscmc framework is superior in inter functionality interference management and can achieve high quality sensing and computing performance simultaneously compared with other benchmark schemes.", "Pub Date": "2023-02-15"}