{"Title": "Novel Resolution of Unit Commitment Problems Through Quantum Surrogate Lagrangian Relaxation", "Authors": ["f. feng", "p. zhang", "m. a. bragin", "y. zhou"], "Pub Date": "2023-04-24", "Abstract": "unit commitment  uc  problems faced by independent system operators on a daily basis are becoming increasingly complex due to the recent push for renewables and the consideration of sub hourly uc to accommodate the increasing variability in the net load. a disruptive solution methodology to address the growing complexity is therefore required. quantum computing offers a promise to overcome the combinatorial complexity through the use of the so called ‚äúqubits.‚äù to make the best use of near term quantum computers to solve uc problems with a much larger number of binary variables than the number of qubits available this paper devises a novel solution methodology based on a synergistic combination of quantum computing and surrogate lagrangian relaxation  slr  to solve uc problems. our new contributions include  1  a quantum slr  qslr  algorithm incorporating quantum approximate optimization algorithm  qaoa  into the slr method which overcomes the fundamental difficulties of previous lr based quantum methods such as zigzagging of multipliers and the need to know or estimate the optimal dual value for convergence  2  a distributed qslr framework  d qslr  capable of coordinating local quantum classical computing resources with those within neighborhoods and in the meantime protecting data privacy  3  a quantized uc model to obtain accurate commitment unit subproblems decision by using a quantum machine  and 4  a time unit decomposed quantum uc approach to overcoming the quantum resources‚äô limitations. promising quantum test results validate the effectiveness of qslr and the scalability of the uc oriented d qslr algorithm which demonstrate qslr‚äôs enormous potential in uc optimization.", "Doi": "10.1109/TPWRS.2022.3181221", "Key Words": ["distributed quantum optimization", "quantum approximate optimization algorithm", "quantum computing", "surrogate lagrangian relaxation", "unit commitment"]}