{"Title": "Novel Online Network Intrusion Detection System for Industrial IoT Based on OI-SVDD and AS-ELM", "Doi": "10.1109/JIOT.2022.3172393", "Authors": ["e. gyamfi", "a. d. jurcut"], "Key Words": ["extreme learning machine", "incremental learning", "industrial internet of things (iiot)", "multiaccess edge computing (mec)", "network intrusion detection system (nids)", "rate of convergence (roc)", "support vector data description (svdd)", "task offloading"], "Abstract": "the industrial internet of things  iiot  should be equipped with computational resources to detect network intrusions types of attacks and update their models automatically in real time. the most challenging aspect of machine learning  ml  based network intrusion detection system  nids  design to secure iiot is the continuous need for up to date definitions of attack data records. moreover the approaches employed by cyber attackers are in a dynamic state with changing trends and techniques. hence conventional signature based nids are not suitable since they cannot update obsolete detection models. anomaly based nids that contains an online learning technique is adopted in our proposed method. since iiots face resource constrained problems such as low memory low computing capacity and limited energy supply it is very challenging to implement the exiting general purpose anomaly based nids. this article proposes a lightweight nids based on an online incremental support vector data description  oi svdd  anomaly detection system on the iiot devices and an adaptive sequential extreme learning machine  as elm  on the multiaccess edge computing  mec  server. additionally we utilize the mec server which provides computational resources to execute the as elm model at the network‚äôs edge. to avoid data saturation in the proposed model we apply data filtering using the rate of convergence  roc . we evaluated the proposed nids through experiments using two data sets such as unsw nb15  public data set  and our self generated data set. our results show that the proposed oi svdd and as elm perform effectively and detect network intrusion in a realistic iiot environment.", "Pub Date": "2023-02-20"}