{"Title": "Novel Industry Architectures for Connectivity Solutions in the Smart Distribution Grids", "Doi": "10.1109/ACCESS.2023.3291745", "Authors": ["s. borenius", "p. kekolahti", "h. h√§mm√§inen", "m. lehtonen", "p. m√§h√∂nen"], "Key Words": ["cloud computing", "communications", "distributed computing", "edge computing", "industry architectures", "mobile communications", "overlay networks", "power grids", "smart grids", "value networks"], "Abstract": "the electric energy system is undergoing a major change due to the increasing requirements of dynamic performance. in distribution grids this evolution will necessitate expanded automation which in turn will require enhanced connectivity solutions. strongly evolving communications technologies and architectures particularly mobile communications as well as cloud and edge computing will provide new opportunities and alternatives for connectivity solutions. this paper contributes by identifying potential technical and industry architectures for the connectivity solutions required to manage distribution grids in the early 2030s. the study utilizes a senior expert panel and a delphi survey. industry architectures are modelled as value networks. the paper uses the finnish distribution grids as a case example. regarding technical architectures the results reveal skepticism concerning those emerging 5g mobile network features that target industrial applications and about the need for extensive distributed computing in the proximity of consumers and prosumers. the most probable industry architectures are found to be those that enable the distribution system operators  dsos  to maintain direct control of critical technical components or that enable communications service providers  csps  to handle the operations of both communications solutions and distributed computing. csps are seen as well positioned for this task due to their existing networking and computing infrastructure. however this may also involve business risks for both dsos and csps.", "Pub Date": "2023-07-11"}