{"Title": "Offloading Using Traditional Optimization and Machine Learning in Federated Cloud‚ÄìEdge‚ÄìFog Systems: A Survey", "Doi": "10.1109/COMST.2023.3239579", "Authors": ["b. kar", "w. yahya", "y. -d. lin", "a. ali"], "Key Words": ["offloading", "cloud computing", "edge computing", "fog computing", "federation", "optimization", "machine learning"], "Abstract": "the huge amount of data generated by the internet of things  iot  devices needs the computational power and storage capacity provided by cloud edge and fog computing paradigms. each of these computing paradigms has its own pros and cons. cloud computing provides enhanced data storage and computing power but causes high communication latency. edge and fog computing provide similar services with lower latency but limited capacity capability and coverage. a single computing paradigm cannot fulfill all the requirements of iot devices and a federation between them is needed to extend their capacity capability and services. this federation is beneficial to both subscribers and providers and also reveals research issues in traffic offloading between clouds edges and fogs. optimization has traditionally been used to solve the problem of traffic offloading. however in such a complex federated system traditional optimization cannot keep up with the strict latency requirements of decision making ranging from milliseconds to sub seconds. machine learning approaches especially reinforcement learning are consequently becoming popular because they could quickly solve offloading problems in dynamic environments with some unknown information. this study provides a novel federal classification between cloud edge and fog and presents a comprehensive research roadmap on offloading for different federated scenarios. we survey the relevant literature on the various optimization approaches used to solve this offloading problem and compare their salient features. we then provide a comprehensive survey on offloading in federated systems with machine learning approaches and the lessons learned as a result of these surveys. finally we outline several directions for future research and challenges that have to be faced in order to achieve such a federation.", "Pub Date": "2023-05-22"}