{"Title": "Offloading Mechanisms Based on Reinforcement Learning and Deep Learning Algorithms in the Fog Computing Environment", "Doi": "10.1109/ACCESS.2023.3241881", "Authors": ["d. h. abdulazeez", "s. k. askar"], "Key Words": ["fog computing", "internet of things (iot)", "offloading", "reinforcement learning", "deep reinforcement learning"], "Abstract": "fog computing has emerged as a computing paradigm for resource restricted internet of things  iot  devices to support time sensitive and computationally intensive applications. offloading can be utilized to transfer resource intensive tasks from resource limited end devices to a resource rich fog or cloud layer to reduce end to end latency and enhance the performance of the system. however this advantage is still challenging to achieve in systems with a high request rate because it leads to long queues of tasks in fog nodes and reveals inefficiencies in terms of delays. in this regard reinforcement learning  rl  is a well known method for addressing such decision making issues. however in large scale wireless networks both action and state spaces are complex and extremely extensive. consequently reinforcement learning techniques may not be able to identify an efficient strategy within an acceptable time frame. hence deep reinforcement learning  drl  was developed to integrate rl and deep learning  dl  to address this problem. this paper presents a systematic analysis of using rl or drl algorithms to address offloading related issues in fog computing. first the taxonomy of fog computing offloading mechanisms based on rl and drl algorithms was divided into three major categories  value based policy based and hybrid based algorithms. these categories were then compared based on important features including offloading problem formulation utilized techniques performance metrics evaluation tools case studies their strengths and drawbacks offloading directions offloading mode sdn based architecture and offloading decisions. finally the future research directions and open issues are discussed thoroughly.", "Pub Date": "2023-02-10"}