{"Title": "On Applicability of Imagery-Based CNN to Computational Offloading Location Selection", "Doi": "10.1109/ACCESS.2022.3232469", "Authors": ["a. ometov", "a. mezina", "j. nurmi"], "Key Words": ["computational offloading", "machine learning", "mobile edge computing", "optimization"], "Abstract": "the progress in computational offloading is heavily pushing the development of the modern information and communications technology domain. the growth in resource constrained internet of things devices demands the development of new computational offloading strategies to be sustainably integrated in beyond 5g networks. one of the solutions to said demand is enabling mobile edge computing  mec  powered by advanced methods of machine learning  ml . this paper proposes the application of ml powered computational offloading strategy in a wireless cellular network by applying the traditional fundamental travelling salesman problem  tsp  on computational offloading location selection. the main specificity of the proposed approach is the use of imagery data. thus the paper executes a literature review to identify existing strategies. it further proposes a novel method utilizing the location like imagery data to identify the most suitable computational location by executing the search for an identified route between locations using the proposed deep learning  dl  model. the model was evaluated and achieved mae ‚äì 1575 msa ‚äì 10119205  $r^{2}$  ‚äì 0.98 on the testing dataset which outperforms or is comparable with other well known architectures. moreover the training time is proven to be 2‚äì10 times faster. interestingly the mae values are relatively low compared to the target values that should be predicted  despite rather high mse results  which is confirmed by the almost perfect  $r^{2}$  value. it is concluded that the proposed neural network can predict the target values and this solution can be applied to real world tasks.", "Pub Date": "2023-01-10"}