{"Title": "On Quantum Hyperparameters Selection in Hybrid Classifiers for Earth Observation Data", "Authors": ["a. sebastianelli", "m. p. d. rosso", "s. l. ullo", "p. gamba"], "Pub Date": "2023-09-01", "Abstract": "quantum machine learning  qml  is an emerging technology that only recently has begun to take root in the research fields of earth observation  eo  and remote sensing  rs  and whose state of the art  sota  is roughly divided into one group oriented to fully quantum solutions and in another oriented to hybrid solutions. very few works applied qml to eo tasks and none of them explored a methodology that can give guidelines on the hyperparameter tuning of the quantum part for land cover classification  lcc . as a first step in the direction of quantum advantage for rs data classification this letter opens new research lines allowing us to demonstrate that there are more convenient solutions to simply increasing the number of qubits in the quantum part. to pave the first steps for researchers interested in the above the structure of a new hybrid quantum neural network  qnn  for eo data and lcc is proposed with a strategy to choose the number of qubits to find the most efficient combination in terms of both system complexity and results accuracy. we sampled and tried a number of configurations and using the suggested method we came up with the most efficient solution  in terms of the selected metrics . better performance is achieved with less model complexity when tested and compared with sota and standard techniques for identifying volcanic eruptions chosen as a case study. additionally the method makes the model more resilient to dataset imbalance a significant problem when training classical models. lastly the code is freely available so that interested researchers can reproduce and extend the results.", "Doi": "10.1109/LGRS.2023.3308105", "Key Words": ["earth observation (eo)", "image analysis", "quantum convolutional neural networks (qcnns)", "quantum deep learning", "remote sensing (rs)"]}