{"Title": "On the Performance of Clustered Fog Radio Access Networks With Data Compression", "Doi": "10.1109/TCOMM.2023.3252582", "Authors": ["h. hu", "y. jiang", "j. zhang", "q. chen", "j. zhang"], "Key Words": ["fog radio access networks", "data compression", "latency analysis", "matern cluster process", "m/g/1"], "Abstract": "the fog radio access network  f ran  has been proposed to address the strict latency requirements which offloads computation tasks generated in the user equipment  ue  to the edge to reduce the processing latency. however it incorporates the task transmission latency which may become the bottleneck of latency requirements. data compression  dc  has been considered as one of the promising techniques to reduce the transmission latency. by compressing the computation tasks before transmitting the transmission delay is reduced due to the shrink transmitted data size and the original computing task can be retrieved by employing data decompressing  dd  at the edge nodes or the centre cloud. nevertheless the dc and dd incorporate extra processing latency. for the f ran system the latency performance has not been investigated considering the dc and dd processes. therefore in this work the successful data compression probability  sdcp  i.e. the probability of the task execution latency being smaller than a target latency and the signal to interference ratio  sir  of the received signal being higher than a threshold is defined to analyse the latency performance of the dc enabled f ran. moreover to analyse the impact of compression offloading ratio  cor  which determines the proportion of tasks being compressed at the edge on the sdcp of the f ran a novel hybrid compression mode is proposed based on the queueing theory. based on this the closed form result of sdcp in the large scale dc enabled f ran is derived by combining the matern cluster process and m g/1 queueing model and validated by the monte carlo simulation. based on the derived sdcp results the effects of cor on the sdcp is analysed numerically. the results show that the sdcp with the optimal cor can be enhanced with a maximum value of 0.3 and 0.55 as compared with the cases of compressing all computing tasks at the edge and at the ue respectively. moreover for the system requiring the minimal latency the proposed hybrid compression mode can alleviate the requirement on the backhaul capacity.", "Pub Date": "2023-06-15"}