{"Title": "On the Development of a Protection Profile Module for Encryption Key Management Components", "Authors": ["n. sun", "c. -t. li", "h. chan", "m. z. islam", "m. r. islam", "w. armstrong"], "Pub Date": "2023-01-31", "Abstract": "the ability of a cryptographic system to protect information from attacks depends on many factors including the secrecy of the encryption key. a crucial aspect of any cryptosystem is how it manages the encryption keys. encryption key management  ekm  spans the entire life cycle of the key including the key‚äôs generation usage distribution renewal and destruction. given the security sensitivity it is desirable to adopt a widely accepted standard when developing an encryption key management system. through rigorous development of security requirements and following standardized validation evaluation and certification the consumers‚äô confidence in the security of the ekm system will be enhanced. the protection profile  pp  defined in the common criteria for information technology security evaluation  often referred to as common criteria or cc  specifies the security functional and assurance requirements for a specific technology. in this work we propose a pp module that is the new evolution of the pp covering trusted security features for ekm which is based on its compliance with the network device collaborative protection profile  ndcpp . in particular by analyzing threats and vulnerabilities of ekm systems corresponding security objectives and requirements are proposed in the pp along with the specification of evaluation activities. the quantum safe aspect of key distribution protocols is further investigated to support ekm products with quantum resistant algorithms and quantum key distribution features. in addition to presenting the development methodology and implementation process for the pp module of ekm we distill lessons learned from developing and validating the pp module to inspire future research efforts on defining security requirements with the cc.", "Doi": "10.1109/ACCESS.2023.3239043", "Key Words": ["cyber security", "common criteria", "protection profile", "encryption key management", "quantum safe"]}