{"Title": "On the Separation of Correlation-Assisted Sum Capacities of Multiple Access Channels", "Authors": ["a. seshadri", "f. leditzky", "v. siddhu", "g. smith"], "Pub Date": "2023-08-21", "Abstract": "the capacity of a channel characterizes the maximum rate at which information can be transmitted through the channel asymptotically faithfully. for a channel with multiple senders and a single receiver computing its sum capacity is possible in theory but challenging in practice because of the nonconvex optimization involved. to address this challenge we investigate three topics in our study. in the first part we study the sum capacity of a family of multiple access channels  macs  obtained from nonlocal games. for any mac in this family we obtain an upper bound on the sum rate that depends only on the properties of the game when allowing assistance from an arbitrary set of correlations between the senders. this approach can be used to prove separations between sum capacities when the senders are allowed to share different sets of correlations such as classical quantum or no signalling correlations. we also construct a specific nonlocal game to show that the approach of bounding the sum capacity by relaxing the nonconvex optimization can give arbitrarily loose bounds. owing to this result in the second part we study algorithms for non convex optimization of a class of functions we call lipschitz like functions. this class includes entropic quantities and hence these results may be of independent interest in information theory. subsequently in the third part we show that one can use these techniques to compute the sum capacity of an arbitrary two sender macs to a fixed additive precision in quasi polynomial time. we showcase our method by efficiently computing the sum capacity of a family of two sender macs for which one of the input alphabets has size two. furthermore we demonstrate with an example that our algorithm may compute the sum capacity to a higher precision than using the convex relaxation.", "Doi": "10.1109/TIT.2023.3274434", "Key Words": ["channel capacity", "multiuser channels", "optimization", "quantum entanglement", "quantum information science"]}