{"Title": "On-Device Signal Quality Guided and Embedded Physiologic Information for High Fidelity Continuous PPG Compression", "Authors": ["a. bose", "s. mukherjee", "j. k. chandra", "r. gupta", "d. ghosh"], "Pub Date": "2024-01-31", "Abstract": "photoplethysmography  ppg  is widely popularized in wearable gadgets for continuous health monitoring. the main challenge before the ppg based measurements is motion artifact  ma  corruption which often suppress vital physiological information like heart rate  hr  and respiratory rate  rr  which makes their extraction difficult and sometime erroneous. this work introduces a new approach of ppg multiclass signal quality assessment  sqa  using reservoir computing  rc  and tunable  ${q}$  factor wavelet transform  tqwt  for ppg compression. to ensure the post compression clinical usage hr and rr are embedded in the compressed bit stream at every 10 s ppg frame. for the evaluation a total of 200 records were utilized from three public datasets namely mimic ii iii waveform ppg rr benchmark  prrb  bidmc and 20 volunteers at our laboratory spanning a total duration of 7740 min. the technique showed good on device  arm v6 controller  performance on sqa  accuracy of 99.97%  and ppg compression  cr of 38.28 and percentage root mean squared difference  prd  of 3.04 at 125 hz sampling  using mimic data which are competitive with published works. the low end to end latency  51 ms  and run time memory  19.99 knowledge base  per 1 s ppg shows the usefulness for real time deployment. it was also showed that embedding the physiologic information in compressed data may reduce the post compression processing error in rr and hr by an amount of 5.61% and 31.23% respectively in corrupted ppg. the proposed technique can be utilized in high fidelity ppg monitoring applications under ambulatory measurement.", "Doi": "10.1109/TIM.2024.3351256", "Key Words": ["compression", "on-device implementation", "photoplethysmography (ppg)", "reservoir computing (rc)", "signal quality assessment (sqa)", "tunable q-factor wavelet transform (tqwt)"]}