{"Title": "On-Device Feeding Behavior Analysis of Grazing Cattle", "Authors": ["l. s. martinez-rau", "j. o. chelotti", "l. l. giovanini", "v. adin", "b. oelmann", "s. bader"], "Pub Date": "2024-03-25", "Abstract": "precision livestock farming  plf  leverages cutting edge technologies and data driven solutions to enhance the efficiency of livestock production its associated management and its welfare. continuous monitoring of the masticatory sound of cattle allows the estimation of dry matter intake classification of jaw movements  jms  and recognition of grazing and rumination bouts. over the past two decades algorithms for analyzing feeding sounds have seen improvements in performance and computational requirements. nevertheless in some cases these algorithms have been implemented on resource constrained electronic devices limiting their functionality to one specific task  either classifying jms or recognizing feeding activities  such as grazing and rumination . in this work we present an acoustic monitoring system that comprehensively analyzes grazing cattle‚äôs feeding behavior at multiple scales. this embedded system classifies different types of jms identifies feeding activities and provides predictor variables for estimating dry matter intake. results are transmitted remotely to a base station using long range communication  lora . two variants of the system have been deployed on a raspberry pi pico board based on a low power arm cortex m0+ microcontroller. both firmware versions make use of direct access memory sleep mode and clock gating techniques to minimize energy consumption. in laboratory experiments the first deployment consumes 20.1 mw and achieves an f1 score of 87.3% for the classification of jms and 87.0% for feeding activities. the second deployment consumes 19.1 mw and reaches an f1 score of 84.1% for jms and 83.5% for feeding activities. the modular design of the proposed embedded monitoring system facilitates integration with energy harvesting power sources for autonomous operation in field conditions.", "Doi": "10.1109/TIM.2024.3376013", "Key Words": ["edge computing", "embedded machine learning", "feeding behavior", "microcontroller", "on-device processing", "precision livestock farming (plf)"]}