{"Title": "Online Approximation Scheme for Scheduling Heterogeneous Utility Jobs in Edge Computing", "Doi": "10.1109/TNET.2022.3193381", "Authors": ["c. zhang", "h. tan", "h. huang", "z. han", "s. h. . -c. jiang", "g. li", "x. -y. li"], "Key Words": ["approximation algorithms", "scheduling", "edge computing"], "Abstract": "edge computing systems typically handle a wide variety of applications that exhibit diverse degrees of sensitivity to job latency. therefore a multitude of utility functions of the job response time need to be considered by the underlying job dispatching and scheduling mechanism. nonetheless previous studies in edge computing mainly focused on optimizing a single utility function across all jobs e.g. linear sigmoid or the hard deadline. in this paper we design online job dispatching and scheduling strategies in which different jobs can be categorized by different non increasing utility functions. our goal is to maximize the total utility of all scheduled jobs. we first prove that no online deterministic algorithm could achieve a competitive ratio better than the lower bound  $\\omega \\left {\\frac {1}{\\sqrt {\\epsilon }}}\\right $  under the  $ 1+\\epsilon $  speed augmentation model. we proceed to propose an online algorithm named as o4a for handling jobs with heterogeneous utilities. we prove that o4a is  $o\\left {\\frac {1}{\\epsilon ^{2}}}\\right $  competitive. we also design its distributed version i.e. do4a. we implement o4a and do4a on an edge computing testbed running deep learning inference jobs. with the production trace from google cluster our experimental and large scale simulation results indicate that o4a can increase the total utility by up to 50% compared with state of the art methods. besides the performance loss of do4a is only 2% compared with o4a with a small communication overhead involved. moreover both of our algorithms are robust to estimation errors in job processing time and transmission delay.", "Pub Date": "2023-02-15"}