{"Title": "Online Learning Aided Decentralized Multi-User Task Offloading for Mobile Edge Computing", "Doi": "10.1109/TMC.2023.3275851", "Authors": ["x. wang", "j. ye", "j. c. s. lui"], "Key Words": ["bandit feedback", "mobile edge computing", "multi-user offloading", "uncertain system-side information"], "Abstract": "mobile edge computing facilitates users to offload computation tasks to edge servers for meeting their stringent delay requirements. previous works mainly explore task offloading when system side information is given  e.g. server processing speed cellular data rate  or centralized offloading under system uncertainty. but both generally fall short of handling task placement involving many coexisting users in an uncertain environment. in this paper we develop a multi user offloading framework considering unknown yet stochastic system side information to enable a decentralized user initiated service placement under overlapping server coverage. specifically we formulate the dynamic task placement as an online multi user multi armed bandit process and propose a decentralized epoch based offloading  debo  to optimize user rewards which are subjected under network delay. we consider both cases without and with neighboring edge feedback once users‚äô tasks are processed where the latter incorporates system side information sharing among edge servers for an enhanced task placement. for both cases we show that debo can gradually deduce the optimal user server assignment during dynamic offloading thereby achieving a close to optimal service performance and tight $o \\log  {2}\\ \\ t $o log2t  regret. moreover we generalize debo to various common scenarios such as unknown reward gap dynamic entering or leaving of clients and fair reward distribution while further exploring when users‚äô offloaded tasks require heterogeneous computing resources. particularly we accomplish a sub linear regret for each of these instances. real measurements based evaluations corroborate the superiority of our offloading schemes over state of the art approaches in optimizing delay sensitive rewards.", "Pub Date": "2024-03-07"}