{"Title": "Online Large Signal EIS To Predict The LFP Cell State of Health", "Doi": "10.1109/RAMS51473.2023.10088223", "Authors": ["m. k√∂der", "m. loos", "t. winter", "m. glaser"], "Key Words": ["accelerated life testing", "large signal eis", "life data analysis", "lifepo4", "online prediction method"], "Abstract": "the knowledge about the state of health  soh  of battery based power supplies lead to an improvement of reliability and availability as well as a reduction of risk and maintenance effort in safety critical systems. diagnostic methods for an accelerated lifetime testing can already fulfill the requirement for predictability of the remaining lifetime. the key challenge of most of the commonly used methods is that they need a long measurement time are only static operational or offline feasible. the given safety critical applications of all electric subsea power systems or active exoskeletons requires an online running dynamic non destructive method which does only minimally influence the battery parameters while the measurement is being performed. the online and non destructive method large signal electrochemical impedance spectroscopy  lseis  in contrast offers the possibility to exclude this influence and guarantee a reliable and accurate diagnosis of the battery parameters. to fulfill the safety requirement the measurement method can perform in parallel to the normal operation and without charging or discharging the measured cells which provides an advantage to other methods.objective of the paper is to present a lseis based battery cell ageing model based on accelerated life testing. the model is challenged with capacity fade approaches presented in literature as well as the life testing data. one key question to be answered is whether the lseis based model can evaluate calendar and cyclic ageing precisely.a design of experiments  doe  covering the operating temperature   30¬∞c to 70¬∞c  the cycle number and idle time as parameters to investigate their influences on the lseis measurement results. the parameters idle time and cycle number are defined to be able to investigate the changes in the lseis measurement caused by calendar and cycle aging. regarding the doe seven different test groups each consisting of ten lithium ferrous phosphate  lifepo4/lfp  cells are setup. the gathered measurement data is compared with the results of the corresponding literature and the additionally measured capacity fade data to develop the lseis based aging model. with the use of the lseis and the established lseis aging model a parameter estimation for the soh as the basis for a remaining useful lifetime  rul  prediction can be made over a lifetime of 25 years and about 800 cycles. the ageing behavior can be adequately detected and considered in the measurement. the additional information of the currently valid ageing behavior further enhances the reliability of the measurement. in further research the lseis model will be developed to predict the battery pack soh based on a battery pack measurement.", "Pub Date": "2023-04-05"}