{"Title": "Online Knowledge Fusion Method for Fault Diagnosis of Power Plant Equipment", "Doi": "10.1109/ITAIC58329.2023.10408849", "Authors": ["y. xin", "l. chen", "y. yang"], "Key Words": ["knowledge graph", "knowledge extraction", "knowledge fusion"], "Abstract": "there are many types of documents in fossil fuel power station to describe equipment failures including maintenance records treatment diagnosis suggestions historical cases and equipment knowledge. the knowledge of equipment anomaly diagnosis and handling is scattered in different documents. extract and fuse scattered knowledge from these scattered documents to generate a knowledge graph for equipment fault di agnosis providing necessary decision support for maintenance personnel to discover and handle equipment faults. this article proposes an implementation method for extracting and integrating equipment fault knowledge from diverse and multi type text records to form a knowledge graph. a thermal power plant equipment fault q&a system based on the fusion of open source large language models and knowledge graphs has been developed. main contributions   1  a knowledge extraction algorithm integrating bert wwm model and pointer annotation method is proposed to extract entity relations of fault text jointly. experiments show that the method performs well in extracting overlapped triples and f1 is improved by 8.51 % compared with existing algorithms   2  a knowledge fusion model based on roberta bilstm is proposed which fully utilizes the feature information of the entity text to be disambiguated and the entity mention text and cap tures the interdependent features within the sentence through attention mechanism. the experiment shows that this method improves f1 by 9.56% compared to existing fusion algorithms.  3  based on the open source large model chatglm a fusion method of knowledge graph and large model chatglm was explored and a device fault question answering system for thermal power plants was implemented achieving high accuracy in practical applications.", "Pub Date": "2024-02-01"}