{"Title": "Online Distributed Learning-Based Load-Aware Heterogeneous Vehicular Edge Computing", "Doi": "10.1109/JSEN.2023.3283413", "Authors": ["l. zhu", "z. zhang", "l. liu", "l. feng", "p. lin", "y. zhang"], "Key Words": ["load balancing", "multiagent reinforcement learning", "online distributed optimization", "vehicular edge computing (vec)"], "Abstract": "vehicular edge computing  vec  is an emerging enabler in strengthening driving efficiency and traffic safety. however both performance bottlenecks and low resource efficiency of heterogeneous edge servers arise concurrently because of the inhomogeneous load distribution among the servers. further the unsaturated infrastructure coverage situation can deteriorate the concurrent issues. although transmitting raw task data with large sizes among heterogeneous edge servers can relieve the concurrent issues it distinctly degrades the core network‚äôs efficiency especially during rush hours. meanwhile it cannot settle the unsaturated coverage situation. to relieve the concurrent issues without degrading the core network‚äôs efficiency we introduce an aerial relay station  ars  that can flexibly relay vehicular tasks to nearby heterogeneous edge servers. the long term task scheduling problem without any prior environment knowledge for the considered vehicular edge system is crucial but still up in the air. we formulate the system latency minimization problem as a partially observable stochastic game  posg . then a model free multiagent reinforcement learning algorithm is developed to search the real time load aware scheduling policy. besides we design a practical factor named offloading latency gain to assist the training process of the learning algorithm. simulation experiments show that our proposed algorithm  pa  can better exploit idle computation resources of heterogeneous edge infrastructures and significantly reduce the average system latency up to 15%‚äì20% over existing algorithms.", "Pub Date": "2023-08-01"}