{"Title": "Optimizing Logging and Monitoring in Heterogeneous Cloud Environments for IoT and Edge Applications", "Doi": "10.1109/JIOT.2023.3304373", "Authors": ["c. kim", "s. kim"], "Key Words": ["cloud computing", "internet of things (iot)", "resource management"], "Abstract": "as data is becoming more and more important internet of things  iot  devices are widely used to collect information and process data from various industries such as finance autonomous driving and smart factories. to address the limited computational power of iot devices in processing real time data both edge computing which utilizes nearby computers with greater computation capabilities and cloud computing with even more processing power are widely adopted solutions. as these systems have heterogeneous software and hardware configurations it can be challenging to understand the behavior of the application from the perspective of different resources. in this article we propose an efficient logging and monitoring system in large scale heterogeneous environments for iot and edge applications. to do this our scheme first collects system resource usage data from each compute node using the operating system‚äôs native system analysis tool. then it consolidates the system resource usage information from multiple nodes into an integrated database which creates a comprehensive view of the system. finally our scheme provides global system resource information in terms of specific jobs and nodes providing a comprehensive understanding of complex heterogeneous hardware software stacks. our evaluation using iot and edge workloads in heterogeneous systems demonstrates the efficiency of logging and monitoring schemes. the average network usage for windows and linux is 0.12 and 1.29 knowledge base s respectively resulting in minimal network overhead. in addition the proposed scheme shows negligible overhead in terms of both runtime  up to 0.73%  and storage  0.0474% .", "Pub Date": "2023-12-11"}