{"Title": "Optimal Resource Management for Hierarchical Federated Learning Over HetNets With Wireless Energy Transfer", "Doi": "10.1109/JIOT.2023.3271692", "Authors": ["r. hamdi", "a. b. said", "e. baccour", "a. erbad", "a. mohamed", "m. hamdi", "m. guizani"], "Key Words": ["device association", "energy efficiency", "heterogeneous wireless networks (hetnets)", "hierarchical federated learning (hfl)", "wireless energy transfer (wet)"], "Abstract": "remote monitoring systems analyze the environment dynamics in different smart industrial applications such as occupational health and safety and environmental monitoring. specifically in industrial internet of things  iiot  systems the huge number of devices and the expected performance put pressure on resources such as computational network and device energy. distributed training of machine and deep learning  ml dl  models for intelligent industrial iot applications is very challenging for resource limited devices over heterogeneous wireless networks  hetnets . hierarchical federated learning  hfl  performs training at multiple layers offloading the tasks to nearby multiaccess edge computing  mec  units. in this article we propose a novel energy efficient hfl framework enabled by wireless energy transfer  wet  and designed for heterogeneous networks with massive multiple input‚äìmultiple output  mimo  wireless backhaul. our energy efficiency approach is formulated as a mixed integer nonlinear programming  minlp  problem where we optimize the hfl device association and manage the wireless transmitted energy. however due to its high complexity we design a heuristic resource management algorithm namely h2rma that respects energy channel quality and accuracy constraints while presenting a low computational complexity. we also improve the energy consumption of the network using an efficient device scheduling scheme. finally we investigate device mobility and its impact on the hfl performance. our extensive experiments confirm the high performance of the proposed resource management approach in hfl over hetnets in terms of training loss and grid energy costs.", "Pub Date": "2023-09-22"}