{"Title": "Optimal Granularity of Machine Learning Models: A Perspective of Granular Computing", "Doi": "10.1109/TFUZZ.2023.3346410", "Authors": ["w. pedrycz", "x. wang"], "Key Words": ["confidence", "coverage", "gaussian process (gp)", "generative-discriminative clustering", "granular embedding", "information granules", "specificity"], "Abstract": "designing machine learning models followed by their deployment in a real world environment has been an area of recent pursuits resulting in a large number of successful applications. in particular these applications target environments that call for a great deal of autonomy and criticality of the developed constructs and ensuing decision processes. an efficient design carefully structured advanced architecture high performance and efficient learning methods are of paramount importance. equally desired is the confidence of any result produced by the numeric model. in this study we advocate that the associated information granularity of the numeric models and their results inherently link with the notion of specificity of information granularity. the confidence of results can be quantified in the form of an information granule where the two associated criteria of granular outcomes such as coverage and specificity are crucial to the holistic evaluation of the granularity of the results. it is shown that these two characteristics are conflicting and their quality becomes evaluated and optimized. two main approaches are studied in depth. the first one concerns a granular embedding of numeric models. in the second one we consider a synergistic environment of gaussian process models whose results come as probabilistic information granules and can be transformed into interval information granules. an interesting architecture of a rule based model constructed with the use of innovative clustering takes into account the generative discriminative aspect of the process of structure discovery which is accomplished through the optimization of some augmented objective functions. this model is investigated with regard to the two approaches to the design of the mechanism of granular assessment of results. some illustrative examples are covered to show the essentials of the design process.", "Pub Date": "2024-04-01"}