{"Title": "Optimizing Training Efficiency and Cost of Hierarchical Federated Learning in Heterogeneous Mobile-Edge Cloud Computing", "Doi": "10.1109/TCAD.2022.3205551", "Authors": ["y. cui", "k. cao", "j. zhou", "t. wei"], "Key Words": ["device frequency determination", "federated learning (fl)", "high efficiency", "low cost", "mobile-edge cloud computing (mecc)", "user selection"], "Abstract": "federated learning  fl  an emerging distributed machine learning  ml  technique allows massive embedded devices and a server to work together for training a global ml model without collecting user data on a server. most existing approaches adopt the traditional centralized fl paradigm with a single server  one is the cloud centric fl paradigm and the other is the edge centric fl paradigm. the cloud centric fl paradigm is able to manage a large scale fl system across massive user devices with high communication cost whereas the edge centric fl paradigm is capable of coordinating a small scale fl system benefiting from the low communication delay over wireless networks. to fully exploit the advantages of both in this article we develop a distinctive hierarchical fl framework for the promising mobile edge cloud computing  mecc  system called helchfl to achieve high efficiency and low cost hierarchical fl training. in particular we formulate the corresponding theoretical foundation for our helchfl to ensure hierarchical training performance. furthermore to address the inherent communication and user heterogeneity issues of fl training our helchfl develops a utility driven and heterogeneity aware heuristic user selection strategy to enhance training performance and reduce training delay. subsequently by analyzing and utilizing the slack time in fl training our helchfl introduces a device operating frequency determination approach to reduce training energy cost. experiments demonstrate that our helchfl can enhance the highest accuracy by up to 52.93% gain the training speedup of up to 483.74% and obtain up to 45.59% training energy savings compared to state of the art baselines.", "Pub Date": "2023-04-20"}