{"Title": "Optimized Task Scheduling and Virtual Object Management Based on Digital Twin for Distributed Edge Computing Networks", "Doi": "10.1109/ACCESS.2023.3325475", "Authors": ["r. xu", "c. -w. park", "s. khan", "w. jin", "s. j. s. moe", "d. h. kim"], "Key Words": ["internet of things", "edge computing", "federated learning", "digital twin", "task management", "hyper-parameter optimization"], "Abstract": "in this paper we address the challenge of limited resources in internet of things  iot  devices by proposing a solution based on digital twin in distributed edge computing networks. edge computing is a promising approach that moves computing resources closer to the network‚äôs edge to reduce response times in iot applications. however simply offloading tasks from iot devices to edge computing does not accelerate user control. to enhance task performance and improve user management experience we introduce optimized task scheduling and virtual object management based on a digital twin concept. our system incorporates virtualization synchronization visualization and simulation functionalities to provide digital twin capabilities. additionally we develop a user friendly web application with a graphical user interface  gui  for intuitive management of edge computing services. to support our approach we implement an edge computing supervisor that generates virtualized objects such as edge gateways iot devices and services. these virtual objects serve as resources for creating tasks. using our proposed digital twin platform users can dynamically create new tasks based on demand easily deploy and execute tasks in specific locations and dynamically allocate edge network resources according to task requirements. an optimized task scheduling mathematical model is presented to compare task scheduling done with and without optimization. further the edge computing and digital twin based optimized task scheduling method is integrated with federated learning for collaborative learning and privacy preserved computation of sensors sensitive data. we demonstrate the effectiveness of our system by generating tasks for data collection related to indoor environment for prediction of predicted mean vote  pmv  for thermal comfort index of smart homes occupants using http and iotivity based devices in distributed edge computing networks. these tasks are properly delivered and executed on the expected edge gateways showcasing the successful integration of our digital twin platform with edge computing networks. further the optimized task scheduling has improved the overall performance of the proposed system keeping in view latency and processing time.", "Pub Date": "2023-10-25"}