{"Title": "Optimal Control of Wireless Powered Edge Computing System for Balance Between Computation Rate and Energy Harvested", "Doi": "10.1109/TASE.2022.3183633", "Authors": ["c. hou", "q. zhao"], "Key Words": ["wireless powered edge computing system (wpecs)", "wireless power transfer (wpt)", "task-offloading", "energy consumption", "constrained markov decision process (cmdp)"], "Abstract": "wireless powered edge computing system  wpecs  enhances the computing power and extends the lifetime of wireless devices  wds . this paper studies the wpecs with multiple wds in which the access point  ap  provides some transmission channels which differ from each other in the channel gain and the wd powered through the wireless power transfer  wpt  technology has some indivisible tasks and adopts binary task offloading actions. more energy harvested strengthens the wds with more computing power while corresponding to more energy consumption. therefore how to make the optimal tradeoff between computation rate and energy harvested arises as an interesting issue. to address this issue this paper first formulates the switch process of transmission channel as a constrained markov decision process  cmdp  and then proposed an effective algorithm to maximize the sum of computation rates of all wds in terms of task data bits computed within the required level of accumulative energy harvested. theoretical analysis simulations and field experiments jointly document and illustrate its performance. note to practitioners‚äîthis paper addresses the interesting tradeoff between computation rate and energy harvested in a wireless powered edge computing system that operates in the environments with limited available energy. it helps to improve the operation efficiency of the edge computing systems in the area of internet of things  iot  or cyber physical systems  cps  that employ wireless power transfer technology to power the wireless devices through the access point over the air to maximize the sum of computations rates of all wds in terms of task data bits computed while keeping the accumulative energy harvested within a range. simulations and experimental investigations show that the solution proposed here outperforms existing solutions.", "Pub Date": "2023-04-06"}