{"Title": "Optimal Task-Offloading Control for Edge Computing System With Tasks Offloaded and Computed in Sequence", "Doi": "10.1109/TASE.2022.3176745", "Authors": ["c. hou", "q. zhao"], "Key Words": ["edge computing system (ecs)", "task-offloading ordering", "direct acyclic graph (dag)", "execution latency"], "Abstract": "this paper considers the edge computing system  ecs  in which the tasks with dependencies are offloaded and computed in sequence. different task offloading orderings come with different ecs memory cache execution latency  emcel  which is caused by writing and reading  wr  the computed results of earlier offloaded tasks between the ecs memory and cache. therefore the optimal ordering to offload all the tasks while leading to the minimum emcel arises as an interesting issue in practice. this requires to solve a hard exponential explosion optimization problem. to address this issue this paper first formulates the tasks and their dependencies as a direct acyclic graph  dag  then converts the exponential explosion problem into a discrete problem that can be solved in polynomial time and finally develops some theoretical conditions to guide to determine the optimal task offloading orderings. a novel algorithm called otooa to find the optimal task offloading orderings in polynomial time is proposed. field experiments show that otooa outperforms the existing algorithms. to our best knowledge this is the initial work towards this issue. note to practitioners‚äîfor the edge computing system that operates in the application scenarios in which the ecs cache is small while the size of the tasks is relatively large such that it is not allowed for multiple tasks to be processed in the ecs cache parallelly or at the same time e.g. the execution latency sensitive and fast big data processing scenarios in which the multiple tasks depending on the other are offloaded and computed in sequence this paper helps such edge computing system to improve the operation efficiency with the minimum emcel by finding an optimal task offloading ordering to guide the wireless devices to offload their tasks to the ecs server. experimental investigations show that the solution proposed here outperforms existing ones.", "Pub Date": "2023-04-06"}