{"Title": "Optimizing Mobility-Aware Task Offloading in Smart Healthcare for Internet of Medical Things Through Multiagent Reinforcement Learning", "Doi": "10.1109/JIOT.2023.3338718", "Authors": ["c. dong", "y. sun", "m. shafiq", "n. hu", "y. liu", "z. tian"], "Key Words": ["edge computing", "mobility aware", "multiagent reinforcement learning", "task offloading", "internet of medical things (iomt)"], "Abstract": "in the scenario of smart healthcare applications the internet of medical things  iomt  devices equipped with limited resources would offload numerous computation heavy tasks to an edge server through 5g networks. however iomt devices should usually move around different diagnostic areas in smart healthcare systems leading to the dynamics of the uplink channel quality. moreover the burst generation of a substantial number of tasks from iomt devices can result in congestion within the computing queue of the edge server and heterogeneous services in iomt devices make it hard to collect global information for a central controller to get the optimal optimization for all iomt devices. so how to determine task offloading among iomt devices in a distributed scenario of smart healthcare applications should be considered appropriately and comprehensively. in this article we investigate task offloading in mobile edge computing  mec  through wireless networks. to improve the utilization of wireless resources nonorthogonal multiple access  noma  is adopted in 5g networks. we first formulate the mobility of iomt devices as a hidden markov model  hmm  and the problem of task offloading policy as a distributed partial markov decision process  dec pomdp . then we propose a mobility aware method based on multiagent reinforcement learning for task offloading in 5g noma enabled networks. in our approach task offloading scheduling for each iomt device in noma enabled 5g networks is considered to improve energy efficiency and guarantee service quality. besides the time complexity and the existence of a nash equilibrium for our proposed dec pomdp method are theoretically derived. simulations are conducted to show that our algorithm outperforms other alternative methods in energy consumption under the delay constraint.", "Pub Date": "2024-04-09"}