{"Title": "Origin of Low-Frequency Noise in Si n-MOSFET at Cryogenic Temperatures: The Effect of Interface Quality", "Authors": ["h. oka", "t. inaba", "s. shitakata", "k. kato", "s. iizuka", "h. asai", "h. fuketa", "t. mori"], "Pub Date": "2023-11-06", "Abstract": "this study investigates the origin of low frequency  lf  1/ $f$  noise in si n channel metal oxide semiconductor field effect transistors  n mosfets  under cryogenic operation. the fluctuation of the drain current increased with decreasing temperature exhibiting lf 1/ $f$  noise of more than two orders of magnitude higher at 2.5 k compared with that at 300 k. as revealed by the temperature dependence of the normalized current spectral density the lf 1/ $f$  noise at 2.5 k is primarily governed by carrier number fluctuations. to obtain insight into the carrier trapping centers under cryogenic operation we investigate the effect of oxide si interface states on the lf 1/ $f$  noise by utilizing si n mosfets with different surface orientations i.e. different interface trap densities   $\\text{d} {\\mathrm {it}}$  . the lf 1/ $f$  noise is comparable between the surface orientations at 300 k whereas excess noise was observed at 2.5 k for the surface orientation with higher  $\\text{d} {\\mathrm {it}}$  in the order of  100 <  120  $\\le $  110  orientations. this indicates that the lf 1/ $f$  noise at cryogenic temperatures originates from oxide si interface defects and disorders that is the interface states and band tail states. these states are localized at the conduction band edge which contributes to noise generation as the fermi level approaches the conduction band edge at cryogenic temperatures. this study demonstrates the significance of the oxide si interface quality in suppressing the lf 1/ ${f}$  noise in si mos devices operated at cryogenic temperatures.", "Doi": "10.1109/ACCESS.2023.3327731", "Key Words": ["quantum computer", "cryogenic temperature", "si spin qubit", "mosfet", "low-frequency 1/f noise", "surface orientation", "interface states", "band tail states"]}