{"Title": "Parallel Offloading and Resource Optimization for Multi-Hop Ad Hoc Network-Enabled CBTC With Mobile Edge Computing", "Doi": "10.1109/TVT.2023.3318259", "Authors": ["y. fang", "m. li", "f. r. yu", "p. si", "r. yang", "c. gao", "y. sun"], "Key Words": ["multi-hop ad hoc network", "communication-based train control (cbtc)", "urban rail transport", "mobile edge computing (mec)", "network resource allocation"], "Abstract": "the emergence of communication based train control  cbtc  system within urban rail transport has improved the efficiency of safe train operations. at the same time the cbtc system enhances the reliability of the train system and lowers latency of the data transmission. nevertheless there are still certain critical issues that need to be considered in the cbtc  1  limited coverage and high maintenance costs of wayside equipment  2  multiple ground devices configuration and complex system architecture  and 3  insufficient computing capacity of the train leads to heavy latency and energy consumption. to cope with the above problems in this article the multi hop ad hoc network coexisting with train to train communication and train to wayside communication is applied to simplify the networking architecture together with the employment of mobile edge computing  mec  servers to provide massive computing and communication resources for trains. meantime a new cbtc framework is developed for computing offloading and resource allocation via multi hop ad hoc network and mec. offloading decisions offloading ratio computing and communication resource allocation are integrated to minimize latency and energy consumption. furthermore the proposed problem is a mixed integer non convex problem that is transformed into a solvable convex problem and the consensus alternating direction method of multipliers based  admm  algorithm is employed to solve the problem. the simulation results show that our proposed method has remarkable advantages over other schemes.", "Pub Date": "2024-02-12"}