{"Title": "Paralinguistics-Enhanced Large Language Modeling of Spoken Dialogue", "Doi": "10.1109/ICASSP48485.2024.10446933", "Authors": ["g. -t. lin", "p. g. shivakumar", "a. gandhe", "c. -h. h. yang", "y. gu", "s. ghosh", "a. stolcke", "h. -y. lee", "i. bulyko"], "Key Words": ["spoken dialogue modeling", "large language models", "paralinguistics", "speech sentiment analysis"], "Abstract": "large language models  large language model  have demonstrated superior abilities in tasks such as chatting reasoning and question answering. however standard large language model may ignore crucial paralinguistic information such as sentiment emotion and speaking style which are essential for achieving natural human like spoken conversation especially when such information is conveyed by acoustic cues. we therefore propose paralinguistics enhanced generative pretrained transformer  paralingpt  an large language model that utilizes text and speech modalities to better model the linguistic content and paralinguistic attributes of spoken dialogue. the model takes the conversational context of text speech embeddings and paralinguistic attributes as input prompts within a serialized multitasking multimodal framework. specifically our framework serializes tasks in the order of current paralinguistic attribute prediction response paralinguistic attribute prediction and response text generation with autoregressive conditioning. we utilize the switchboard 1 corpus including its sentiment labels as the paralinguistic attribute as our spoken dialogue dataset. experimental results indicate the proposed serialized multitasking method outperforms typical sequence classification techniques on current and response sentiment classification. furthermore leveraging conversational context and speech embeddings significantly improves both response text generation and sentiment prediction. our proposed framework achieves relative improvements of 6.7% 12.0% and 3.5% in current sentiment accuracy response sentiment accuracy and response text bleu score respectively.", "Pub Date": "2024-03-18"}