{"Title": "Partially Concatenated Calderbank-Shor-Steane Codes Achieving the Quantum Gilbert-Varshamov Bound Asymptotically", "Authors": ["j. fan", "j. li", "y. wang", "y. li", "m. -h. hsieh", "j. du"], "Pub Date": "2022-12-22", "Abstract": "in this paper we utilize a concatenation scheme to construct new families of quantum error correction codes achieving the quantum gilbert varshamov  gv  bound asymptotically. weconcatenate alternant codes with any linear code achievingthe classical gv bound to construct calderbank shor steane  css  codes. we show that the concatenated code can achieve the quantum gv bound asymptotically and can approach the hashing bound for asymmetric pauli channels. by combing steane‚äôs enlargement construction of css codes we derive a family of enlarged stabilizer codes achieving the quantum gv bound for enlarged css codes asymptotically. asapplications we derive two families of fast encodable and decodable css codes with parameters  $\\mathscr {q} {1}=[[n\\omega  \\sqrt {n} \\omega  \\sqrt {n} ]]$  and  $\\mathscr {q} {2}=[[n\\omega  n/\\log n \\omega  n/\\log n /\\omega  \\log n ]]$ . we show that  $\\mathscr {q} {1}$  can be encoded very efficiently by circuits of size  $o n $  and depth  $o \\sqrt {n} $ . for an input error syndrome  $\\mathscr {q} {1}$  can correct any adversarial error of weight up to half the minimum distance bound in  $o n $  time.  $\\mathscr {q} {1}$  can also be decoded in parallel in  $o \\sqrt {n} $  time by using  $o \\sqrt {n} $  classical processors. for an input error syndrome we proved that  $\\mathscr {q} {2}$  can correct a linear number of  ${x}$  errors with high probability and an almost linear number of  ${z}$  errors in  $o n $  time. moreover  $\\mathscr {q} {2}$  can be decoded in parallel in  $o \\log  n  $  time by using  $o n $  classical processors.", "Doi": "10.1109/TIT.2022.3201239", "Key Words": ["stabilizer code", "calderbank-shor-steane code", "asymmetric quantum code", "quantum gilbert-varshamov bound", "pauli channel"]}