{"Title": "Pay-Per-Proof: Decentralized Outsourced Multi-User PoR for Cloud Storage Payment Using Blockchain", "Authors": ["h. cui", "z. wan", "t. zhaolu", "h. wang", "a. miyaji"], "Pub Date": "2024-03-07", "Abstract": "cloud computing has been widely applied in data storage but cloud computing is not armed with an efficient integrity check mechanism for users to learn whether their large volumes of data have been kept intact by the cloud. the concept of proofs of retrievability  por  was introduced to address such an issue by enabling users to check the integrity of their data stored by the cloud. but por requires users to regularly send queries to the cloud and its integrity check method cannot be extended to share the verification responsibility in the multi user setting where different users store the same data to the cloud. with such concerns in mind we put forth a notion called outsourced multi user proofs of retrievability  $\\mathtt {omtpor}$omtpor  which allows users with the same data stored by the cloud to share the information for the integrity check and a third party is required to regularly check data integrity on behalf of users using the shared information. we give a concrete construction of $\\mathtt {omtpor}$omtpor based on the homomorphic property of an existing property and analyze its security. to enforce honest integrity checks we build the concrete $\\mathtt {omtpor}$omtpor construction over the blockchain using smart contracts to guarantee the honesty of participants yielding a decentralized outsourced multi user por solution that utilizes the blockchain miners as the third parties. furthermore our solution enables the cloud server to obtain payment for the storage service if the por is verified by the miners. we fully implement the $\\mathtt {omtpor}$omtpor scheme over the blockchain to evaluate its performance which demonstrates obvious superiority over traditional por schemes without the detection of data duplication.", "Doi": "10.1109/TCC.2023.3343710", "Key Words": ["blockchain", "cloud computing", "integrity", "multi-user", "poofs of retrievability"]}