{"Title": "Performance Enhancement of Lead-Free CsSnI3 Perovskite Solar Cell: Design and Simulation With Different Electron Transport Layers", "Authors": ["m. f. wahid", "m. s. rahman", "n. ahmed", "a. a. mamun", "m. n. howlader", "t. paul", "m. m. r. tareq", "m. s. rahman", "m. m. rahman"], "Pub Date": "2024-01-19", "Abstract": "cssni3 is a promising lead free material that shows potential as a substitute for lead based material in the development of ecologically benign perovskite solar cells  pscs  due to its low cost high efficiency and excellent thermal stability. this research is intended to enhance the efficiency of cssni3 based pscs by employing numerical simulation through the one dimensional solar cell capacitance simulator  scaps 1d  to optimize the optoelectronic properties of the electron transport layer  etl  absorber layer hole transport layer  htl  and different interface layers. an investigation was conducted to evaluate the influence of different etls namely ws2 znse c60 and pcbm on the performance of cssni3 based pscs utilizing poly  3 hexylthiophene 25 diyl   p3ht  as the htl. moreover the influence of variations in the thickness doping density and defect density of the absorber layer etl and htl on key photovoltaic parameters including power conversion efficiency  pce  short circuit current density   $\\text{j} {sc}$   open circuit voltage   $\\text{v} {oc}$   and fill factor  ff  was observed. the findings revealed that depending on the etl employed the pce varies between the structures. for structures using ws2 znse c60 and pcbm as etl the corresponding pce values are 31.63% 29.64% 29.75% and 29.62%. additionally for all psc structures the effects of interface defect temperature series shunt resistance capacitance voltage characteristics and mott schottky plot have been observed and the corresponding current density voltage  j v  quantum efficiency  qe  generation and recombination rates have been computed. finally the outcomes of this analysis were compared with prior research conducted on cssni3 based pscs thereby offering significant perspectives for their advancement and commercial viability.", "Doi": "10.1109/ACCESS.2024.3352444", "Key Words": ["lead-free", "cssni‚çé", "perovskite solar cell", "photovoltaic cells", "pscs", "etl", "htl", "scaps-1d"]}