{"Title": "Performance Indicator-Based Adaptive Model Selection for Offline Data-Driven Multiobjective Evolutionary Optimization", "Authors": ["z. liu", "h. wang", "y. jin"], "Pub Date": "2023-09-15", "Abstract": "a number of real world multiobjective optimization problems  mops  are driven by the data from experiments or computational simulations. in some cases no new data can be sampled during the optimization process and only a certain amount of data can be sampled before optimization starts. such problems are known as offline data driven mops. although multiple surrogate models approximating each objective function are able to replace the real fitness evaluations in evolutionary algorithms  eas  their approximation errors are easily accumulated and therefore mislead the solution ranking. to mitigate this issue a new surrogate assisted indicator based ea for solving offline data driven multiobjective problems is proposed. the proposed algorithm adopts an indicator based selection ea as the baseline optimizer due to its selection robustness to the approximation errors of surrogate models. both the kriging models and radial basis function networks  rbfns  are employed as surrogate models. an adaptive model selection mechanism is designed to choose the right type of models according to a maximum acceptable approximation error that is less likely to mislead the indicator based search. the main idea is that when the uncertainty of the kriging models exceeds the acceptable error the proposed algorithm selects rbfns as the surrogate models. the results comparing with state of the art algorithms on benchmark problems with up to ten objectives indicate that the proposed algorithm is effective on offline data driven optimization problems with up to 20 and 30 decision variables.", "Doi": "10.1109/TCYB.2022.3170344", "Key Words": ["indicator-based evolutionary algorithm (ea)", "kriging models", "model selection", "offline data-driven multiobjective optimization", "radial basis function networks (rbfns)", "surrogate models"]}