{"Title": "Personalized Secure Demand-Oriented Data Service Toward Edge-Cloud Collaborative IoT", "Doi": "10.1109/JIOT.2022.3199937", "Authors": ["d. wu", "m. sun", "p. zhang", "y. tu", "z. yang", "r. wang"], "Key Words": ["demand-oriented data service", "edge-cloud collaboration", "internet of things (iot)", "personalized search", "privacy preserving"], "Abstract": "demand oriented data service can provide the physical entity information for internet of things  iot  users conveniently and quickly. the traditional cloud oriented data service architecture has been inapplicable to the state time varying and privacy sensitive entity data in iot due to long response delay and the risk of privacy leakage for the entities and users respectively. the edge based architecture lacks global service function although it can alleviate problems with cloud services. moreover existing demand oriented data service ignores the characteristics of ‚äúthousands of people have thousands of faces‚äù and the implicit intents of users which results in limited service quality and weak user experience. to solve the above problems a personalized secure demand oriented data service scheme is proposed. specifically an edge cloud collaborative architecture is designed to realize privacy preserving timely response and personalized search combining the advantages of edge and cloud. to achieve the personalized service for iot users a time span fused personalized ranking method  tsfpr  is proposed to deeply perceive individual demands via mining user preferences with temporal evolution characteristics. finally an edge cloud collaborative personalized secure data service approach  ecpss  oriented different search modes is presented to achieve encryption data matching and personalized reranking thereby improving the service quality of the iot system synthetically. security analysis and simulation demonstrate the effectiveness of the proposed method in terms of privacy preserving data service time and personalized performance.", "Pub Date": "2022-12-22"}