{"Title": "Personalized Transfer Learning for Single-Lead ECG-Based Sleep Apnea Detection: Exploring the Label Mapping Length and Transfer Strategy Using Hybrid Transformer Model", "Authors": ["s. hu", "y. wang", "j. liu", "c. yang"], "Pub Date": "2023-09-22", "Abstract": "objective  automatic sleep apnea  sa  detection based on deep learning  dl  and single lead electrocardiogram  ecg  has been extensively studied. we aim to explore the impact of different dl model structures and label mapping length  lml  on personalized transfer learning  tl  providing personalized tl applicability conditions based on the proposed hybrid transformer model  htm . methods  two dl models a pure convolutional neural network  cnn  based model  pcm  and a proposed htm are included in the study. eight different lmls are considered. furthermore various personalized tl strategies are introduced to thoroughly explore the impact. finally two sided t tests are utilized to evaluate the significance. results  in the same database the average accuracy and auc for the personalized pcm are 0.8412 and 0.9002 respectively with  $p < 0.001$  while the hybrid transformer based personalized model achieves an average accuracy of 0.8537 and an average auc of 0.9147 with  $p < 0.001$ . across databases the accuracy and auc of personalized htm reach 0.8271 and 0.8724 respectively and  $p < 0.001$ . conclusion  the increase in lml has a beneficial impact on the general model  gm  and personalized model for different model structures. the htm exhibits better performance in both gm and personalized tl compared to the pcm. additionally personalized tl achieves significant improvement when utilizing only positive samples within the same database. however it is more advantageous to utilize only negative samples when performing cross database personalized tl. significance  this article provides guidance for personalized tl in sa detection and provides an htm based personalized tl method.", "Doi": "10.1109/TIM.2023.3312698", "Key Words": ["electrocardiogram (ecg)", "hybrid transformer", "sleep apnea (sa)", "transfer learning (tl)"]}