{"Title": "Phoenix: Transformative Reconfigurability for Edge IoT Devices in Small-Scale IoT Systems", "Doi": "10.1109/ACCESS.2023.3339154", "Authors": ["m. moghaddassian", "s. shafaghi", "p. habibi", "a. leon-garcia"], "Key Words": ["bare metal provisioning", "infrastructure automation", "internet of things", "reconfigurability"], "Abstract": "transformative reconfigurability refers to the ability of changing the current software stack of a configurable device by fully replacing its existing one. in the context of iot systems such major device reconfigurations can be used to change the role adapt new functionality and keep reconfigurable iot devices compatible with the iot systems requirements as the ambient technology around them evolve thus fostering a thriving and continuously connected iot environment. in this paper we introduce phoenix an iot device configuration management system that is designed to automate transformative reconfigurability for edge iot devices at small scales. edge iot devices are typically computationally capable and configurable devices that have enough processing power to run user programs and control sensors and embedded devices in an iot environment. enabling transformative reconfigurability for such devices at small scales can increase iot systems flexibility efficiency and adaptability in small iot environments for example agri farms smart homes micro grids and the like. phoenix manages the life cycle of edge iot devices configuration and uses bare metal provisioning to provide unattended installation of new software stacks that are defined by user intents that instruct the reconfiguration process. we implemented a phoenix proof of concept system and deployed it on the savi testbed where we evaluated its performance in reconfiguring a variety of edge iot devices under different network conditions. our results indicate that phoenix can meet the requirements of small scale heterogeneous iot systems in various application environments.", "Pub Date": "2023-12-15"}