{"Title": "Phonocardiogram Classification by Learning From Positive and Unlabeled Examples", "Authors": ["e. a. nehary", "s. rajan"], "Pub Date": "2024-03-22", "Abstract": "the advent of deep learning has rekindled research in computer aided auscultation for the classification of phonocardiogram  pcg  signals. deep learning techniques require a large labeled dataset for training. however labeling large datasets is a formidable task. to create the large labeled dataset the labeled pcg signal records are segmented cycle wise and the labels of the records are passed on to all the cycles of the record. although this label inheritance may be appropriate for segments of the normal pcg signals it may be inappropriate for abnormal pcgs and therefore may result in the wrong labeling of cycles of abnormal pcg signals. to address this issue we propose positive unlabeled  pu  learning based on a two step technique deep learning model for the classification of pcg signals where pcg segments of normal records are considered positive exemplars and pcg segments of abnormal records are considered unlabeled. to attain the final results a voting method is employed using a differential evolution  de  algorithm and majority voting. the system was evaluated using a dataset from the 2016 physionet computing in cardiology challenge. the proposed system achieved exceptional record classification performance with a score of about 0.95. regardless of an imbalanced dataset the method achieved balanced specificity and sensitivity values of about 0.94 and 0.95 respectively. additionally the proposed system outperformed existing human pcg binary classification systems. in conclusion utilizing pu learning and convolutional neural network  cnn  techniques for diagnosing heart sounds can lead to effective and efficient classification.", "Doi": "10.1109/TIM.2024.3372221", "Key Words": ["attention", "deep learning", "differential evolution (de) algorithm", "fractional fourier transform (frft)", "heart sound", "mel-frequency spectral coefficients (mfscs)", "phonocardiogram (pcg)", "positive unlabeled (pu) learning"]}