{"Title": "PhraseMap: Attention-Based Keyphrases Recommendation for Information Seeking", "Doi": "10.1109/TVCG.2022.3225114", "Authors": ["y. tu", "r. qiu", "y. -s. wang", "p. -y. yen", "h. -w. shen"], "Key Words": ["textual data", "machine learning", "visual analytics", "natural language processing", "user-in-the-loop"], "Abstract": "many information retrieval  ir  approaches have been proposed to extract relevant information from a large corpus. among these methods phrase based retrieval methods have been proven to capture more concrete and concise information than word based and paragraph based methods. however due to the complex relationship among phrases and a lack of proper visual guidance achieving user driven interactive information seeking and retrieval remains challenging. in this study we present a visual analytic approach for users to seek information from an extensive collection of documents efficiently. the main component of our approach is a phrasemap where nodes and edges represent the extracted keyphrases and their relationships respectively from a large corpus. to build the phrasemap we extract keyphrases from each document and link the phrases according to word attention determined using modern language models i.e. bert. as can be imagined the graph is complex due to the extensive volume of information and the massive amount of relationships. therefore we develop a navigation algorithm to facilitate information seeking. it includes  1  a question answering  qa  model to identify phrases related to users‚äô queries and  2  updating relevant phrases based on users‚äô feedback. to better present the phrasemap we introduce a resource controlled self organizing map  rc som  to evenly and regularly display phrases on grid cells while expecting phrases with similar semantics to stay close in the visualization. to evaluate our approach we conducted case studies with three domain experts in diverse literature. the results and feedback demonstrate its effectiveness usability and intelligence.", "Pub Date": "2024-01-30"}