{"Title": "PID Controller for PMSM Speed Control Based on Improved Quantum Genetic Algorithm Optimization", "Authors": ["h. wang", "s. xu", "h. hu"], "Pub Date": "2023-06-22", "Abstract": "when traditional proportional integral and differential controllers are applied to speed control in permanent magnet synchronous motors  pmsm  their coefficients are basically determined based on experience which inevitably leads to unsatisfactory results when using this parameter to control the speed stability of permanent magnet synchronous motors. therefore this paper proposes an improved quantum genetic algorithm using quantum states as the basic unit. utilizing quantum properties for global optimization to optimize the coefficients of proportional integral and differential control improving the rotation angle of quantum state particles through the idea of velocity changes in particle swarm optimization  pso  introducing adaptive weight changes using hadamard gates to replace traditional algorithm mutation strategies and incorporating disaster mechanisms. in addition this paper uses four test functions to find the minimum value thereby verifying that our algorithm has better performance in optimization iteration compared to other algorithms providing the initial basis for the next step of application in pid parameter optimization. prove that this method can solve the problem of traditional genetic algorithms falling into local optima due to improper selection crossover and mutation methods which cannot effectively control the stability of motor speed. finally this paper uses matlab2018a simulation to compare with the other four algorithms and the results show that this algorithm can find better pid parameter values to achieve better results in motor oscillation overshoot and faster target speed.", "Doi": "10.1109/ACCESS.2023.3284971", "Key Words": ["particle swarm optimization (pso)", "permanent magnet synchronous motor (pmsm)", "proportional integral and differential (pid)", "quantum genetic algorithm (qga)"]}