{"Title": "Play&Go Corporate: An End-to-End Solution for Facilitating Urban Cyclability", "Authors": ["a. bucchiarone", "s. bassanelli", "m. luca", "s. centellegher", "p. cipriano", "l. giovannini", "b. lepri", "a. marconi"], "Pub Date": "2023-12-01", "Abstract": "mobility plays a fundamental role in modern cities. how citizens experience the urban environment access city core services and participate in city life strongly depends on its mobility organization and efficiency. the challenges that municipalities face are very ambitious  on the one hand administrators must guarantee their citizens the right to mobility and to easily access local services  on the other hand they need to minimize the economic social and environmental costs of the mobility system. municipalities are increasingly facing problems of traffic congestion road safety energy dependency and air pollution and therefore encouraging a shift towards sustainable mobility habits based on active mobility is of central importance. active modes such as cycling should be particularly encouraged especially for local recurrent journeys  e.g. home‚äìto‚äìschool home‚äìto‚äìwork . in this context addressing and mitigating commuter generated traffic requires engaging public and private stakeholders through innovative and collaborative approaches that focus not only on supply  e.g. roads and vehicles  but also on transportation demand management. in this paper we present and end to end solution called play&go corporate for enabling urban cyclability and its concrete exploitation in the realization of a home to work sustainable mobility campaign  i.e. bike2 work  targeting employees of public and private companies. to evaluate the effectiveness of the proposed solution we developed two analyses  the first to carefully analyze the user experience and any behaviour change related to the bike2 work mobility campaign and the second to demonstrate how exploiting the collected data we can potentially inform and guide the involved municipality  i.e. ferrara a city in northern italy  in improving urban cyclability.", "Doi": "10.1109/TITS.2023.3256133", "Key Words": ["sustainable mobility", "active mobility", "smart city", "motivational systems", "engagement", "behaviour change", "play&go corporate"]}