{"Title": "PoolImagen: Text-to-Image Diffusion Models With an Efficient Transformer Without Attention", "Doi": "10.1109/ICAIIC60209.2024.10463464", "Authors": ["h. ku", "m. lee", "k. ko", "s. j. baek"], "Key Words": ["text-to-image synthesis", "diffusion models", "image generation", "transformer"], "Abstract": "recent advancements in the field of image generation models have been particularly notable for diffusion models. imagen has the most remarkable image generation capabilities among these models particularly at high resolutions. however imagen comes with limitations as creating high quality results requires considerable computational resources and lengthy training times. to address these limitations we propose poolimagen a novel and improved variant of imagen that combines high performance with low computational costs. poolimagen introduces various improvements to overcome the constraints of imagen. notably we adopted the idea first propose in metaformer which suggests replacing the attention module with a pooling structure in the transformer architecture of imagen to mitigate the issues related to increased training costs and computational complexity. additionally considering the influence of text encoder size on text to image transformation quality we incorporate the large language models  e.g. flan t5 xxl  an extension of the t5 model that offers more parameters and refined text processing capabilities. with a well trained transformer poolimagen achieves image generation with consistent performance and significantly accelerated training velocities. in experiments based on bird image datasets poolimagen demonstrates improved performance in terms of fr√©chet inception distance  fid  and training time. in the case of the bird datasets poolimagen exhibits an approximately 11.29% improvement in fid compared to imagen while training time is reduced by 2.25 times. in addition we conducted additional experiments to evaluate ability of poolimagen to represent domain specific features in generated images. these findings emphasize the potential of poolimagen as a powerful tool for rapidly generating text to image outputs and suggest promising directions for enhancing the future performance of diffusion models.", "Pub Date": "2024-03-20"}