{"Title": "PPO-Based Autonomous Transmission Period Control System in IoT Edge Computing", "Doi": "10.1109/JIOT.2023.3293511", "Authors": ["g. h. lee", "h. park", "j. w. jang", "j. han", "j. k. choi"], "Key Words": ["autonomous transmission period control", "bollinger bands", "data quality", "data reduction", "deep reinforcement learning (drl)", "energy consumption", "energy efficiency", "internet of things (iot)"], "Abstract": "with the recent explosive growth of the internet of things  iot  edge computing is emerging as a modern computing paradigm that coexists with the cloud to process massive amounts of data particularly distributed at the edge network. meanwhile edge computing directly permits the use of artificial intelligent  ai  models at the edge. currently in numerous iot applications a tremendous amount of data is being measured and transmitted from iot sensors to monitor surrounding information in real time. considering that continuous transmission of sensed data substantially requires high energy consumption of iot sensors this article proposes a proximal policy optimization  ppo  based autonomous transmission period control  ppo atpc  system in iot edge computing that can automatically and adaptively control the transmission period of each iot sensor. here the design of state action and reward is shaped in an unprecedented way and furthermore a ppo which is one of the most effective model free deep reinforcement learning  drl  algorithms is fully leveraged to achieve an optimal or nearly optimal policy that can significantly shorten the data volume while maintaining high data quality. the merits of the proposed ppo atpc are extensively validated through quantitative comparison with other alternative approaches using three different sensor data collected from real time environmental monitoring and in depth insights into the effectiveness of ppo atpc are further provided from diverse perspectives. the performance results show that total data volume for each data set could be reduced by 73.849% 89.931% and 81.310% with the average root mean square error of 0.322 13.896 and 0.048.", "Pub Date": "2023-12-11"}