{"Title": "Practical Quantum Anonymous Private Information Retrieval Based on Quantum Key Distribution", "Authors": ["y. -g. yang", "b. -x. liu", "g. -b. xu", "y. -h. zhou", "w. -m. shi"], "Pub Date": "2023-07-10", "Abstract": "quantum anonymous private information retrieval  qapir  allows a user to retrieve an item from a database anonymously thus achieving better user privacy. recently khan et al. proposed the first qapir protocol  ieee trans. commun. 2022  which is the only known qapir protocol. however a symbol coincidence error occurs when the main ingredients are combined to form this qapir protocol. furthermore it requires perfect   $n + 1$   partite  $d$  dimensional greenberger horne zeilinger  ghz  states to be pre shared among the nodes where  $d \\geq n$  and  $n$  is the size of the database. however the difficulties in implementing the preparation of high dimensional ghz states and the quantum computing based queries under current technologies lead to the impracticability of this qapir protocol due to the extremely high dimensionalities of ghz states and oracle operations when large databases are involved. to address these issues we first point out the symbol coincidence error in khan et al.‚äôs qapir protocol and then give an improvement on it. finally we propose a practical qapir protocol based on quantum key distribution. we analyze its performance under certain types of noise. we also prove the security of our qapir protocol in an active adversary scenario where active dishonest users and database owner are taken into account. compared with khan et al.‚äôs protocol our protocol is easier to implement under current technologies and can work over the noisy quantum channel. it provides a practical way for the design of qapir protocols.", "Doi": "10.1109/TIFS.2023.3288989", "Key Words": ["symmetric private information retrieval", "quantum private information retrieval", "anonymity", "privacy", "multipartite entanglement"]}