{"Title": "Predictive Service Provisioning With Online Learning in Wireless Edge Networks", "Doi": "10.1109/TMC.2023.3286847", "Authors": ["t. wu", "x. fan", "h. wei", "y. qu", "c. xiang", "p. yang", "f. wu"], "Key Words": ["mobile edge computing", "predictive service provisioning", "spatio-temporal data mining", "submodular optimization"], "Abstract": "mobile edge computing  mec  technology can be implemented at cellular base stations enabling flexible and configurable provisions of services for mobile users to access. nevertheless the conventional solutions mainly focus on statical service provisioning which ignores the dynamic nature of the arriving service requests. in this work we first conduct comprehensive data driven observations on over 4 million service requests throughout 9800 base stations. our key findings suggest that users‚äô demands intrinsically exhibit spatial and temporal patterns which inevitably lead to performance degradation in statical service provisioning. motivated by that we design and implement mobiedge a predictive service provisioning system with online learning in wireless edge networks. we propose a graph embedding learning based model for representation learning thus to achieve accurate request prediction at different base stations. then based on the prediction of incoming service requests we study the service provisioning reconfiguration problem i.e. how to jointly optimize service placement and corresponding request scheduling across dual timescales under constraints of network resources and the total budget. by leveraging the submodular technique we transform the research issue into a submodular function maximization problem under the $q$q independence system constraint where $q$q is a positive constant related to the ratio of coefficients in constraint conditions. on this basis we propose a $1/ 1+q $1/ 1+q  approximation algorithm with rigorous theoretical analysis on the bounded maximum utility. extensive trace driven evaluations are conducted over networks of different scales and mobiedge shows remarkable performance enhancements by achieving the accuracy of up to 98% in service prediction and an average utility of 92.9% to the optimal solution in service provisioning.", "Pub Date": "2024-04-04"}