{"Title": "Predictive Cruise Control Under Cloud Control System for Urban Bus Considering Queue Dissipation Time", "Doi": "10.1109/TIV.2023.3235352", "Authors": ["b. gao", "q. chen", "y. liu", "k. wan", "k. li"], "Key Words": ["predictive cruise control", "cloud control system", "queue dissipation time estimation", "dynamic programming", "receding optimization"], "Abstract": "the driving conditions of urban consecutive signalized intersections are one of the main research scenarios for vehicle speed trajectory optimization and typical for bus driving where frequent acceleration and deceleration before and after the intersection can intensify the energy consumption of the bus. prior research has predictive cruise controlled under intelligent transportation system which is not feasible to directly communicate with controllers‚äô units of intelligent connected vehicles. besides the effect of queue dissipation is a topic that has received less attention in recent related work. therefore this paper proposes a vehicle cloud hierarchical architecture based on cloud control system at first under which a predictive cruise control for urban buses is deployed. given the impact of intersection queue length and dissipation time on vehicle driving a queue dissipation time estimation model based on shockwave theory is proposed to predict changes in intersection traffic state. the queue dissipation time equivalent to the extension of the red light window is reflected in the constraints of the receding distance horizon dynamic programming  rdhdp  algorithm for solving the optimal control problem. eventually comparison simulations a segment of realistic trip between adjacent stops are presented. the results show that the proposed method saves 44.94%‚äì56.74% of energy consumption and at least 26.8s of waiting time compared to human drivers and 22.72%‚äì41.27% of energy consumption compared to vehicle with the intelligent vehicle infrastructure cooperative systems.", "Pub Date": "2023-05-22"}