{"Title": "Price Competition in Multi-Server Edge Computing Networks Under SAA and SIQ Models", "Doi": "10.1109/TMC.2022.3227675", "Authors": ["z. chen", "q. ma", "l. gao", "x. chen"], "Key Words": ["edge computing", "selfish computation offloading", "price competition", "potential game", "m/m/1 queue theory"], "Abstract": "with the proliferation of edge computing many business entities deploy their own edge servers to compete for users which forms multi server edge computing networks. however no prior work studies the competition among heterogeneous edge servers and how the competition affects users‚äô selfish computation offloading behaviors in such a network from an economic perspective. in this paper we model the interactions between edge servers and users as a two stage game. in stage i edge servers with heterogeneous marginal costs set their service prices to compete for users and in stage ii each user selfishly offloads its task to one of the edge servers or the remote cloud. analyzing the equilibrium of the two stage game is challenging due to edge servers‚äô heterogeneity and the congestion effect caused by resource sharing among users. we first investigate the equilibrium when edge servers follow the serve as arrive  saa  model  i.e. serving all offloaded tasks simultaneously  and then extend our analysis to the serve in queue  siq  model  i.e. serving offloaded tasks one by one following the m m/1 queue rule . under the saa model we prove that users‚äô selfish computation offloading game in stage ii is a potential game and admits a unique nash equilibrium  ne  for which we derive the explicit expressions. furthermore for edge servers‚äô price competition game in stage i we characterize the conditions for the uniqueness of the ne and derive its explicit expression. under the siq model we derive the unique ne of users‚äô selfish computation offloading game and show that the ne of edge servers‚äô price competition game may not always exist. we compare the equilibrium under the two service models and show that at equilibrium edge servers with low marginal costs can achieve higher profits under the siq model when edge servers‚äô computation capacity is large or the delay incurred on the cloud is moderate  however edge servers with high marginal costs can obtain higher profits under the saa model in most cases.", "Pub Date": "2023-12-05"}