{"Title": "Privacy-Preserving Federated Learning for Internet of Medical Things Under Edge Computing", "Doi": "10.1109/JBHI.2022.3157725", "Authors": ["r. wang", "j. lai", "z. zhang", "x. li", "p. vijayakumar", "m. karuppiah"], "Key Words": ["edge computing", "edge gateway", "federal learning", "internet of medical things", "privacy protection"], "Abstract": "edge intelligent computing is widely used in the fields such as the internet of medical things  iomt  which has advantages including high data processing efficiency strong real time performance and low network delay. however there are many problems including privacy disclosure limited calculation force as well as scheduling and coordination issues. federated learning can greatly improves training efficiency. however due to the sensitive nature of the healthcare data the aforementioned approach of transferring the patient‚äôs data to the servers may create serious security and privacy issues. therefore this article proposes a privacy protection scheme for federated learning under edge computing  ppflec . first of all we propose a lightweight privacy protection protocol based on a shared secret and weight mask which is based on a random mask scheme of secret sharing. it is more accurate and efficient thanhomomorphic encryption. it can not only protect gradient privacy without losing model accuracy but also resist equipment dropping and collusion attacks between devices. second we design an algorithm based on a digital signature and hash function which achieves the integrity and consistency of the message as well as resisting replay attacks. finally we propose a periodic average training strategy compared with differential privacy to prove that our scheme is 40$\\%$ faster in efficiency than in deferential privacy. meanwhile compared with federated learning we can achieve the same efficiency under the condition of ensuring safety. therefore our scheme can work well in unstable edge computing environments such as smart healthcare.", "Pub Date": "2023-02-03"}