{"Title": "Prognostics and Health Management of Rotating Machinery via Quantum Machine Learning", "Authors": ["c. b. s. maior", "l. m. m. ara√∫jo", "i. d. lins", "m. d. c. moura", "e. l. droguett"], "Pub Date": "2023-03-17", "Abstract": "prognostics and health management  phm  concerns predicting machines‚äô behavior to support maintenance decisions through failure modes diagnosis and prognosis. diagnosis is broadly applied in the context of rotating machines‚äô state classification using several traditional machine learning  ml  and deep learning  dl  methods. recently quantum computing  qc  a new and expanding research field has contributed to different purposes and contexts such as optimization artificial intelligence simulation cybersecurity pharmaceutics and the energy sector. despite the current limitations in terms of hardware qc has been studied as an alternative for improving models‚äô speed and computational efficiency. specifically this paper proposes a quantum machine learning  qml  approach to diagnose rolling bearings which are essential components in rotating machinery based on vibration signals. we apply hybrid models involving the encoding and construction of parameterized quantum circuits  pqc  connected to a classical neural network the multi layer perceptron  mlp . we consider combinations of the variational quantum eigensolver  vqe  framework with rotation gates and different entanglement  two qubits  gates  cnot cz and iswap . for each pqc configuration we assess the impact of the number of layers  1 5 and 10 . we use two databases of different complexity levels not previously explored with qml namely cwru and jnu with 10 and 12 failure modes respectivel. for cwru all qml models presented higher accuracy than the classical mlp. for jnu all qml models were superior to classical mlp as well. these results suggest that despite the current limitations of quantum environments qml models are promising tools to be further investigated in phm.", "Doi": "10.1109/ACCESS.2023.3255417", "Key Words": ["quantum machine learning", "prognostic and health management", "fault diagnosis", "vibration signal"]}