{"Title": "Progressive Feature Transmission for Split Classification at the Wireless Edge", "Doi": "10.1109/TWC.2022.3221778", "Authors": ["q. lan", "q. zeng", "p. popovski", "d. g√ºnd√ºz", "k. huang"], "Key Words": ["edge computing", "edge artificial intelligence (ai)", "split learning", "convolutional neural network (cnn)", "progressive transmission", "automatic repeat request (arq)"], "Abstract": "we consider the scenario of inference at the wireless edge in which devices are connected to an edge server and ask the server to carry out remote classification that is classify data samples available at edge devices. this requires the edge devices to upload high dimensional features of samples over resource constrained wireless channels which creates a communication bottleneck. the conventional feature pruning solution would require the device to have access to the inference model which is not available in the current split inference scenario. to address this issue we propose the progressive feature transmission  progressftx  protocol which minimizes the overhead by progressively transmitting features until a target confidence level is reached. a control policy is proposed to accelerate inference comprising two key operations  importance aware feature selection at the server and transmission termination control. for the former it is shown that selecting the most important features characterized by the largest discriminant gains of the corresponding feature dimensions achieves a sub optimal performance. for the latter the proposed policy is shown to exhibit a threshold structure. specifically the transmission is stopped when the incremental uncertainty reduction by further feature transmission is outweighed by its communication cost. the indices of the selected features and transmission decision are fed back to the device in each slot. the control policy is first derived for the tractable case of linear classification and then extended to the more complex case of classification using a convolutional neural network. both gaussian and fading channels are considered. experimental results are obtained for both a statistical data model and a real dataset. it is shown that progressftx can substantially reduce the communication latency compared to conventional feature pruning and random feature transmission strategies.", "Pub Date": "2023-06-09"}