{"Title": "Project and Implementation of a Quantum Logic Gate Emulator on FPGA Using a Model-Based Design Approach", "Authors": ["a. giorgio"], "Pub Date": "2024-03-25", "Abstract": "quantum computing emulators are widely used for testing quantum algorithms ideally before executing them on real quantum processors. therefore researchers are very active in developing emulators primarily on fpgas. this project is complex and requires a long time and a specific expertise if carried out following the low level design approach using a hardware description language  hdl . this paper describes step by step the process of quick designing a quantum gate emulator using a much simpler high level design approach. it begins with the development of a quantum gate simulator in the matlab¬æ environment and subsequently translates it into an hdl design for fpga implementation by using the matlab‚äôs hdl coder toolbox. however while code translation may seem straightforward using matlab toolboxes it becomes a non trivial task when transitioning from a quantum computing simulator to an hdl based quantum computing emulator. thus it was necessary to conduct an in depth study to implement a quantum computing simulator in matlab enabling an error free translation of hdl code. the developed method enables the designer to leverage the highly useful and straightforward model based design approach offered by matlab rather than directly the more complex hdl approach returning a highly optimized hdl code for configuring the fpga as a quantum computing emulator. this topic makes the design of quantum emulators on fpga quick reliable optimized and without the need for specialized hardware design skills. additionally two implementation examples have been described using altera intel fpga on development boards de1 soc and de5a net ddr4 provided by terasic inc.", "Doi": "10.1109/ACCESS.2024.3377458", "Key Words": ["computer applications", "fpga", "quantum computing", "matlab"]}