{"Title": "Pseudo-Labeling With Large Language Models for Multi-Label Emotion Classification of French Tweets", "Doi": "10.1109/ACCESS.2024.3354705", "Authors": ["u. malik", "s. bernard", "a. pauchet", "c. chatelain", "r. picot-cl√©mente", "j. cortinovis"], "Key Words": ["multi-label emotion classification", "semi-supervised learning", "pseudo-labeling", "chat-gpt"], "Abstract": "this study proposes a novel semi supervised multi label emotion classification approach for french tweets based on pseudo labeling. human subjectivity in emotional expression makes it difficult for a machine to learn. therefore it necessitates training supervised learning models on large datasets annotated by multiple annotators. however creating such datasets can be costly and time consuming. moreover aggregating annotations from multiple annotators to capture their collective emotional state adds complexity to the task. semi supervised learning techniques have shown effectiveness with limited datasets. furthermore large language models  llms  particularly chat gpt have demonstrated superior annotation accuracy compared to annotations obtained from crowdsourcing platforms when both are evaluated against expert annotated data. this work introduces a novel approach for multi label emotion classification of french tweets by leveraging pseudo labels generated through chat gpt a robust large language model. using zero shot one shot and few shot learning techniques chat gpt annotates the unlabelled part of our dataset. these chat gpt annotated pseudo labels are then merged with manual annotations facilitating the training of a multi label emotion classification model via semi supervised learning. furthermore within the context of our research we present a new french tweet dataset containing testimonials from people affected by an urban industrial incident. this dataset features 2350 tweets each manually annotated by three human annotators based on 8 pre identified emotions. benchmark results are presented for multi label emotion classification models employing both fully supervised and semi supervised approaches with pseudo labeling. our findings demonstrate the superiority of our approach for multi label emotion classification over standard pseudo labeling and an established baseline.", "Pub Date": "2024-02-02"}