{"Title": "PSNN-TADA: Prototype and Stochastic Neural Network-Based Twice Adversarial Domain Adaptation for Fault Diagnosis Under Varying Working Conditions", "Authors": ["x. yang", "x. yuan", "t. ye", "w. zhu", "f. zhou", "j. jin"], "Pub Date": "2023-12-22", "Abstract": "the varying working conditions of rolling bearings lead to data distribution shifts which presents an obstacle to intelligent fault diagnosis. to alleviate the performance degradation unsupervised domain adaptation  da  is used to address the issue where the test set has a different distribution from the training set. most existing intelligent transfer fault diagnosis methods align features by using either a fixed metric or a domain discriminator to tackle data distribution divergence. however the alignment of decision boundaries in fault classifiers has not been thoroughly studied causing ambiguous predictions on unlabeled target domain samples and catastrophic performance degradation in fault diagnosis. to overcome the deficiencies a novel diagnosis framework named prototype and stochastic neural network based twice adversarial da  psnn tada  is proposed to extract domain invariant fault features under varying working conditions. in particular psnn tada has two adversarial training processes at different levels. first psnn tada has a prototype based discriminator using multimodal information to achieve conditional domain alignment. second psnn tada learns reliable decision boundaries from an adversarial process between the extractor and the stochastic classifier which further improves the accuracy of the classifier on target fault samples. the proposed method is comprehensively tested on both an open access dataset and a practical fault diagnosis platform and extensive experimental results illustrate that psnn tada achieves superior adaptation performance compared with the state of the art.", "Doi": "10.1109/TIM.2023.3338678", "Key Words": ["conditional domain adversarial", "intelligent fault diagnosis", "stochastic classifier", "unsupervised domain adaptation (da)", "varying working conditions"]}