{"Title": "PUF-CIM: SRAM-Based Compute-In-Memory With Zero Bit-Error-Rate Physical Unclonable Function for Lightweight Secure Edge Computing", "Doi": "10.1109/TVLSI.2023.3277517", "Authors": ["z. chen", "m. wu", "y. zhou", "r. li", "j. tan", "d. ding"], "Key Words": ["compute-in-memory (cim)", "multiply-and-accumulate (mac)", "physical unclonable function (puf)", "static random access memory (sram)"], "Abstract": "with the rapid development of the internet of things  iot  compute in memory  cim  is a promising candidate for edge computing which eliminates the need for frequent data transfer between the memory and processing units. on one hand cim provides an efficient approach to achieve deep neural network  dnn  inference  on the other hand its security issues such as model leakage are ignored in most of state of the art studies. in the resource limited conditions it is essential to develop a lightweight secure scheme for cim without significantly sacrificing its performance. in this work a physical unclonable function  puf  cim macro based on static random access memory  sram  is proposed for lightweight model protection. an sram based puf extracts unique and stable keys from the mismatch of multirow discharge rate and further achieves zero bit error rate  ber  under temperature and voltage fluctuations by the on chip masking technique. besides we propose a 10t sram bit cell to perform xor operation and multiply and accumulate  mac  operation in the same cell which avoids weight movement during encryption and decryption. the whole process including key generation xor encryption and ciphertext mac operation has been realized. the test chip is designed and fabricated in a 55 nm cmos process. experimental results show that the proposed puf with on chip masking can provide zero unstable bits and ber under temperature and voltage variations. the proposed puf cim achieves 96.20% inference accuracy in mnist. besides it presents 93.35‚äì121.38 tops w energy efficiency and 1324.24 gops throughput. compared with the normal cim the proposed puf cim can enhance artificial intelliegence model security only with accuracy loss of 1% and energy efficiency degradation of 16.1%.", "Pub Date": "2023-07-25"}