{"Title": "PUF-Based Mutual Authentication and Key Exchange Protocol for Peer-to-Peer IoT Applications", "Authors": ["y. zheng", "w. liu", "c. gu", "c. -h. chang"], "Pub Date": "2023-07-10", "Abstract": "peer to peer  p2p  or direct connection iot has become increasingly popular owing to its lower latency and higher privacy compared to database driven or server based iot. however wireless vulnerabilities raise severe concerns on iot device to device communication. this is further aggravated by the challenge to achieve lightweight direct mutual authentication and secure key exchange between iot peer nodes in p2p iot applications. physical unclonable function  puf  is a key enabler to lightweight low power and secure authentication of resource constrained devices in iot. nevertheless current puf enabled authentication protocols with or without the challenge response pairs  crps  of each of its interlocutors stored in the verifier side are incompatible for p2p iot scenarios due to the security storage and computing power limitations of iot devices. to solve this problem a new lightweight puf based mutual authentication and key exchange protocol is proposed. it allows two resource constrained puf embedded endpoint devices to authenticate each other directly without the need for local storage of crps or any private secrets and simultaneously establish the session key for secure data exchange without resorting to the public key algorithm. the proposed protocol is evaluated using the game based formal security analysis method as well as the automatic security analysis tool proverif to corroborate its mutual authenticity secrecy and resistance against replay and man in the middle  mitm  attacks. using two avnet ultra96 v2 boards to emulate the two iot endpoint devices a physical prototype system is also constructed to demonstrate and validate the feasibility of the proposed secure p2p connection scheme. a comparative analysis shows that the proposed protocol outperforms related protocols in terms of security features computational complexity as well as communication and storage costs.", "Doi": "10.1109/TDSC.2022.3193570", "Key Words": ["peer-to-peer internet of things", "iot security", "physical unclonable functions", "peer-entity authentication protocol", "authenticated key exchange protocol", "man-in-the-middle attacks"]}