{"Title": "Q-RTOP: Quantum-Secure Random Transaction Ordering Protocol for Mitigating Maximal Extractable Value Attacks in Blockchains With a Priority Gas-Fee Policy", "Authors": ["n. k. sinai", "h. p. in"], "Pub Date": "2024-01-22", "Abstract": "public blockchains such as ethereum rely on decentralized networks of peer to peer nodes known as validators or miners to verify all transactions and create new valid blocks. these validators can prioritize transactions primarily based on high gas fees allowing miners to maximize their block rewards a concept referred to as maximal extractable value  mev . however mev is vulnerable to front running back running and sandwich attacks  fbsas  and is exploited by malicious nodes and bots to manipulate users‚äô valuable transactions. these malicious activities adversely impact the blockchain‚äôs scalability transparency and security. flashbots as one of the solutions introduces centralization since all nodes have to forward all blocks to the central node. to address these issues we have designed a new blockchain transaction ordering protocol called quantum random transaction ordering protocol  q rtop . the proposed protocol operates on top of the existing blockchain transaction ordering mechanism. however instead of allowing validators to select transactions based on high gas fees decentralized nodes running q rtop securely randomize all transactions and then forward them to the validators which proceed with the block validation without any change. our protocol primarily focuses on randomizing transactions before being processed by the validators by utilizing a quantum random generator as a secure source of randomness. the final results demonstrated that q rtop effectively secured user transactions and randomized 8192 transactions within 25 milliseconds.", "Doi": "10.1109/ACCESS.2024.3351830", "Key Words": ["back-running", "front-running", "maximal extractable value (mev)", "quantum computing", "quantum-resistance algorithm", "quantum random number", "sandwich attack"]}