{"Title": "QTT-DLSTM: A Cloud-Edge-Aided Distributed LSTM for Cyber‚ÄìPhysical‚ÄìSocial Big Data", "Doi": "10.1109/TNNLS.2022.3140238", "Authors": ["x. wang", "l. ren", "r. yuan", "l. t. yang", "m. j. deen"], "Key Words": ["big data", "cloud-edge computing", "cyber‚äìphysical‚äìsocial system (cpss)", "long short-term memory (lstm)", "tensor"], "Abstract": "cyber‚äìphysical‚äìsocial systems  cpss  an emerging cross disciplinary research area combines cyber‚äìphysical systems  cps  with social networking for the purpose of providing personalized services for humans. cpss big data recording various aspects of human lives should be processed to mine valuable information for cpss services. to efficiently deal with cpss big data artificial intelligence  ai  an increasingly important technology is used for cpss data processing and analysis. meanwhile the rapid development of edge devices with fast processors and large memories allows local edge computing to be a powerful real time complement to global cloud computing. therefore to facilitate the processing and analysis of cpss big data from the perspective of multi attributes a cloud edge aided quantized tensor train distributed long short term memory  qtt dlstm  method is presented in this article. first a tensor is used to represent the multi attributes cpss big data which will be decomposed into the qtt form to facilitate distributed training and computing. second a distributed cloud edge computing model is used to systematically process the cpss data including global large scale data processing in the cloud and local small scale data processed at the edge. third a distributed computing strategy is used to improve the efficiency of training via partitioning the weight matrix and large amounts of input data in the qtt form. finally the performance of the proposed qtt dlstm method is evaluated using experiments on a public discrete manufacturing process dataset the li ion battery dataset and a public social dataset.", "Pub Date": "2023-10-05"}