{"Title": "Quantum-Inspired Moth Flame Optimizer Enhanced Deep Learning for Automated Rice Variety Classification", "Authors": ["h. m. alshahrani", "m. k. saeed", "s. s. alotaibi", "a. mohamed", "m. assiri", "s. s. ibrahim"], "Pub Date": "2023-11-14", "Abstract": "automated rice variety detection and classification is a task that includes automatically categorizing and identifying varieties or different types of rice based on different characteristics namely grain texture shape color and size. this process is essential for quality assessment agricultural management and research purposes. deep learning  dl  is a subfield of machine leaching  ml  that focuses on training an artificial neural network  ann  with multiple layers to learn hierarchical representations of data. convolutional neural network  cnn  was widely applied in image based tasks such as rice variety detection as they could efficiently capture visual features and patterns. in this study we propose an automated rice variety detection and classification using quantum inspired moth flame optimizer with deep learning  arvdc qimfodl  technique. the presented arvdc qimfodl technique focuses on the automated identification and classification of distinct kinds of rice varieties. to accomplish this the arvdc qimfodl technique uses the median modified wiener filter  mmwf  technique for the noise removal process. followed by the feature extraction process takes place by an improved shufflenet model. for rice variety detection and classification the long short term memory  lstm  approach was applied. at last the qimfo algorithm based hyperparameter selection process is performed to optimize the detection results of the lstm system. the simulation outcome of the arvdc qimfodl method is tested on a rice image dataset. an extensive set of experiments showed the remarkable efficiency of the arvdc qimfodl system over other models.", "Doi": "10.1109/ACCESS.2023.3330918", "Key Words": ["rice variety", "computer vision", "deep learning", "moth flame optimizer", "image processing", "quantum computing"]}