{"Title": "Quantum Secure Non-Malleable Codes in the Split-State Model", "Authors": ["d. aggarwal", "n. g. boddu", "r. jain"], "Pub Date": "2023-12-27", "Abstract": "non malleable codes introduced by dziembowski et al.  2018  encode a classical message  $s$  in a manner such that the tampered codeword either decodes to the original message  $s$  or a message that is unrelated independent of  $s$ . constructing non malleable codes for various tampering function families has received significant attention in the recent years. we consider the well studied  2 part  split state model in which the message  $s$  is encoded into two parts  $x$  and  $y$  and the adversary is allowed to arbitrarily tamper with each  $x$  and  $y$  individually. non malleable codes in the split state model have found applications in other important security notions like non malleable commitments and non malleable secret sharing. thus it is vital to understand if such non malleable codes are secure against quantum adversaries. we consider the security of non malleable codes in the split state model when the adversary is allowed to make use of arbitrary entanglement to tamper the parts  $x$  and  $y$ . we construct explicit quantum secure non malleable codes in the split state model. our construction of quantum secure non malleable codes is based on the recent construction of quantum secure 2 source non malleable extractors by boddu et al.  2021 . 1  we extend the connection of cheraghchi and guruswami  2016  between 2 source non malleable extractors and non malleable codes in the split state model in the classical setting to the quantum setting i.e. we show that explicit quantum secure 2 source non malleable extractors in  $ k {1}k {2}   \\mathsf {qpa  state} $  framework of boddu et al.  2021  give rise to explicit quantum secure non malleable codes in the split state model. 2  we construct the first quantum secure non malleable code with efficient encoding and decoding procedures for message length  $m=n^{\\omega  1 }$  error  $\\varepsilon =2^{ n^{\\omega  1 }}$  and codeword of size  $2n$ . prior to this work it remained open to provide such quantum secure non malleable code even for a single bit message in the split state model. 3  we also study its natural extension when the tampering of the codeword is performed  $t$  times. we construct quantum secure one many non malleable code with efficient encoding and decoding procedures for  $t=n^{\\omega  1 }$  message length  $m=n^{\\omega  1 }$  error  $\\varepsilon =2^{ n^{\\omega  1 }}$  and codeword of size  $2n$ . 4  as an application we also construct the first quantum secure 2 out of 2 non malleable secret sharing scheme for message secret length  $m=n^{\\omega  1 }$  error  $\\varepsilon =2^{ n^{\\omega  1 }}$  and share of size  $n$ .", "Doi": "10.1109/TIT.2023.3328839", "Key Words": ["multi-source extractors", "non-malleable extractors", "non-malleable codes", "quantum security"]}