{"Title": "Quantum2FA: Efficient Quantum-Resistant Two-Factor Authentication Scheme for Mobile Devices", "Authors": ["q. wang", "d. wang", "c. cheng", "d. he"], "Pub Date": "2023-01-13", "Abstract": "smart card based password authentication has been the most widely used two factor authentication  2fa  mechanism for security critical applications  e.g. e health smart grid and e commerce  in the past decades and it is likely to hold its status in the foreseeable future. hundreds of this type of 2fa schemes have been proposed yet to our knowledge most of them are built on the intractability of conventional hard problems  e.g. discrete logarithm problems and integer factoring problems  which are no longer hard in the quantum era. with the recent advancements in quantum computing the design of secure and efficient smart card based password authentication schemes against quantum attacks is becoming increasingly urgent. however it is not as simple as it seems how to design such a quantum resistant 2fa scheme is challenging due to the demanding security requirements and the resource constrained nature of mobile devices. in this work we take the first step towards this issue by proposing quantum2fa a practical quantum resistant smart card based password authentication scheme that employs alkim et al.‚äôs lattice based key exchange and wang wang‚äôs ‚äúfuzzy verifier + honeywords‚äù technique  ieee tdsc‚äô18 . particularly quantum2fa can thwart the newly revealed key reuse attack  acisp‚äô18 ct rsa‚äô19  against lattice based key exchange schemes in two aspects  signal leakage attacks and key mismatch attacks. specifically it restricts the necessary conditions  i.e. the attacker must be the initiator of the key exchange  for an adversary to analyze the signal  it introduces honeywords to detect the key mismatches between the smart card and the server and thus smart card loss attack can be thwarted. we formally prove the security of quantum2fa under the random oracle model and demonstrate its efficiency through experiments on a 32 mhz 8 bit avr embedded processor. comparison results show that quantum2fa is not only more secure but also offers better computation efficiency than the state of the art conventional 2fa schemes.", "Doi": "10.1109/TDSC.2021.3129512", "Key Words": ["two-factor authentication", "quantum security", "lattice-based cryptography", "key-reuse", "honeyword"]}