{"Title": "Quantum Program Synthesis Through Operator Learning and Selection", "Authors": ["s. lee", "s. y. nam"], "Pub Date": "2023-03-20", "Abstract": "programming for quantum computers is complicated and time consuming because quantum operations are counterintuitive and their combined effects are difficult to understand. existing tools allow automatic synthesis of quantum programs which releases the burden of handwriting. however many existing systems arrange predetermined operators in successive manner to gradually reduce the gap with requirements  these methods are quick but often produce lengthy programs and they are difficult to adopt for new operators. other systems depend on stochastic or heuristic search  they identify near optimal programs for certain cases but it is not easy to tune the algorithms for a wide range of cases. we propose a system that produces compact programs for most cases and easily evolves with new operators. the system automatically learns the roles of available operators by composing various possible programs. based on the knowledge it selects a subset of operators most appropriate for requirements and uses them to compose a program. the learning is geared toward concise programs  thus the system tends to produce programs with the fewest operators possible. we implemented the system and evaluated it by synthesizing over 400 programs. in comparison with a state of the art system the proposed system produced programs with approximately 40 times fewer operators at the cost of increased synthesis time from seconds to minutes. we also observed that the system successfully adopted new operators by learning their differences from existing operators and utilizing them in right places. we believe that the system provides a basis of utilizing machine learning for quantum program synthesis.", "Doi": "10.1109/ACCESS.2023.3257192", "Key Words": ["machine learning", "neural networks", "program synthesis", "quantum computing", "quantum program", "supervised learning"]}