{"Title": "Quantum Transfer Learning for Real-World, Small, and High-Dimensional Remotely Sensed Datasets", "Authors": ["s. otgonbaatar", "g. schwarz", "m. datcu", "d. kranzlm√ºller"], "Pub Date": "2023-10-13", "Abstract": "quantum machine learning  qml  models promise to have some computational  or quantum  advantage for classifying supervised datasets  e.g. satellite images  over some conventional deep learning  dl  techniques due to their expressive power via their local effective dimension. there are however two main challenges regardless of the promised quantum advantage. currently available quantum bits  qubits  are very small in number whereas real world datasets are characterized by hundreds of high dimensional elements  i.e. features . in addition there is not a single unified approach for embedding real world high dimensional datasets in a limited number of qubits. some real world datasets are too small for training intricate qml networks. hence to tackle these two challenges for benchmarking and validating qml networks on real world small and high dimensional datasets in one go we employ quantum transfer learning comprising a classical vgg16 layer and a multiqubit qml layer. we use real amplitude and strongly entangling n layer qml networks with and without data reuploading layers as a multiqubit qml layer and evaluate their expressive power quantified by using their local effective dimension and the lower local effective dimension of a qml network the better its performance on unseen data. as datasets we utilize eurosat and synthetic datasets  i.e. easy to classify datasets  and an uc merced land use dataset  i.e. a hard to classify dataset . our numerical results show that the strongly entangling n layer qml network has a lower local effective dimension than the real amplitude qml network and outperforms it on the hard to classify datasets. in addition quantum transfer learning helps tackle the two challenges mentioned above for benchmarking and validating qml networks on real world small and high dimensional datasets.", "Doi": "10.1109/JSTARS.2023.3316306", "Key Words": ["data reuploading", "earth observation", "image classification", "quantum machine learning (qml)", "quantum transfer learning", "remote sensing"]}