{"Title": "Quantum Secure Threshold Private Set Intersection Protocol for IoT-Enabled Privacy-Preserving Ride-Sharing Application", "Authors": ["t. mohanty", "v. srivastava", "s. k. debnath", "a. k. das", "b. sikdar"], "Pub Date": "2023-12-27", "Abstract": "the internet of things  iot  enabled ride sharing is one of the most transforming and innovative technologies in the transportation industry. it has myriads of advantages but with increasing demands there are security concerns as well. traditionally cryptographic methods are used to address the security and privacy concerns in a ride sharing system. unfortunately due to the emergence of quantum algorithms these cryptographic protocols may not remain secure. hence there is a necessity for privacy preserving ride sharing protocols which can resist various attacks against quantum computers. in the domain of privacy preserving ride sharing a threshold private set intersection  tpsi  can be adopted as a viable solution because it enables the users to determine the intersection of private data sets if the set intersection cardinality is greater than or equal to a threshold value. although tpsi can help to alleviate privacy concerns none of the existing tpsi is quantum secure. furthermore the existing tpsi faces the issue of long term security. in contrast to classical and post quantum cryptography quantum cryptography  qc  provides a more robust solution where qc is based on the postulates of quantum physics  e.g. heisenberg uncertainty principle no cloning theorem etc.  and it can handle the prevailing issues of quantum threat and long term security. herein we propose the first qc based tpsi protocol which has a direct application in privacy preserving ride sharing. due to the use of qc our iot enabled ride sharing scheme remains quantum secure and achieves long term security as well.", "Doi": "10.1109/JIOT.2023.3291132", "Key Words": ["internet of things (iot)", "long-term security", "private set intersection (psi)", "quantum communication", "ride-sharing"]}