{"Title": "Quantum Multiagent Actor‚ÄìCritic Networks for Cooperative Mobile Access in Multi-UAV Systems", "Authors": ["c. park", "w. j. yun", "j. p. kim", "t. k. rodrigues", "s. park", "s. jung", "j. kim"], "Pub Date": "2023-10-30", "Abstract": "this article proposes a novel algorithm named quantum multiagent actor‚äìcritic networks  qmacn  for autonomously constructing a robust mobile access system employing multiple unmanned aerial vehicles  uavs . in the context of facilitating collaboration among multiple uavs the application of multiagent reinforcement learning  marl  techniques is regarded as a promising approach. these methods enable uavs to learn collectively optimizing their actions within a shared environment ultimately leading to more efficient cooperative behavior. furthermore the principles of quantum computing  qc  are employed in our study to enhance the training process and inference capabilities of the uavs involved. by leveraging the unique computational advantages of qc our approach aims to boost the overall effectiveness of the uav system. however employing a qc introduces scalability challenges due to the near intermediate scale quantum  nisq  limitation associated with qubit usage. the proposed algorithm addresses this issue by implementing a quantum centralized critic effectively mitigating the constraints imposed by nisq limitations. additionally the advantages of the qmacn with performance improvements in terms of training speed and wireless service quality are verified via various data intensive evaluations. furthermore this article validates that a noise injection scheme can be used for handling environmental uncertainties in order to realize robust mobile access.", "Doi": "10.1109/JIOT.2023.3282908", "Key Words": ["aerial base station", "autonomous mobile connectivity system", "decentralized partially observable markov decision process (dec-pomdp)", "multiagent system", "nonterrestrial network (ntn)", "quantum neural network (qnn)"]}