{"Title": "Quantum-Safe HIBE: Does It Cost a Latte?", "Authors": ["r. k. zhao", "s. mccarthy", "r. steinfeld", "a. sakzad", "m. o‚äôneill"], "Pub Date": "2024-01-25", "Abstract": "the united kingdom  uk  government is considering advanced primitives such as identity based encryption  ibe  for adoption as they transition their public safety communications network from tetra to an lte based service. however the current lte standard relies on elliptic curve based ibe which will be vulnerable to quantum computing attacks expected within the next 20‚äì30 years. lattices can provide quantum safe alternatives for ibe. these schemes have shown promising results in terms of practicality. to date several ibe schemes over lattices have been proposed but there has been little in the way of practical evaluation. this paper provides the first complete optimised practical implementation and benchmarking of latte a promising hierarchical ibe  hibe  scheme proposed by the uk national cyber security centre  ncsc  in 2017 and endorsed by european telecommunications standards institute  etsi . we propose optimisations for the keygen delegate extract and gaussian sampling components of latte to increase attack costs reduce decryption key lengths by 2x‚äì3x ciphertext sizes by up to 33% and improve speed. in addition we conduct a precision analysis bounding the r√©nyi divergence of the distribution of the real gaussian sampling procedures from the ideal distribution in corroboration of our claimed security levels. our resulting implementation of the delegate function takes 0.4 seconds at 80 bit security level on a desktop machine at 4.2ghz significantly faster than the order of minutes estimated in the etsi technical report. furthermore our optimised latte encrypt decrypt implementation reaches speeds up to 9.7x faster than the etsi implementation.", "Doi": "10.1109/TIFS.2023.3347880", "Key Words": ["lattice-based cryptography", "hierarchical identity-based encryption", "advanced primitives", "software design", "post-quantum"]}