{"Title": "QuCNet: Quantum-Inspired Convolutional Neural Networks for Optimized Thyroid Nodule Classification", "Authors": ["g. swathi", "a. altalbe", "r. p. kumar"], "Pub Date": "2024-02-27", "Abstract": "the escalating incidence of thyroid cancer over the past decade underscores the imperative for effective classification and early detection of thyroid nodules. an automated system for this purpose could significantly aid physicians particularly in expediting diagnostic processes. however attaining this objective has proven challenging primarily attributed to the constrained dataset size for medical images and the laborious process of feature extraction. this research addresses these challenges by thoroughly exploring the importance of extracting meaningful features for tumor detection and introducing a quantum based convolutional neural network. the proposed approach employs a quantum filter transformation for intricate feature extraction coupled with a classical neural network for the classification of thyroid nodules in ultrasound images. the classification process involves two distinct categorizations  distinguishing between nodules that are benign or malignant and identifying the specific suspicious class to which the nodule is attributed. the amalgamation of both classifiers yields a comprehensive characterization of thyroid nodules showcasing notable accuracy. for tumor classification the model achieves an accuracy of 97.63% precision of 97.72% and recall of 97.64% on a test dataset containing 127 images. similarly for suspicious level classification the model attains an accuracy of 93.87% precision of 94.58% and recall of 93.88% on a test dataset containing 98 images. these results surpass the performance of existing models marking a significant advancement in the field of thyroid nodule classification. the proposed model represents a promising and innovative methodology that could offer valuable support mechanisms in clinical settings facilitating the rapid classification and diagnosis of thyroid cancer.", "Doi": "10.1109/ACCESS.2024.3367806", "Key Words": ["thyroid nodule classification", "quanvolutional neural networks", "quantum filter transformation", "tumor classification", "benign", "malignant", "ti-rads", "feature extraction", "ddti"]}