{"Title": "QuDASH: Quantum-Inspired Rate Adaptation Approach for DASH Video Streaming", "Authors": ["b. wei", "h. song", "m. nakamura", "k. kimura", "n. togawa", "j. katto"], "Pub Date": "2023-10-31", "Abstract": "internet traffic is dramatically increasing with the development of network technologies and video streaming traffic accounts for large amount within the total traffic which reveals the importance to guarantee the quality of content delivery service. based on the network conditions adaptive bitrate  abr  control is utilized as a common technique which can choose the proper bitrate to ensure the video streaming quality. in this paper new bitrate control method qudash is proposed by taking advantage of the emerging quantum technology. in qudash the adaptive control model is developed using the quadratic unconstrained binary optimization  qubo  which aims at increasing the average bitrate and decreasing the video rebuffering events to maximize the user quality of experience  qoe . in order to formulate the video control model first the qubo terms of different factors are defined regarding video quality bitrate change and buffer condition. then all the individual qubo terms are merged to generate an objective function. by minimizing the qubo objective function the bitrate choice is determined from the solution. the control model is solved by digital annealer which is a quantum inspired computing technology. the evaluation of the proposed method is carried out by simulation with the throughput traces obtained in real world under different scenarios and the comparison with other methods is conducted. experiment results demonstrated that the proposed qudash method has better performance in terms of qoe compared with other advanced abr methods. in 68.2% of the examined cases qudash achieves the highest qoe results which shows the superiority of the qudash over conventional methods.", "Doi": "10.1109/ACCESS.2023.3326326", "Key Words": ["qudash", "adaptive bitrate control", "qubo", "ising machine", "digital annealer"]}