{"Title": "Radiation Hardness of MALTA2, a Monolithic Active Pixel Sensor for Tracking Applications", "Authors": ["d. v. berlea", "p. allport", "i. a. tortajada", "d. bortoletto", "c. buttar", "e. charbon", "f. dachs", "v. dao", "h. denizili", "d. dobrijevic", "l. f. s. de acedo", "a. gabrielli", "m. gazi", "l. gonella", "v. gonzalez", "g. gustavino", "m. leblanc", "k. y. oyulmaz", "h. pernegger", "f. piro", "p. riedler", "m. van rijnbach", "h. sandaker", "a. sharma", "w. snoeys", "c. a. s. sanchez", "t. suligoj", "m. v. nunez", "j. weick", "s. worm", "a. m. zoubir"], "Pub Date": "2023-10-18", "Abstract": "malta is a depleted monolithic active pixel sensor  dmaps  developed in the tower semiconductor 180 nm cmos imaging process. monolithic cmos sensors offer advantages over current hybrid imaging sensors in terms of both increased tracking performance due to lower material budget and ease of integration and construction costs due to the integration of read out and active sensor into one asic. current research and development efforts are aimed toward radiation hard designs up to 100 mrad in total ionizing dose  tid  and  $1\\\\ \\times 10 ^{15}~1~\\text {mev}\\text {n} {\\text {eq}}/\\text {cm}^{2}$  in nonionizing energy loss  niel . the design of the malta sensors was specifically chosen to achieve radiation hardness up to these requirements and satisfy current and future collider constraints. the current malta pixel architecture uses small electrodes which provide less noise higher signal voltage and a better power to performance ratio. to counteract the loss of efficiency in pixel corners modifications to the tower process have been implemented. the malta sensors have been tested during the 2021 and 2022 sps cern test beam in the malta telescope. the telescope ran for the whole duration of the beam time and took data to characterize the novel malta2 variant and the performance of irradiated samples in terms of efficiency and cluster size. these campaigns show that malta is an interesting prospect for hl lhc and beyond collider experiments providing both very good tracking capabilities and radiation hardness in harsh radiation environments.", "Doi": "10.1109/TNS.2023.3313721", "Key Words": ["cmos", "maps", "radiation damage", "silicon", "tracking"]}