{"Title": "RADiT: Resource Allocation in Digital Twin-Driven UAV-Aided Internet of Vehicle Networks", "Doi": "10.1109/JSAC.2023.3310048", "Authors": ["b. hazarika", "k. singh", "c. -p. li", "a. schmeink", "k. f. tsang"], "Key Words": ["internet of vehicles (iov)", "deep reinforcement learning (drl)", "digital twin (dt)", "mobile edge computing (mec)", "unmanned aerial vehicles (uavs)", "resource allocation", "vehicle-to-vehicle (v2v)", "vehicle-to-roadside-unit (v2i)", "soft actor-critic (sac)"], "Abstract": "digital twin  dt  has emerged as a promising technology for improving resource allocation decisions in internet of vehicles  iov  networks. in this paper we consider an iov network where mobile edge computing  mec  servers are deployed at the roadside units  rsus . the iov network provides ubiquitous connections even in areas uncovered by rsus with the assistance of unmanned aerial vehicles  uavs  which can act as a relay between rsus and task vehicles. a virtual representation of the iov network is established in the aerial network as dt which captures the dynamics of the entities of the physical network in real time in order to perform efficient resource allocation for delay intolerant tasks. we investigate an intelligent delay sensitive task offloading scheme for the dynamic vehicular environment which provides computation resources via local execution vehicle to vehicle  v2v  and vehicle to roadside unit  v2i  offloading modes based on the energy consumption of the system. moreover we also propose a multi network deep reinforcement learning  drl  based resource allocation algorithm  radit  in the dt assisted network for maximizing the utility of the iov network while optimizing the task offloading strategy. further we compare the performance of the proposed algorithm with and without the presence of v2v computation mode. radit is further evaluated by comparing it with another benchmark drl algorithm called soft actor critic  sac  and a non drl approach called greedy. finally simulations are performed to demonstrate that the utility of the proposed radit algorithm is higher under every condition compared to its respective conditions in sac and greedy approach. consequently the proposed framework jointly improves energy efficiency and reduces the overall delay of the network. the proposed algorithm with uav relay further increases the efficiency of the network by increasing the task completion rate.", "Pub Date": "2023-10-26"}