{"Title": "RAILS: 3-D Real-Time Angle of Arrival Ultrasonic Indoor Localization System", "Authors": ["a. gabbrielli", "j. bordoy", "w. xiong", "g. k. j. fischer", "t. schaechtle", "j. wendeberg", "f. h√∂flinger", "c. schindelhauer", "s. j. rupitsch"], "Pub Date": "2023-01-18", "Abstract": "the demand for a replacement of global navigation satellite systems in indoor environments has led researchers to investigate the field of indoor localization. in this contribution we propose rails a 3 d real time angle of arrival ultrasonic indoor localization system. the proposed system is capable of accurately and precisely locating a source in three dimensions using angle of arrival  aoa  measurements. our acoustic aoa technique relies on a constellation of spatially distributed arrays of microphones and on a source emitting inaudible ultrasonic chirp signals. real time features are enabled by introducing a localization chirp detector that constantly listens to the medium and triggers the localization algorithms only when signals of interest are approaching. the core of the 3 d localization method are the time delay estimates aiming to compute the 3 d direction vectors. in order to overcome the challenges introduced by the acoustic indoor channel and to provide accuracy and robustness in the delay estimates we have designed a time delay estimator. furthermore an ad hoc 3 d positioning algorithm based on 3 d vector intersection has been developed to furnish reliable 3 d source positions. the performance of our proposed ultrasonic indoor localization system has been evaluated through static single source real world experiments in a warehouse like scenario covering an area of  $40~\\text {m}^{2}$  with a maximum source receiver range of 10 m. the system achieved an outstanding average of 10 cm 3 d positioning accuracy with an average standard deviation of 1 cm over all the measurements. furthermore dynamic single source experiments have been carried out demonstrating that our system is capable not only of locating a source but also to track it.", "Doi": "10.1109/TIM.2022.3222485", "Key Words": ["angle of arrival (aoa)", "sensor networks", "signal processing", "time delay estimation", "ultrasonic indoor localization"]}