{"Title": "Randomized Cost Analysis for Nonclairvoyant Task Offloading in Edge Computing", "Doi": "10.1109/JIOT.2023.3339219", "Authors": ["v. kumari", "c. sudhakar"], "Key Words": ["mobile edge computing (mec)", "nonclairvoyant task offloading", "probabilistic analysis"], "Abstract": "most of the previous research on task offloading in mobile edge computing  mec  has focused on clairvoyant task scheduling which assumes that the characteristics of the tasks are known apriori. this assumption is unrealistic for many practical scenarios with randomly generated tasks in mec. in this article a randomized cost analysis of task offloading in mec environment is done where the characteristics of tasks are not known. the aim is to co optimize the overall completion time and cost for executing a set of tasks. task being executed may request some of the predefined services from cloud edge devices. it is quite a challenge to ensure the quality of experience of end user and service provider in terms of time and cost due to the uncertain and diverse task characteristics. in order to tackle this problem an efficient randomized task offloading model is formulated to reduce the overall execution time and cost. to this end we present two service unaware and two service aware algorithms namely service unaware offline nonclairvoyant batch scheduling  sun bs  service unaware online nonclairvoyant task scheduling service aware offline nonclairvoyant batch scheduling and service aware online nonclairvoyant task scheduling  san ts  using randomized stochastic and randomized probabilistic approaches that provides near optimal solution. we further perform complexity analysis to show the theoretical upper bounds for makespan and total cost with certain performance guarantee. numerical simulation experiments are conducted to demonstrate the performance improvement of proposed algorithms sun bs  54%‚äì68%  in term of makespan and san ts  7%‚äì20%  in terms of cost over the traditional scheduling algorithms.", "Pub Date": "2024-04-09"}