{"Title": "Readout Circuit System to Improve the Spatial Resolution and Measurable Energy Range of a Compton Camera", "Authors": ["s. -j. jeon", "j. -s. lee", "s. -h. cho", "w. j. choi", "y. -w. choi"], "Pub Date": "2023-10-09", "Abstract": "in this article we focus on tackling position distortion in compton imaging systems by proposing a readout circuit based on a current conveyor. compton imaging is a technique used for reconstructing radiation source images by analyzing the kinematics of compton scattering. the accurate positioning of detectors is crucial for achieving high quality imaging results. however using a conventional readout circuit coupled with a resistive network to reduce the number of channels can introduce positional distortion in the image and the amount of distortion depends on the gain of the readout circuit. therefore the measurable energy range is limited. in our study we analyze the factors contributing to position distortion caused by electronic devices and present a novel readout circuit based on a current conveyor. this circuit aims to minimize position error and mitigate the effects of electronic characteristics while controlling the gain of the signal. experimental verification is conducted using gamma ray sources to evaluate the proposed readout circuit. the results showed that with  $2\\times $  and  $10\\times $  gain the same positional characteristics were found and the distortion was also greatly improved approaching the ideal position of the image. it also suggests that the range of measurable energy extends from 80 kev to 1.3 mev which could improve the performance of the compton camera. overall our research makes a valuable contribution to the field of compton imaging. the proposed readout circuit effectively reduces position distortion and expands the measurable energy range leading to improved performance and reliability of compton cameras in various applications.", "Doi": "10.1109/TIM.2023.3317929", "Key Words": ["channel multiplexing method", "compton camera", "current conveyor", "multichannel readout circuit", "position distortion"]}