{"Title": "Real-Time, Automated, Multiobjective, Cloud Computing Whole Slide Imaging Device", "Authors": ["s. p. mallick", "k. s. adithya", "r. sabui", "b. b. naidu", "r. singh", "h. babu", "g. jagadeesh", "k. m. venkata amaresh", "r. gopal", "v. sharma"], "Pub Date": "2023-04-19", "Abstract": "we present a novel approach to whole slide imaging  wsi  that consists of a uniquely designed low cost single unit portable optically isolated dust free onboard mini computer integrated fully enclosed wsi scanner device that can be wirelessly controlled through an easy to use intuitive user interface application on an ipad. a laboratory virtual instrument engineering workbench  labview  based control software interfaces with multiple hardware modules within the device using the queued message handler  qmh  architecture optimized to handle synchronous and parallel real time processes. the system scans an area of  $15\\times15$  mm2 in  $\\sim $ 5 min at a resolution of  $\\sim 0.25~\\mu \\text{m}$  with a  $40\\times $  objective lens. with a low weight of 12 kg the enclosure dimensions being  $340\\times 265\\times300$  mm and its low cost of building the device makes it more portable and affordable to the intended rural and low tier medical centers. the instrument incorporates features such as automatic slide loading slide registration brightness control slide scanning and an autofocus algorithm implementing a unique ‚äúconvolution histogram mean value‚äù method to determine the  $z$  focus map. the work showcases a shift in preprocessing computations to the cloud server and integrating artificial intelliegence ml tools for advanced database and image processing techniques on a portable device. a nonmedical application of studying plasma science using the instrument has also been presented demonstrating its wider application in medical and nonmedical fields.", "Doi": "10.1109/TIM.2023.3265763", "Key Words": ["algorithm design and analysis", "auto-focusing", "image edge extraction", "laboratory virtual instrument engineering workbench (labview)", "medical and nonmedical", "medical optics instrumentation", "microscopy", "optical design", "portable", "remotely controlled", "whole slide imaging (wsi)"]}