{"Title": "Real-Time Multi-Task ADAS Implementation on Reconfigurable Heterogeneous MPSoC Architecture", "Authors": ["g. tatar", "s. bayar"], "Pub Date": "2023-08-07", "Abstract": "the rapid adoption of advanced driver assistance systems  adas  in modern vehicles aiming to elevate driving safety and experience necessitates the real time processing of high definition video data. this requirement brings about considerable computational complexity and memory demands highlighting a critical research void for a design integrating high fps throughput with optimal mean average precision  map  and mean intersection over union  miou . performance improvement at lower costs multi tasking ability on a single hardware platform and flawless incorporation into memory constrained devices are also essential for boosting adas performance. addressing these challenges this study proposes an adas multi task learning hardware software co design approach underpinned by the kria kv260 multi processor system on chip field programmable gate array  mpsoc fpga  platform. the approach facilitates efficient real time execution of deep learning algorithms specific to adas applications. utilizing the bdd100k+waymo kitti and cityscapes datasets our adas multi task learning system endeavours to provide accurate and efficient multi object detection segmentation and lane and drivable area detection in road images. the system deploys a segmentation based object detection strategy using a resnet 18 backbone encoder and a single shot detector architecture coupled with quantization aware training to augment inference performance without compromising accuracy. the adas multi task learning offers customization options for various adas applications and can be further optimized for increased precision and reduced memory usage. experimental results showcase the system‚äôs capability to perform real time multi class object detection segmentation line detection and drivable area detection on road images at approximately 25.4 fps using a  $1920\\times 1080\\text{p}$  full hd camera. impressively the quantized model has demonstrated a 51% map for object detection 56.62% miou for image segmentation 43.86% miou for line detection and 81.56% iou for drivable area identification reinforcing its high efficacy and precision. the findings underscore that the proposed adas multi task learning system is a practical reliable and effective solution for real world applications.", "Doi": "10.1109/ACCESS.2023.3300379", "Key Words": ["adas", "deep learning", "deep processing unit", "memory allocation", "multi-task learning", "mpsoc-fpga architecture", "vitis-ai", "quantization aware training"]}