{"Title": "Real-Time Object Detection Network in UAV-Vision Based on CNN and Transformer", "Authors": ["t. ye", "w. qin", "z. zhao", "x. gao", "x. deng", "y. ouyang"], "Pub Date": "2023-02-13", "Abstract": "unmanned aerial vehicles  uavs  play an important role in conducting automatic patrol inspections of cities which can ensure the safety of urban residents‚äô life and property and the normal operation of cities. however during the inspection process problems may arise. for example numerous small objects in uav images are difficult to detect objects in uav images are severely occluded and requirements for real time performances are posed. to address these issues we first propose a real time object detection network  rtd net  for uav images. besides to deal with the lack of visual features of small objects we design a feature fusion module  ffm  to interact and fuse features at different levels and improve the feature expression ability of small objects. to achieve real time detection we design a lightweight feature extraction module  lem  to build the backbone network to control the calculation quantity and parameters. to solve the issue of discontinuous features of occluded objects an efficient convolutional transformer block  ectb  based convolutional multihead self attention  cmhsa  is designed to improve the recognition ability of occluded objects by extracting the context information of objects. compared with multihead self attention  mhsa  in the traditional transformer cmhsa uses convolutional projection to replace the position linear projection which can reduce a large amount of calculation without performance loss. finally an attention prediction head  aph  is designed based on the attention mechanism to improve the ability of the model to extract attention regions in complex scenarios. the proposed method reaches a detection accuracy of 86.4% mean average precision  map  in our uav image dataset. in addition it achieves a detection accuracy of 86.0% map and a detection speed of 33.4 frames s in the nvidia jeston tx2 embedded device.", "Doi": "10.1109/TIM.2023.3241825", "Key Words": ["automatic patrol inspections", "multiscale object detection", "real-time detection", "transformer", "unmanned aerial vehicle (uav)-vision"]}