{"Title": "Real-Time Multi-Task Environmental Perception System for Traffic Safety Empowered by Edge Artificial Intelligence", "Doi": "10.1109/TITS.2023.3309100", "Authors": ["c. liu", "h. yang", "m. zhu", "f. wang", "t. vaa", "y. wang"], "Key Words": ["traffic environment", "traffic perception", "edge computing", "computer vision", "traffic safety"], "Abstract": "traffic safety reliability and resilience are significantly influenced by environmental factors such as visibility road surface and weather conditions. yet current monitoring methods including weather stations and onboard environmental sensors often fall short due to their high costs significant latency and limited dissemination. this paper presents the edge based multi task safety oriented environmental  edge muse  sensing system designed to address these traffic safety challenges associated with environmental factors. edge muse departs from traditional single task sensing methods by performing multidimensional traffic environment perception tasks. it estimates key safety related environmental factors exclusively through camera inputs and incorporates four innovative sensing tasks  visibility estimation image dehazing road segmentation and road surface condition classification. the system is tailored to edge devices to transition computational loads from central servers to distributed nodes thereby enhancing privacy and reducing latency. additionally edge muse integrates communication functions based on tcp ip and wi fi protocols enabling rapid dissemination of sensing results and warning messages to local road users. system structures and data streaming have been optimized to accommodate the constraints of edge devices ensuring high efficiency edge computing. field testing of edge muse in multiple testbeds in bellevue  wa us  and oslo  norway  has demonstrated its reliable and precise performance in perception tasks  92.15% accuracy in visibility estimation and 92.25% in road surface condition classification  as well as an impressive processing speed of 21.3 fps. as such edge muse presents a promising solution for enhancing roadway safety efficiency and resilience.", "Pub Date": "2024-01-17"}