{"Title": "Recent Developments of Game Theory and Reinforcement Learning Approaches: A Systematic Review", "Doi": "10.1109/ACCESS.2024.3352749", "Authors": ["g. jain", "a. kumar", "s. a. bhat"], "Key Words": ["game theory", "reinforcement learning", "multi-agent reinforcement learning", "decision-making", "autonomous vehicles", "edge caching", "cyber-physical systems"], "Abstract": "in the ever changing world of decision making when game theory and reinforcement learning rl  come together they create a fascinating combination that shows a new way to solve complex problems in many fields. the combination of game theory and rl is a powerful convergence that opens up a hopeful new frontier for dealing with complex decision making problems in many different fields. research on the convergence of game theory and rl has shown to be beneficial providing essential insights into challenging decision making issues in various disciplines. this study investigates the recent developments of game theory and rl approaches through a systematic review and highlights the significance of game theory in boosting reinforcement algorithms and increasing the interaction of autonomous vehicles safeguarding edge caching and more. it offers a thorough account of the developments at the confluence of game theory and rl. the reviewed papers mainly focus on broad themes and address three important research questions  the impact of game theory on multi agent reinforcement learning  marl  the significant contributions of game theory to rl and the significant impact areas. following the methodology search outcomes and study areas is a discussion on game theory related terminology followed by study findings. the review‚äôs conclusions offer ideas for further study and open research questions. the importance of game theory in advancing marl the potential of game theory in promoting rl strategies and the opportunities for combining game theory and rl in cutting edge fields like mobile edge caching and cyber physical systems cps  are all emphasized in the conclusion. this review article advances our knowledge of the theoretical underpinnings and real world applications of game theory and rl laying the groundwork for future improvements in decision making techniques and algorithms.", "Pub Date": "2024-01-22"}