{"Title": "Recent Progress and Development of Hyperdimensional Computing (HDC) for Edge Intelligence", "Doi": "10.1109/JETCAS.2023.3242767", "Authors": ["c. -y. chang", "y. -c. chuang", "c. -t. huang", "a. -y. wu"], "Key Words": ["brain-inspired computing", "hyperdimensional computing", "machine learning", "edge-cloud collaborative intelligence"], "Abstract": "brain inspired hyperdimensional computing  hdc  is an emerging framework in low energy designs for solving classification tasks at the edge. unlike mainstream neural networks  nns  with high computational complexity hdc offers a fast training strategy and an energy efficient inference mechanism by computing data in the high dimensional space with high parallelism. however the original computing method of hdc results in weak accuracy due to its simplicity. therefore many works have proposed algorithmic innovations to improve the accuracy of hdc while maintaining its efficiency with dedicated hardware architectures. given this period of rapid evolution this review paper presents a comprehensive study of recent developments improving the accuracy efficiency trade off of hdc covering both algorithm and hardware level approaches. besides as the amount of data generated by the internet of the things  iot  devices keeps increasing edge cloud collaboration has become a key area of research. the emerging federated learning  fl  has become a key enabler in overcoming security and privacy issues by exchanging locally trained models for global aggregation. however the energy constraint of edge devices hinders them from the real time training of nn models. alternatively adopting hdc as a local model can be a potential solution to alleviating this issue since the computational requirements of hdc are affordable to most edge devices. in addition hdc based coding for wireless communication has been gaining traction due to its noise robustness. therefore this paper also covers recent works on hdc based edge cloud collaborative learning. finally we conclude this paper by highlighting the possible applications and future directions of hdc.", "Pub Date": "2023-03-22"}