{"Title": "Reconciliation Efficiency Impact on Discrete Modulated CV-QKD Systems Key Rates", "Authors": ["m. almeida", "d. pereira", "m. fac√£o", "a. n. pinto", "n. a. silva"], "Pub Date": "2023-09-13", "Abstract": "continuous variable quantum key distribution  cv qkd  allows the distribution of symmetric keys in a secure manner. cv qkd systems can extract keys at its maximum rate when using gaussian modulation  gm . nonetheless gm demands high capacity random number sources and tends to be very hard to approach in practice. to circumvent these disadvantages higher order probabilistic shaped discrete modulation  dm  can be used. state of the art works compute the key rates of dm cv qkd systems considering a fixed value for the reconciliation efficiency and do not take into account the frame error rate  fer  of the system thus over or under estimating the key rates. in this work we study the security bounds of cv qkd systems considering probabilistic shaped dm formats with 256 symbols in the finite size regime. this accounting for the true value of the reconciliation efficiency and the fer of the information reconciliation step. both conventional and hexagonal 256 quadrature amplitude modulation  qam  constellations yield higher key rates than 256 amplitude and phase shift keying  apsk  constellations with 256 qam constellations being indistinguishable in performance with gm for high transmission distances. minimum signal to noise ratio  snr  values were fixed from a fer analysis through a cv qkd simulation allowing for key extraction considering different fer levels. lower fer values are associated with higher snrs in the system and thus lower achievable transmission distances. nonetheless the fer maximizing the extraction key rate is not null. our results show that the extraction key rate is maximized by snr adjustment which should have in account both the reconciliation efficiency and the fer.", "Doi": "10.1109/JLT.2023.3280076", "Key Words": ["continuous variables", "discrete modulation", "quantum key distribution"]}