{"Title": "Reconstruction of 3-D CAD Model of Workpiece With Internal Defect Based on Industry CT Image", "Authors": ["c. long", "c. fang", "z. li", "y. jiang", "l. duan"], "Pub Date": "2023-03-27", "Abstract": "a 3 d computer   aided design  cad  model of workpiece with an internal defect can effectively evaluate the effect of internal defect on the use performance of the workpiece by digital simulation and the analysis result can provide technical support for optimizing manufacturing process but how to obtain the model has always been a difficult problem. a reconstruction approach is proposed for 3 d cad model of workpiece with an internal defect based on industrial computed tomography  ct  image in this article. first the ct image data are achieved by use industry ct scan the workpiece with internal defect  then the internal defect is segmented from the volume data composed of industrial ct images. the stereolithography  stl  model of the workpiece  excluding defect  and the stl model of the internal defect are obtained via the 3 d surface reconstruction of volume data. then in order to obtain the correct position of internal defect in the nominal cad model of the workpiece the stl model of the workpiece  excluding defect  is registered with the nominal cad model. finally the cad model of internal defect is reconstructed and then the 3 d cad model of workpiece with internal defect is achieved by the boolean operation with the entity model of internal defect and the nominal cad model of workpiece. the reconstructed cad model of workpiece with internal defect is imported into the finite element simulation software and the simulation analysis can be carried out according to the needs which proves the effectiveness of the method in this article. the proposed method makes full use of the nominal cad model of workpiece and only needs to reconstruct the cad model of internal defect which is simple and efficient.", "Doi": "10.1109/TIM.2022.3219478", "Key Words": ["3-d reconstruction", "computer - aided design (cad) model", "computed tomography (ct)", "defect detection", "x-ray"]}