{"Title": "Redesign and Accelerate the AIREBO Bond-Order Potential on the New Sunway Supercomputer", "Authors": ["p. gao", "x. duan", "b. schmidt", "w. wan", "j. guo", "w. zhang", "l. gan", "h. fu", "w. xue", "w. liu", "g. yang"], "Pub Date": "2023-10-19", "Abstract": "molecular dynamics  md  is one of the most crucial computer simulation methods for understanding real world processes at the atomic level. reactive potentials based on the bond order concept have the ability to model dynamic bond breaking and formation with close to quantum mechanical  qm  precision without actually requiring expensive qm calculations. in this article we focus on the adaptive intermolecular reactive empirical bond order  airebo  potential in lammps for the simulation of carbon and hydrocarbon systems on the new sunway supercomputer. to achieve scalable performance we propose a parallel two level building scheme and periodic buffering strategy for the tailored data design to explore data locality and data reuse. furthermore we design two optimized nearest neighbor access algorithms  the redistribution of accumulated coefficients algorithm and the double end search connectivity algorithm. finally we implement parallel force computation with an aos data layout and hardware software co cache. in addition we have designed a low overhead atomic operation based load balancing method and vectorization. the overall performance of airebo achieves a speedup of nearly $20\\times$20√ó on a single core group  cg  and more than $5\\times$5√ó and $4\\times$4√ó over an intel xeon e5 2680 v3 core and an intel xeon gold 6138 core respectively. compared with the intel accelerator package in lammps our performance further achieves $3.0\\times$3.0√ó of an intel xeon e5 2680 v3 core and is better than that of an intel xeon gold 6138 core. we complete the validation of the results in no more than 20.5 hours on a single node with 2000000 running steps  i.e. 1 ns . our experiments show that the simulation of 2139095040 atoms on 798720   1mpe+64cpes  √ó 12288 processes  cores exhibits a parallel efficiency of 88% under weak scaling.", "Doi": "10.1109/TPDS.2023.3321927", "Key Words": ["high-performance computing", "molecular dynamics", "lammps", "airebo", "computational science", "the new generation sunway supercomputer"]}