{"Title": "Reducing Bias in Sentiment Analysis Models Through Causal Mediation Analysis and Targeted Counterfactual Training", "Doi": "10.1109/ACCESS.2024.3353056", "Authors": ["y. da", "m. n. bossa", "a. d. berenguer", "h. sahli"], "Key Words": ["bert", "bias", "causal mediation analysis", "counterfactual training", "large language models", "sentiment analysis"], "Abstract": "large language models provide high accuracy solutions in many natural language processing tasks. in particular they are used as word embeddings in sentiment analysis models. however these models pick up on and amplify biases and social stereotypes in the data. causality theory has recently driven the development of effective algorithms to evaluate and mitigate these biases. causal mediation was used to detect biases while counterfactual training was proposed to mitigate bias. in both cases counterfactual sentences are created by changing an attribute such as the gender of a noun for which no change in the model output is expected. biases are detected and eventually corrected each time the model behavior differs between the original and the counterfactual sentence. we propose a new method for de biasing sentiment analysis models that leverages the causal mediation analysis to identify the parts of the model primarily responsible for the bias and apply targeted counterfactual training for model de biasing. we validated the methodology by fine tuning the pre trained bidirectional encoder representations from transformers  bert  model for sentiment prediction. we trained two sentiment analysis models using the stanford sentiment treebank dataset and the amazon product reviews respectively and we evaluated the fairness and prediction performances using the equity evaluation corpus. we illustrated the causal patterns in the network and showed that our method achieves both high fairness and more accurate sentiment analysis than the state of the art approach. contrary to state of the art models we achieved a noticeable improvement in gender fairness without hindering sentiment prediction accuracy.", "Pub Date": "2024-01-22"}