{"Title": "Reducing Computational Complexity of Neural Networks in Optical Channel Equalization: From Concepts to Implementation", "Authors": ["p. j. freire", "a. napoli", "b. spinnler", "m. anderson", "d. a. ron", "w. schairer", "t. bex", "n. costa", "s. k. turitsyn", "j. e. prilepsky"], "Pub Date": "2023-07-19", "Abstract": "this paper introduces a novel methodology for developing low complexity neural network  nn  based equalizers to address impairments in high speed coherent optical transmission systems. we present a comprehensive exploration and comparison of deep model compression techniques applied to feed forward and recurrent nn designs assessing their impact on equalizer performance. our investigation encompasses quantization weight clustering pruning and other cutting edge compression strategies. we propose and evaluate a bayesian optimization assisted compression approach that optimizes hyperparameters to simultaneously enhance performance and reduce complexity. additionally we introduce four distinct metrics  rmps bop nabs and nlgs  to quantify computing complexity in various compression algorithms. these metrics serve as benchmarks for evaluating the relative effectiveness of nn equalizers when compression approaches are employed. the analysis is completed by evaluating the trade off between compression complexity and performance using simulated and experimental data. by employing optimal compression techniques we demonstrate the feasibility of designing a simplified nn based equalizer surpassing the performance of conventional digital back propagation  dbp  equalizers with only one step per span. this is achieved by reducing the number of multipliers through weighted clustering and pruning algorithms. furthermore we highlight that an nn based equalizer can achieve better performance than the full electronic chromatic dispersion compensation block while maintaining a similar level of complexity. in conclusion we outline remaining challenges unanswered questions and potential avenues for future research in this field.", "Doi": "10.1109/JLT.2023.3234327", "Key Words": ["bayesian optimizer", "coherent detection", "computational complexity", "neural network", "nonlinear equalizer", "pruning", "quantization"]}