{"Title": "Reducing Data Motion and Energy Consumption of Geospatial Modeling Applications Using Automated Precision Conversion", "Doi": "10.1109/CLUSTER52292.2023.00035", "Authors": ["q. cao", "s. abdulah", "h. ltaief", "m. g. genton", "d. keyes", "g. bosilca"], "Key Words": ["task-based runtime", "geospatial statistics", "automated precision conversion", "gpu acceleration", "hpc"], "Abstract": "the burgeoning interest in large scale geospatial modeling particularly within the domains of climate and weather prediction underscores the concomitant critical importance of accuracy scalability and computational speed. harnessing these complex simulations‚äô potential however necessitates innovative computational strategies especially considering the increasing volume of data involved. recent advancements in graphics processing units  gpus  have opened up new avenues for accelerating these modeling processes. in particular their efficient utilization necessitates new strategies such as mixed precision arithmetic that can balance the trade off between computational speed and model accuracy. this paper leverages parsec runtime system and delves into the opportunities provided by mixed precision arithmetic to expedite large scale geospatial modeling in heterogeneous environments. by using an automated conversion strategy our mixed precision approach significantly improves computational performance  up to 3x  on summit supercomputer and reduces the associated energy consumption on various nvidia gpu generations. importantly this implementation ensures the requisite accuracy in environmental applications a critical factor in their operational viability. the findings of this study bear significant implications for future research and development in high performance computing underscoring the transformative potential of mixed precision arithmetic on gpus in addressing the computational demands of large scale geospatial modeling and making a stride toward a more sustainable efficient and accurate future in large scale environmental applications.", "Pub Date": "2023-11-21"}