{"Title": "Reinforcement Learning for Intelligent Healthcare Systems: A Review of Challenges, Applications, and Open Research Issues", "Doi": "10.1109/JIOT.2023.3288050", "Authors": ["a. a. abdellatif", "n. mhaisen", "a. mohamed", "a. erbad", "m. guizani"], "Key Words": ["deep learning", "distributed machine learning", "edge computing (ec)", "internet of things (iot)", "remote monitoring"], "Abstract": "the rise of chronic disease patients and the pandemic pose immediate threats to healthcare expenditure and mortality rates. this calls for transforming healthcare systems away from one on one patient treatment into intelligent health systems leveraging the recent advances of internet of things and smart sensors. meanwhile reinforcement learning  rl  has witnessed an intrinsic breakthrough in solving a variety of complex problems for distinct applications and services. thus this article presents a comprehensive survey of the recent models and techniques of rl that have been developed used for supporting intelligent healthcare  i health  systems. it can guide the readers to deeply understand the state of the art regarding the use of rl in the context of i health. specifically we first present an overview of the i health systems‚äô challenges architecture and how rl can benefit these systems. we then review the background and mathematical modeling of different rl deep rl  drl  and multiagent rl models. we highlight important guidelines on how to select the appropriate rl model for a given problem and provide quantitative comparisons showing the results of deploying key rl models in two scenarios that can be followed in monitoring applications. after that we conduct an in depth literature review on rl‚äôs applications in i health systems covering edge intelligence smart core network and dynamic treatment regimes. finally we highlight emerging challenges and future research directions to enhance rl‚äôs success in i health systems which opens the door for exploring some interesting and unsolved problems.", "Pub Date": "2023-12-11"}