{"Title": "Reinforcement Learning Framework for Server Placement and Workload Allocation in Multiaccess Edge Computing", "Doi": "10.1109/JIOT.2022.3205051", "Authors": ["a. mazloomi", "h. sami", "j. bentahar", "h. otrok", "a. mourad"], "Key Words": ["base station allocation", "edge server placement", "multiaccess edge computing (mec)", "q-learning", "reinforcement learning (rl)", "td(œª)"], "Abstract": "cloud computing is a reliable solution to provide distributed computation power. however real time response is still challenging regarding the enormous amount of data generated by the iot devices in 5g and 6g networks. thus multiaccess edge computing  mec  which consists of distributing the edge servers in the proximity of end users to have low latency besides the higher processing power is increasingly becoming a vital factor for the success of modern applications. this article addresses the problem of minimizing both the network delay which is the main objective of mec and the number of edge servers to provide a mec design with minimum cost. this mec design consists of edge servers placement and base stations allocation which makes it a joint combinatorial optimization problem  cop . recently reinforcement learning  rl  has shown promising results for cops. however modeling real world problems using rl when the state and action spaces are large still needs investigation. we propose a novel rl framework with an efficient representation and modeling of the state space action space and the penalty function in the design of the underlying markov decision process  mdp  for solving our problem. this modeling makes the temporal difference  td  learning applicable for a large scale real world problem while minimizing the cost of network design. we introduce the td $ \\lambda $  with eligibility traces for minimizing the cost  tdmc  algorithm in addition to  $q$  learning for the same problem  qmc  when  $\\lambda =0$ . furthermore we discuss the impact of state representation action space and penalty function on the convergence of each model. extensive experiments using real world data sets from shanghai telecommunication and citywide public computer centers demonstrate that in the light of an efficient model tdmc qmc are able to find the actions that are the source of lower delayed penalty. the reported results show that our algorithm outperforms the other benchmarks by creating a tradeoff among multiple objectives.", "Pub Date": "2023-01-05"}