{"Title": "Reinforcement Learning for Optimizing Delay-Sensitive Task Offloading in Vehicular Edge‚ÄìCloud Computing", "Doi": "10.1109/JIOT.2023.3292591", "Authors": ["t. h. binh", "d. b. son", "h. vo", "b. m. nguyen", "h. t. t. binh"], "Key Words": ["cloud computing", "deep q-learning", "delay-sensitive task", "task offloading", "vehicular edge computing (vec)"], "Abstract": "with the appearance of more and more devices connected to the internet the world has witnessed an ever growing number of data to be processed. among those many tasks require swift execution time while the storage and computation capability of internet of things  iot  devices are limited. to address the demands of delay sensitive tasks we present a vehicular edge‚äìcloud computing  vecc  network that leverages powerful computation capabilities through the deployment of servers in proximity to task generated devices as well as the utilization of idle resources from smart vehicles to share the workload. because these limited resources are vulnerable to sudden data arising it is imperative to incorporate cloud servers to prevent system overload. the challenge now is to find a task offloading strategy that collaborates both edges and cloud resources to minimize the total time surpassing the quality baseline of each task  tolerance time  and make all tasks meet their soft deadlines of quality. to reach this goal we first model the task offloading problem in vecc as a markov decision process  mdp . then we propose advantage oriented task offloading with a dueling actor insulator network scheme to solve the problem. this value based reinforcement learning  rl  method helps the agent find an effective policy when not knowing all the state attributes changes. the effectiveness of our method is demonstrated by performance evaluations based on real world bus traces in rio de janeiro  brazil . the experimental results show that our proposal reduces the tolerance time by at least 8.81% compared to other rl algorithms and 75% compared to greedy approaches.", "Pub Date": "2024-01-08"}