{"Title": "Reinforcement Learning-Based Physical Cross-Layer Security and Privacy in 6G", "Doi": "10.1109/COMST.2022.3224279", "Authors": ["x. lu", "l. xiao", "p. li", "x. ji", "c. xu", "s. yu", "w. zhuang"], "Key Words": ["6g", "phy-layer security", "privacy", "reinforcement learning", "secure communications", "uavs", "cross-layer security"], "Abstract": "sixth generation  6g  cellular systems will have an inherent vulnerability to physical  phy  layer attacks and privacy leakage due to the large scale heterogeneous networks with booming time sensitive applications. important wireless techniques including non orthogonal multiple access mobile edge computing millimeter wave massive multiple input and multiple output visible light communication terahertz and intelligent reflecting surface can improve the spectrum efficiency and quality of service but will raise challenges for the 6g phy and cross layer security and privacy protection. existing optimization based phy and cross layer security and privacy protection schemes such as the convex optimization method have to rely on accurate attack patterns and strategies and thus suffer from performance degradation in 6g systems that have shorter communication latency more devices and higher spectrum efficiency than 5g. reinforcement learning  rl  algorithms help wireless devices optimize their security policies to enhance the security performance in dynamic networks against smart attacks without depending on the attack model. therefore this article provides a comprehensive survey on the rl based 6g phy cross layer security and privacy protection. in this article we investigate the potential attacks in 6g systems and discuss the phy cross layer security solutions. a brief overview of reinforcement learning algorithms is provided. afterward we review the rl based phy layer security and privacy protection and discuss how to apply rl algorithms in 6g security scenarios especially focusing on the game with jammers eavesdroppers spoofers and inference attackers. the rl based security solutions for unmanned aerial vehicles  uavs  and cross layer scenarios are also reviewed. the future research directions are identified and the corresponding rl based potential solutions are discussed for 6g.", "Pub Date": "2023-02-23"}