{"Title": "Relational Temporal Graph Reasoning for Dual-Task Dialogue Language Understanding", "Doi": "10.1109/TPAMI.2023.3289509", "Authors": ["b. xing", "i. w. tsang"], "Key Words": ["dialog system", "graph reasoning", "language understanding", "temporal relation", "transformer"], "Abstract": "dual task dialog language understanding aims to tackle two correlative dialog language understanding tasks simultaneously via leveraging their inherent correlations. in this paper we put forward a new framework whose core is relational temporal graph reasoning. we propose a speaker aware temporal graph  satg  and a dual task relational temporal graph  drtg  to facilitate relational temporal modeling in dialog understanding and dual task reasoning. besides different from previous works that only achieve implicit semantics level interactions we propose to model the explicit dependencies via integrating prediction level interactions. to implement our framework we first propose a novel model dual task temporal relational recurrent reasoning network  darer  which first generates the context  speaker  and temporal sensitive utterance representations through relational temporal modeling of satg then conducts recurrent dual task relational temporal graph reasoning on drtg in which process the estimated label distributions act as key clues in prediction level interactions. and the relational temporal modeling in darer is achieved by relational graph convolutional networks  rgcns . then we further propose relational temporal transformer  reteformer  which achieves fine grained relational temporal modeling via relation  and structure aware disentangled multi head attention. accordingly we propose darer with reteformer  darer$^{\\mathbf{2}}$2  which adopts two variants of reteformer to achieve the relational temporal modeling of satg and dtrg respectively. the extensive experiments on different scenarios verify that our models outperform state of the art models by a large margin. remarkably on the dialog sentiment classification task in the mastodon dataset darer and darer$^{2}$2 gain relative improvements of about 28% and 34% over the previous best model in terms of f1.", "Pub Date": "2023-10-03"}