{"Title": "Reliable IoT Paradigm With Ensemble Machine Learning for Faults Diagnosis of Power Transformers Considering Adversarial Attacks", "Authors": ["m. n. ali", "m. amer", "m. elsisi"], "Pub Date": "2023-08-14", "Abstract": "power transformer represents an important equipment in electric power systems. transformers are not only a source of power outages for electric utilities but they also affect customers because they interrupt power supplies. transformers require frequent maintenance and service which can be time consuming and expensive. power systems and their maintenance and servicing can be planned in advance when transformer faults are detected early with high accuracy rates. in order to avoid unplanned shutdowns it is crucial to monitor and diagnose faults of power transformers. based on how electrical and thermal stresses impact the insulating oil it is possible to detect or classify transformer faults by checking for dissolved gases. in this article a new transformer monitoring and fault diagnosis technique are developed by utilizing an industrial internet of things  iot  platform combined with an ensemble machine learning  eml  strategy. in order to prevent overlapping between diverse transformer defects an innovative feature engineering strategy is developed based on introducing new features for gases‚äô concentrations and their ratios. through this eml efficiency is enhanced due to the separation of overlapping in the datasets between diverse transformer faults. the datasets from egyptian chemical laboratories and literature are used to train and test the proposed eml. as shown in the experiments the proposed fault diagnosis model provides the best diagnosis accuracy which is significantly better than the state of the art machine learning approaches. finally the robustness of the developed eml model is further demonstrated by including white gaussian noise that is based on the fast gradient sign method  fgsm  as well as the zeroth order optimization  zoo  attack to validate the model against adversarial attack scenarios.", "Doi": "10.1109/TIM.2023.3300444", "Key Words": ["adversarial attacks", "fault detection", "iot", "machine learning", "power transformer"]}