{"Title": "Reliability-Aware Task Processing and Offloading for Data-Intensive Applications in Edge computing", "Doi": "10.1109/TNSM.2023.3258191", "Authors": ["j. liang", "b. ma", "z. feng", "j. huang"], "Key Words": ["mobile edge computing", "reliability", "admm", "computation offloading", "compression"], "Abstract": "with the growing popularity of mobile edge computing  mec  a number of data intensive applications have been deployed. quality of service  qos  as one of the most important requirements in mec has attracted significant attention of both academia and industry. there are two challenges for ensuring the qos of the data intensive services. firstly besides performance reliability is another important concern especially for some critical applications which remains unexplored. secondly data compression has to be involved for reducing the heavy workload of wireless communications at the edge of the network. to overcome these challenges this paper jointly studies the reliability aware data compression and task offloading for data intensive applications in mec. markov models are constructed to capture the dynamics of the state transitions of mec systems and quantitative analyses are conducted for performance and reliability evaluation. for fully taking advantages of data compression in qos guarantee we formulate an optimization problem with the objective of minimizing latency while satisfying constraints on reliability and energy consumption. after describing the np hardness of the problem we apply the techniques of problem linearization and constraint relaxation transform the original problem into a convex optimization problem. then the problem can be solved in a parallel way by introducing the alternating direction multiplier method  admm  and a distributed reliability aware task processing and offloading  rtpo  algorithm is presented. finally extensive simulation experiments are conducted to validate the efficacy of our approach the experimental results illustrate the superiority of our approach over both baseline and state of the art algorithm.", "Pub Date": "2023-12-12"}