{"Title": "ReLIEF: A Reinforcement-Learning-Based Real-Time Task Assignment Strategy in Emerging Fault-Tolerant Fog Computing", "Doi": "10.1109/JIOT.2023.3240007", "Authors": ["r. siyadatzadeh", "f. mehrafrooz", "m. ansari", "b. safaei", "m. shafique", "j. henkel", "a. ejlali"], "Key Words": ["fog computing", "internet of things (iot)", "reinforcement learning (rl)", "reliability", "resource allocation"], "Abstract": "due to the real time requirements in several iot applications fog computing has emerged to overcome the long latency and other constraints of cloud computing. due to the high probability of packet loss energy limitation of iot devices and the external disturbances that may frequently occur on the fog infrastructure the timing constraints of real time tasks may be compromised. therefore the reliability of executing real time tasks has always been a significant challenge in fog computing. in addition to the correct execution of the tasks it is also important to execute them before their deadlines according to their real time classification. state of the art methods generally focus on the delay or functionality of tasks in fog computing systems. however those methods do not widely focus on the reliability of tasks with real time constraints in dynamic environments. in this article a novel primary backup task assignment strategy based on machine learning  relief  is proposed to improve the reliability of fog based iot systems. to identify suitable nodes for the execution of the primary and backup tasks relief employs a reinforcement learning  rl  approach which has an outstanding performance in dynamic environments by establishing a balance between communication delay and workload on each fog device. based on the simulations our newly proposed technique has been able to reduce the amount of task dropping rate by up to 84% against the state of the art. moreover it is capable of balancing the workload distribution while increasing the reliability of the system by nearly 72% compared with its counterparts.", "Pub Date": "2023-06-01"}