{"Title": "Reputation Management for Consensus Mechanism in Vehicular Edge Metaverse", "Doi": "10.1109/JSAC.2023.3345382", "Authors": ["l. liu", "j. feng", "c. wu", "c. chen", "q. pei"], "Key Words": ["vehicular metaverse", "pbft consensus algorithm", "resource allocation", "vehicular edge computing"], "Abstract": "metaverse is a visually rich virtual space in which users can interact with each other. by introducing metaverse into vehicular networks vehicular metaverse can provide users real time immersive experiences based on augmented technologies. vehicular edge computing is a desirable approach to support computation intensive vehicular metaverse services by network resource collaboration. user collaboration needs to reach a consensus on perception information operation control and so on to realize user autonomy. however the existing consensus algorithms often require computational proof or frequent communication making them unsuitable for dynamically changing vehicular edge metaverse with low latency and energy restrictions. in this paper we have proposed a reputation model maintained in the vehicular edge metaverse to score the vehicles so the vehicles with a high reputation can be selected to participate in practical byzantine fault tolerant  pbft  consensus which improves the probability of success and credibility of consensus without increasing the number of participating vehicles. meanwhile an optimization problem is formulated for each vehicle to allocate its computation and communication resources to reach a pbft consensus. also the optimized communication time interval of each phase in the pbft consensus can be used as a reference for setting the agreed upper time which reduces the waiting time of vehicles and the probability of re consensus. simulation results have demonstrated that the proposed scheme effectively achieves pbft information consensus with lower latency and energy consumption and thus is more scalable and efficient.", "Pub Date": "2024-03-18"}