{"Title": "Research on Creating a Data Warehouse Based on E-Commerce", "Doi": "10.1109/SIST58284.2023.10223542", "Authors": ["g. turken", "v. pey", "z. abdiakhmetova", "z. temirbekova"], "Key Words": ["electrical business logistics", "data warehouse", "the etl", "hadoop"], "Abstract": "with the popularization of the internet and the rapid development of science and technology ‚äúonline shopping‚äù has become the norm in people lives and the e commerce industry is booming n addition it has led to an increase in logistics. in today business wars many companies strive for better development in enterprises of the same type which continue to improve their information capabilities and level. this paper in order to solve the problems such as the increasing of massive data of e commerce logistics and the phenomenon of data isolation in various business systems. the overall data warehouse is designed and constructed on the hadoop cluster environment and data warehouse tool hive is used to process data. extraction of data from etl sqoop and flume tools is used for retrieving business data and log data and other aspects of etl we use scala and java to easily process and filter data and upload it to hdfs. the data warehouse is divided into levels and subject areas to simplify data management. under the design of the entire system and data warehouse architecture the conceptual logical and physical models of the data warehouse are developed and the star model is selected as a dimensional model. finally the application and implementation of data warehouse based on e commerce logistics will be demonstrated. the development of a data warehouse based on e commerce logistics not only ensures that e commerce companies receive logistics information in a timely manner but also forces decision makers to adjust logistics strategies in a timely manner based on data information which can also improve user satisfaction and experience and reduce costs.", "Pub Date": "2023-08-28"}