{"Title": "Residual-Hypergraph Convolution Network: A Model-Based and Data-Driven Integrated Approach for Fault Diagnosis in Complex Equipment", "Authors": ["l. xia", "y. liang", "p. zheng", "x. huang"], "Pub Date": "2023-01-11", "Abstract": "timely and accurate fault diagnosis plays a critical role in today‚äôs smart manufacturing practices saving invaluable time and expenditure on maintenance process. to date numerous data driven approaches have been introduced for equipment fault diagnosis and part of them attempt to involve equipment knowledge in their data driven models. however those combinations mainly concentrate on feature engineering and superposition of their separate results without considering or leveraging the relationship between equipment knowledge and collecting sensor data. to fill this gap this research proposes a residual hypergraph convolution network  res hgcn  approach that holistically embeds equipment‚äôs structure and operational mechanisms as a hypergraph form into data driven model considering the reaction among equipment‚äôs components. the generic model based hypergraph construction framework is first introduced which represents a synergetic mechanism of complex equipment. then a multisensory data driven res hgcn approach combining residual block and hypergraph convolution network  hgcn  is presented for fault diagnosis based on predefined hypergraph. lastly a case study of turbofan engine is conducted and compared with other typical methods to reveal the superiority of the proposed approach. this work establishes the association of different sensing variables through equipment‚äôs structure and operational mechanisms thus integrating the advantages of model based and data driven based approaches holistically. it is envisioned that this research can provide insightful knowledge for many other model based and data driven integrated manufacturing scenarios.", "Doi": "10.1109/TIM.2022.3227609", "Key Words": ["complex equipment", "fault diagnosis", "graph convolution network (gcn)", "hypergraph", "smart manufacturing"]}