{"Title": "Resource Allocation in Quantum-Key-Distribution- Secured Datacenter Networks With Cloud‚ÄìEdge Collaboration", "Doi": "10.1109/JIOT.2023.3242725", "Authors": ["q. zhu", "x. yu", "y. zhao", "a. nag", "j. zhang"], "Key Words": ["caching", "cloud‚äìedge collaboration", "communication", "computation", "cryptographic", "datacenter networks (dcns)", "quantum key distribution (qkd)", "resource allocation"], "Abstract": "datacenter networks  dcns  with cloud‚äìedge collaboration are emerging to satisfy the communication computation and caching  3c  requirements of future services such as cloud based iot services. however the enroute data over dcns with cloud‚äìedge collaboration is likely to suffer from cyberattacks such as eavesdropping. a large number of services require not only 3c resources but also cryptographic resources for encryption to ensure high security. quantum key distribution  qkd  is a practical approach to provide secret keys for remote users with information theoretic security against attacks from quantum computing. a qkd secured dcn  qkd dcn  with cloud‚äìedge collaboration can be deployed to satisfy the communication computation caching and cryptographic  4c  requirements of services. this article innovatively solves the new 4c resource allocation  4cra  problem in the network to minimize the cryptographic resource consumption. it formulates an integer linear programming  ilp  model and proposes a heuristic cryptographic dependent 4cra algorithm to find optimal solutions. the proposed algorithm is compared with two baseline 4cra algorithms which respectively consider the minimized service delivery latency and the first fit resource availability. analytical simulations show that the proposed algorithm minimizes the key resource consumption ratio and the average key resource consumption under static and dynamic traffic scenarios in different network topologies.", "Pub Date": "2023-06-01"}