{"Title": "Resource Management and Reflection Optimization for Intelligent Reflecting Surface Assisted Multi-Access Edge Computing Using Deep Reinforcement Learning", "Doi": "10.1109/TWC.2022.3202948", "Authors": ["z. wang", "y. wei", "z. feng", "f. r. yu", "z. han"], "Key Words": ["multi-access edge computing", "intelligent reflecting surface", "resource allocation", "matching theory", "deep reinforcement learning"], "Abstract": "multi access edge computing  mec  enables the computation intensive and latency critical application to be processed at the network edge which reduces the transmission latency and energy consumption. the quality of the wireless channel seriously affects the performance of the edge network. consequently the performance of the edge network can be significantly improved from the perspective of communication. the recently advocated intelligent reflecting surface  irs  intelligently controls the radio propagation environment to improve the quality of wireless communication links. this paper proposes an edge heterogeneous network with the assistance of intelligent reflecting surface. specifically the macro base station and small base stations are equipped with mec servers and irs is adopted to provide an additional computation offloading link. the user association computation offloading and resource allocation as well as irs phase shift design are optimized with the aim of minimizing the long term energy consumption subject to the constraints imposed on quality of service  qos  and available resources. the challenge of the optimization problem is rooted from the fact that update timescale of user association is different from others. hence a two timescale mechanism is invoked by marrying tools from matching theory and deep reinforcement learning. more specifically the user association decision takes place in the long timescale. in the short timescale the computation offloading resource allocation and irs phase shift design strategy is performed. the effectiveness of the proposed two timescale mechanism is verified by the simulation results.", "Pub Date": "2023-02-10"}