{"Title": "Resource Management for IRS-Assisted WP-MEC Networks With Practical Phase Shift Model", "Doi": "10.1109/JIOT.2023.3313578", "Authors": ["n. li", "w. hao", "f. zhou", "z. chu", "s. yang", "p. xiao"], "Key Words": ["intelligent reflecting surface (irs)", "phase shift model", "resource management", "wireless powered mobile edge computing (wp-mec)"], "Abstract": "wireless powered mobile edge computing  wpmec  has been recognized as a promising solution to enhance the computational capability and sustainable energy supply for lowpower wireless devices  wds . however when the communication links between the hybrid access point  hap  and wds are hostile the energy transfer efficiency and task offloading rate are compromised. to tackle this problem we propose to employ multiple intelligent reflecting surfaces  irss  to wp mec networks. based on the practical irs phase shift model we formulate a total computation rate maximization problem by jointly optimizing downlink uplink irss passive beamforming downlink energy beamforming and uplink multiuser detection  mud  vector at haps task offloading power and local computing frequency of wds and the time slot allocation. specifically we first derive the optimal time allocation for downlink wireless energy transmission  wet  to irss and the corresponding energy beamforming. next with fixed time allocation for the downlink wet to wds the original optimization problem can be divided into two independent subproblems. for the wd charging subproblem the optimal irss passive beamforming is derived by utilizing the successive convex approximation  sca  method and the penaltybased optimization technique and for the offloading computing subproblem we propose a joint optimization framework based on the fractional programming  fp  method. finally simulation results validate that our proposed optimization method based on the practical phase shift model can achieve a higher total computation rate compared to the baseline schemes.", "Pub Date": "2024-02-05"}