{"Title": "Resource Scheduling in Edge Computing: Architecture, Taxonomy, Open Issues and Future Research Directions", "Doi": "10.1109/ACCESS.2023.3256522", "Authors": ["m. raeisi-varzaneh", "o. dakkak", "a. habbal", "b. -s. kim"], "Key Words": ["edge computing", "resource scheduling", "task offloading", "fairness", "load balancing"], "Abstract": "the implementation of the internet of things and 5g communications has pushed centralized cloud computing toward edge computing resulting in a paradigm shift in computing. edge computing allows edge devices to offload their overflowing computing tasks to edge servers. this procedure may completely exploit the edge server‚äôs computational and storage capabilities and efficiently execute computing operations. however transferring all the overflowing computing tasks to an edge server leads to long processing delays and surprisingly high energy consumption for numerous computing tasks. aside from this unused edge devices and powerful cloud centers may lead to resource waste. thus hiring a collaborative scheduling approach based on task properties optimization targets and system status with edge servers cloud centers and edge devices is critical for the successful operation of edge computing. the primary motivation behind this study is to introduce the most recent advancements related to resource scheduling techniques and address the existing limitations. firstly this paper presents a novel taxonomy of resource scheduling in edge computing that includes applications computational platforms algorithm paradigms and objectives. secondly it briefly summarizes the edge computing architecture for information and task processing. resource scheduling techniques are then discussed and compared based on four collaboration modes. according to the literature surveyed we briefly looked at the fairness and load balancing indicators in scheduling. additionally the survey conducted provides a comprehensive review of the state of the art edge computing issues and challenges. finally this paper highlights deep learning multi objective optimization and using green resources as key techniques for future directions.", "Pub Date": "2023-03-17"}