{"Title": "Resource Pricing Model Based on Two-Level Auction for the Cloudlet Federation", "Doi": "10.1109/ACCESS.2024.3377568", "Authors": ["y. chen", "h. ye", "x. li"], "Key Words": ["cloudlet federation", "resource pricing", "total profit", "two-level auction"], "Abstract": "cloudlet federation  clf  is a new computing architecture that integrates multiple cloudlet service providers  csps  and shares cloudlet resources between them. this architecture can reduce the cost of cloudlet deployment and management and improve the cloudlet utilization rate and service quality. as a new service provider framework clf needs to maximize the overall profit while ensuring the interests of each member. due to the differences in the number of users owned by each member and the number of resources that can be provided the interests of clf and users as well as the interests of each member of clf should be taken into account when pricing resources. therefore we construct a resource pricing model based on two level auction aiming at maximizing the total profit of the cloudlet federation. firstly the user and its associated csp will conduct an auction. if the user task fails to be auctioned successfully the associated csp will conduct a second level auction with the other csp of the federation. we design a dynamic quotation and price adjustment strategy in which the cost and resource utilization rate are taken into account when determining the asking prices of the resource providers and the task budget and deadline are taken into account when determining the quotations of the resource demanders. the algorithm of tarpa  resource pricing algorithm based on two level auction  is proposed to solve this model. the simulation results show that tarpa has better performance than uniform pricing algorithm  upa  and fixed proportion pricing algorithm  fppa  in terms of the total profit and resource utilization of cloudlet federation and has obvious advantages than game pricing approach  gpa  in terms of time cost.", "Pub Date": "2024-03-27"}