{"Title": "Revolutionizing Cyber Threat Detection With Large Language Models: A Privacy-Preserving BERT-Based Lightweight Model for IoT/IIoT Devices", "Doi": "10.1109/ACCESS.2024.3363469", "Authors": ["m. a. ferrag", "m. ndhlovu", "n. tihanyi", "l. c. cordeiro", "m. debbah", "t. lestable", "n. s. thandi"], "Key Words": ["cyber threat detection", "iot networks", "generative ai", "bert", "large language models"], "Abstract": "the field of natural language processing  nlp  is currently undergoing a revolutionary transformation driven by the power of pre trained large language models  llms  based on groundbreaking transformer architectures. as the frequency and diversity of cybersecurity attacks continue to rise the importance of incident detection has significantly increased. iot devices are expanding rapidly resulting in a growing need for efficient techniques to autonomously identify network based attacks in iot networks with both high precision and minimal computational requirements. this paper presents securitybert a novel architecture that leverages the bidirectional encoder representations from transformers  bert  model for cyber threat detection in iot networks. during the training of securitybert we incorporated a novel privacy preserving encoding technique called privacy preserving fixed length encoding  ppfle . we effectively represented network traffic data in a structured format by combining ppfle with the byte level byte pair encoder  bbpe  tokenizer. our research demonstrates that securitybert outperforms traditional machine learning  ml  and deep learning  dl  methods such as convolutional neural networks  cnns  or recurrent neural networks  rnns  in cyber threat detection. employing the edge iiotset cybersecurity dataset our experimental analysis shows that securitybert achieved an impressive 98.2% overall accuracy in identifying fourteen distinct attack types surpassing previous records set by hybrid solutions such as gan transformer based architectures and cnn lstm models. with an inference time of less than 0.15 seconds on an average cpu and a compact model size of just 16.7mb securitybert is ideally suited for real life traffic analysis and a suitable choice for deployment on resource constrained iot devices.", "Pub Date": "2024-02-16"}