{"Title": "RFID: Towards Low Latency and Reliable DAG Task Scheduling Over Dynamic Vehicular Clouds", "Doi": "10.1109/TVT.2023.3266582", "Authors": ["z. liu", "m. liwang", "s. hosseinalipour", "h. dai", "z. gao", "l. huang"], "Key Words": ["vehicular cloud computing", "directed acyclic graph", "task scheduling", "network dynamics", "volatile resources"], "Abstract": "vehicular cloud  vc  platforms integrate heterogeneous and distributed resources of moving vehicles to offer timely and cost effective computing services. however the dynamic nature of vcs  i.e. limited contact duration among vehicles  caused by vehicles' mobility poses unique challenges to the execution of computation intensive applications tasks with a directed acyclic graph  dag  structure where each task consists of multiple interdependent components  subtasks . in this paper we study the scheduling of dag tasks over dynamic vcs where multiple subtasks of a dag task are dispersed across vehicles and processed by vehicles cooperatively. we formulate dag task scheduling as a 0 1 integer programming problem aiming to minimize the overall task completion time while ensuring a high execution success rate which turns out to be np hard. to tackle the problem we develop a ranking and foresight integrated dynamic scheduling scheme  rfid . rfid consists of i  a dynamic downward ranking mechanism that sorts the scheduling priority of different subtasks while explicitly taking into account the sequential execution nature of dag  ii  a resource scarcity based priority changing mechanism that overcomes possible performance degradations caused by the volatility of vc resources  and iii  a degree based weighted earliest finish time mechanism that assigns the subtask with the highest scheduling priority to the vehicle which offers rapid task execution along with reliable transmission links. simulation results reveal the effectiveness of our proposed scheme in comparison to benchmark methods.", "Pub Date": "2023-09-18"}