{"Title": "Riemannian Statistics Meets Random Matrix Theory: Toward Learning From High-Dimensional Covariance Matrices", "Authors": ["s. said", "s. heuveline", "c. mostajeran"], "Pub Date": "2022-12-22", "Abstract": "riemannian gaussian distributions were initially introduced as basic building blocks for learning models which aim to capture the intrinsic structure of statistical populations of positive definite matrices  here called covariance matrices . while the potential applications of such models have attracted significant attention a major obstacle still stands in the way of these applications  there seems to exist no practical method of computing the normalising factors associated with riemannian gaussian distributions on spaces of high dimensional covariance matrices. the present paper shows that this missing method comes from an unexpected new connection with random matrix theory. its main contribution is to prove that riemannian gaussian distributions of real complex or quaternion covariance matrices are equivalent to orthogonal unitary or symplectic log normal matrix ensembles. this equivalence yields a highly efficient approximation of the normalising factors in terms of a rather simple analytic expression. the error due to this approximation decreases like the inverse square of dimension. numerical experiments are conducted which demonstrate how this new approximation can unlock the difficulties which have impeded applications to real world datasets of high dimensional covariance matrices. the paper then turns to riemannian gaussian distributions of block toeplitz covariance matrices. these are equivalent to yet another kind of random matrix ensembles here called ‚äúacosh normal‚äù ensembles. orthogonal and unitary ‚äúacosh normal‚äù ensembles correspond to the cases of block toeplitz with toeplitz blocks and block toeplitz  with general blocks  covariance matrices respectively.", "Doi": "10.1109/TIT.2022.3199479", "Key Words": ["riemannian gaussian distribution", "random matrix theory", "covariance matrix", "block-toeplitz covariance matrix", "high-dimensional data"]}