{"Title": "RIETD: A Reputation Incentive Scheme Facilitates Personalized Edge Tampering Detection", "Doi": "10.1109/JIOT.2023.3344709", "Authors": ["z. zhao", "s. zhao", "f. lv", "s. si", "h. zhu", "l. sun"], "Key Words": ["edge computing", "edge tampering detection", "reputation incentive"], "Abstract": "edge nodes provide service cooperatively in edge computing where third party nodes are common. however they cannot be fully trusted and can intentionally alter service results  e.g. edge tampering . although some mechanisms can help detect edge tampering they come with additional detection overhead. it is essential to note that most edge nodes are willing to serve honestly. therefore it is reasonable to decrease the detection frequency for those nodes which helps reduce the overhead. reputation is the common way to evaluate trustworthiness. in this article we propose a reputation incentive scheme called rietd which evaluates the reputations of edge nodes using their detection results. moreover rietd is loosely coupled with detection mechanisms as an external service. reputation is the fundamental parameter in rietd as it determines an acrlong en‚äôs appraisal weight on other nodes personalized detection strategy and node‚äôs obtained revenues in one service. we demonstrate that rietd does not significantly reduce the overall detection capability while the overhead is reduced effectively. for instance when the tampering rate of edge nodes is 10% and the target detection rate is 90% of a specific detection mechanism rietd reduces overhead by approximately 60%. if a full reputation node is detected to have tampered with the results its reputation recovery time is similar to the time required for reputation to improve from 0 to 1. moreover a node‚äôs expected revenue is lower than that of an honest node emphasizing the importance of serving honestly and continuously for edge nodes to earn higher revenue.", "Pub Date": "2024-04-09"}