{"Title": "RIS-Assisted UAV for Fresh Data Collection in 3D Urban Environments: A Deep Reinforcement Learning Approach", "Doi": "10.1109/TVT.2022.3203008", "Authors": ["x. fan", "m. liu", "y. chen", "s. sun", "z. li", "x. guo"], "Key Words": ["age of information", "data collection", "deep reinforcement learning", "reconfigurable intelligent surface", "unmanned aerial vehicle"], "Abstract": "dispatching flexible unmanned aerial vehicles  uavs  to collect data from distributed internet of things devices  iotds  is expected to be a promising technology to support time critical applications. however in urban environments the communication links between the uav and iotds are prone to be frequently blocked by buildings which severely impairs the freshness of information collected by the uav. thus how to overcome urban building blockages and ensure fresh data collection is quite important but neglected in existing works. in this paper for keeping the information fresh we propose to utilize the reconfigurable intelligent surface  ris  to assist the uav in mitigating signal propagation impairments caused by building blockages. the formulated optimization problem is minimizing the age of information  aoi  of all iotds by jointly optimizing the uav trajectory iotd scheduling and discrete phase shifts of the ris. it is a mixed integer non convex problem as well as lacking the complete channel state information  csi  thus using conventional optimization methods is intractable. to address this issue we present an effective and robust deep reinforcement learning  drl  based scheme called ‚äúsac ao ris‚äù where a soft actor critic  sac  algorithm with recent prioritized experience replay is designed for learning highly stable policies of uav trajectory and iotd scheduling and an alternating optimization  ao  algorithm is leveraged for solving ris phase shifts. finally simulation results demonstrate the effectiveness and superiority of our proposed scheme compared with other baseline approaches.", "Pub Date": "2023-01-13"}