{"Title": "RMDDQN-Learning: Computation Offloading Algorithm Based on Dynamic Adaptive Multi -Objective Reinforcement Learning in Internet of Vehicles", "Doi": "10.1109/TVT.2023.3270967", "Authors": ["x. zhang", "w. wu", "z. zhao", "j. wang", "s. liu"], "Key Words": ["computation offloading", "internet of vehicles", "mobile edge computing", "multi-objective reinforcement learning", "radial basis neural networks"], "Abstract": "as a promising computing paradigm driven by 5g mobile edge computing  mec  empowers smart vehicles to offload computation intensive tasks to edge devices in the internet of vehicles  iov  thereby providing a plethora of exciting applications  e.g. on board ar vr autonomous driving etc.  with the unique quality of service  qos  guarantees. however a key challenge of mec is how to keep the delay and energy consumption to a minimum in the computation offloading process while ensuring the privacy security of offloaded data and the load balancing of edge resources. namely how to simultaneously optimize multiple indicators that affect computation offloading which creates a challenging multi objective optimization  moo  problem. aiming at the moo problem we propose a novel multi objective reinforcement learning  morl  algorithm based on double deep q network  ddqn . each ddqn agent obtains rewards on different objectives according to different reward functions and dynamically approximates the optimal offloading decision on multiple objectives. to conquer the trade off problem among multiple conflicting objectives we propose a weight learning network based on radial basis function  rbf  networks which dynamically adjusts the weights by learning the value changes among the objectives. interestingly we discovered encouraging potential of morl for solving computation offloading problems in iov and numerical results show that the proposed algorithm outperforms traditional reinforcement learning methods by 30.24% in terms of overall energy consumption.", "Pub Date": "2023-09-18"}