{"Title": "RobustEdge: Low Power Adversarial Detection for Cloud-Edge Systems", "Doi": "10.1109/TETCI.2024.3360316", "Authors": ["a. moitra", "a. bhattacharjee", "y. kim", "p. panda"], "Key Words": ["adversarial attacks", "adversarial detection", "edge computing", "energy efficiency"], "Abstract": "in practical cloud edge scenarios where a resource constrained edge performs data acquisition and a cloud system  having sufficient resources  performs inference tasks with a deep neural network  dnn  adversarial robustness is critical for reliability and ubiquitous deployment. adversarial detection is a prime adversarial defense technique used in prior literature. however in prior detection works the detector is attached to the classifier model and both detector and classifier work in tandem to perform adversarial detection that requires a high computational overhead which is not available at the lowpower edge. therefore prior works can only perform adversarial detection at the cloud and not at the edge. this means that in case of adversarial attacks the unfavourable adversarial samples must be communicated to the cloud which leads to energy wastage at the edge device. therefore a low power edge friendly adversarial detection method is required to improve the energy efficiency of the edge and robustness of the cloud based classifier. to this end robustedge proposes quantization enabled energy separation  qes  training with ‚äúearly detection and exit‚äù to perform edge based low cost adversarial detection. the qestrained detector implemented at the edge blocks adversarial data transmission to the classifier model thereby improving adversarial robustness and energy efficiency of the cloud edge system. through extensive experiments on cifar10 cifar100 and tinyimagenet we find that 16 bit and 12 bit quantized detectors achieve a high auc score $>$ 0.9 while improving the energy efficiency of the cloud edge system by $>166\\times$ compared to prior cloud based adversarial detection approaches.", "Pub Date": "2024-03-27"}