{"Title": "Robust and Secure Medical Image Watermarking for Edge-Enabled e-Healthcare", "Doi": "10.1109/ACCESS.2023.3335172", "Authors": ["p. singh", "k. j. devi", "h. k. thakkar", "m. bilal", "a. nayyar", "d. kwak"], "Key Words": ["e-healthcare", "edge-enabled healthcare", "interpolation", "iomt", "medical image watermarking", "pseudorandom key", "reversible data hiding", "reversible watermarking scheme"], "Abstract": "advancements in networking technologies have enabled doctors to remotely diagnose and monitor patients using the internet of medical things  iomt  telemedicine and edge enabled healthcare. in e healthcare medical reports and patient records are typically outsourced to a server which can make them vulnerable to unauthorized access and tampering. therefore it is crucial to ensure the authorization security confidentiality and integrity of medical data. to address these challenges this paper proposes a novel reversible watermarking approach with a high payload and low computational cost. first the input medical image is divided into a border region  br  and a non border region  nbr . the nbr region is upscaled using neighbour mean interpolation  nmi  to ensure reversibility. the electronic patient record  epr  is encrypted using a pseudorandom key which is generated adaptively from the host medical image and the enigma machine. the encrypted epr is then embedded in the medical image using nmi. two levels of tamper detection  global and local  are performed at the receiver‚äôs end for higher accuracy. a global integrity code is generated and embedded in br using lsb embedding technique for global tamper detection. the experimental results show that the visual quality and robustness are both high  avg. psnr = 41.03 db and avg. ssim = 0.99 nc = 0.99 and ber = 0.0019 calculated for 100 images . the subjective and objective experimental analysis indicates that the proposed scheme is highly secure and the computational cost is also low. the average embedding and extraction time  including embedding encryption and decryption extraction process respectively  is 0.88 s and 0.83 s. it is resistant to various image processing attacks. a comparison with some of the most recent popular schemes confirms the scheme‚äôs effectiveness.", "Pub Date": "2023-12-07"}