{"Title": "RUnT: A Network Combining Residual U-Net and Transformer for Vertebral Edge Feature Fusion Constrained Spine CT Image Segmentation", "Doi": "10.1109/ACCESS.2023.3281468", "Authors": ["h. xu", "x. cui", "c. li", "z. tian", "j. liu", "j. yang"], "Key Words": ["spinal vertebral segmentation", "vision transformer", "residual u-net", "vertebral edge segmentation"], "Abstract": "scoliosis spinal deformity and vertebral spondylolisthesis are spinal disorders with high incidence which seriously affect people‚äôs lives and health. ct is an important medical tool for the detection and diagnosis of spinal disorders and provides a large amount of pathologically valid information in various clinical practices such as spine pathology assessment and computer assisted surgical interventions. as the spine presents long span complex shape of biological curve and high multi stage similarity in the sagittal plane of ct images. therefore fast and accurate spine segmentation technology has become an important research direction for computer aided diagnosis. we proposed an runt network based on the combination of residual u net feature extraction network and vision transformer structure for fast and efficient automatic segmentation of multiple vertebrae of the spine. the deep vertebral features are first extracted using the residual u net network to prevent gradient diffusion while improving the accuracy of vertebral contour segmentation. then the multi scale feature maps extracted by the residual structure containing rich vertebral superficial information are input to the edge segmentation module. we designed the vertebral contour feature extraction structure to refine the segmentation boundaries and ensure the segmentation consistency of each vertebra by combining the operations of deconvolution and convolution for three different scales of deep features.finally the global information extraction module based on transformer structure is combined with the local feature extraction module to achieve the blending of global location information of vertebrae with local features through the self attentive feature map of multi scale volume. by mixing edge features with semantic features the semantic confusion arising from the high similarity between vertebrae when the decoder extracts vertebral features is reduced. the model proposed in this paper is experimented on the ctspine1k and verse 20 public datasets. the results show that the model proposed in this paper obtains the state of the art segmentation performance with the average dsc scores of 88.4% and 81.5% on ctspine1k and verse 20 respectively while reducing the average distance of hd95 from 4.86 to 3.88.", "Pub Date": "2023-06-08"}