{"Title": "RWE: A Random Walk Based Graph Entropy for the Structural Complexity of Directed Networks", "Authors": ["c. zhang", "c. deng", "l. fu", "x. wang", "g. chen", "l. zhou", "c. zhou"], "Pub Date": "2024-02-22", "Abstract": "this paper studies a graph entropy measure to characterize the structural complexity of directed networks. since the von neumann entropy  vne  has found applications in many tasks by networked data but suffers from a high computational complexity in computing the laplacian spectrum we aim to propose a simple yet effective alternative method. considering that local nodal interactions collectively induce the information flow of the entire graph we are motivated to use the probability flow of random walks as the proxy of information flow in real world digraphs and correspondingly propose a random walk based entropy  rwe  to measure the average information that the random walker reaches each node. inspired by the close relation between laplacian spectrum and the perron vector we prove that rwe serves as a good approximation for the vne in digraphs with a guaranteed entropy gap. this approximation is further applied to a digraph similarity measure based on the jensen shannon divergence. therefore rwe exhibits interpretability scalability and capability of well capturing the structural complexity of digraphs as empirically verified. we further extend rwe to two dimensions by incorporating community structures which characterizes information flow both between and within communities. by proving that the difference between the one dimensional and two dimensional rwe reflects the extent to which the community structure is preserved we convert the community detection problem into the minimization of two dimensional rwe and design a greedy algorithm. various experiments confirm the superiority of our approach over the baselines.", "Doi": "10.1109/TNSE.2023.3342197", "Key Words": ["directed graph", "graph entropy", "random walk", "structural complexity", "von neumann entropy"]}