{"Title": "Salient Object Detection With Dual-Branch Stepwise Feature Fusion and Edge Refinement", "Doi": "10.1109/TCSVT.2023.3312859", "Authors": ["x. song", "f. guo", "l. zhang", "x. lu", "x. hei"], "Key Words": ["salient object detection", "dual-branch encoder", "attention", "gradual feature fusion", "edge enhancement"], "Abstract": "in recent years transformers have been gradually applied in salient object detection tasks with good results. however the transformer‚äôs global modeling capabilities can lead to the loss of local details that are important in salient object detection tasks. a feature extraction backbone based on a convolutional neural network  cnn  is good at extracting local detail features due to the gradual expansion of the receptive field but is limited by the size of the receptive field resulting in an insufficient ability to extract global semantic features. therefore this paper combines the transformer with a cnn and presents a dual branch encoder to ensure that the features extracted contain rich global semantic information as well as local detail features. in addition due to the different features extracted by the transformer and cnn noise may be introduced in the fusion of the two features so different features need to be processed correspondingly during fusion. the fusion enhancement module  fem  we propose fuses the features of the two branches step by step. a hybrid attention mechanism is used to carry out weighted fusion of different features. this progressive approach minimizes the differences between the features of the two branches so that the merged features retain the semantic and detail features extracted by the two branches to the greatest extent. considering the loss of detailed information caused by repeated downsampling we propose an edge refinement module  erm  to address the need for accurate outline prediction. this module leverages salient features to obtain edge features and gradually refines the prediction results by incorporating these edge features. it makes full use of the connection between salient features and edge features and does not introduce additional edges to extract branches. extensive experimental evaluations conducted on five benchmark tests demonstrate the superior performance of our method compared to other existing approaches. code can be found at https //github.com gfq1605694825/dsrnet main.", "Pub Date": "2024-04-04"}