{"Title": "SAP: Subchain-Aware NFV Service Placement in Mobile Edge Cloud", "Doi": "10.1109/TNSM.2022.3201388", "Authors": ["t. v. doan", "g. t. nguyen", "m. reisslein", "f. h. p. fitzek"], "Key Words": ["configuration cost", "multi-access edge computing (mec)", "network function placement", "network function virtualization (nfv)", "reuse", "service function chain (sfc)"], "Abstract": "existing network function virtualization  nfv  service placements that reuse already deployed network functions either reuse an entire service function chain  sfc  or only individual network functions while ignoring the chain configuration cost for configuring the sfc traffic steering and ignoring the reliability of the network functions. also the mobile edge cloud  mec  frameworks that are required to implement an nfv service placement should ideally seamlessly cooperate with the various existing nfv management and orchestration  mano  frameworks. however the existing mec frameworks lack multi mano support. we formulate the novel subchain aware nfv service placement  sap  optimization model that accounts for the configuration cost for stitching together reused network functions to an sfc and strives to reuse existing subchains of consecutive network functions  with already deployed sfc traffic steering  while accounting for the recovery cost of network functions with limited reliability. we develop tabu sap a tabu search approach to solve the sap optimization problem. furthermore we introduce the novel automated provisioning framework for mec  apmec  with open source openstack implementation to enable the deployment of tabu sap in real networks  apmec supports multiple manos through a loose coupling mano mec design. our tabu sap evaluations indicate an around eightfold increase of the number of supported sfcs compared to the state of the art reuse of individual network functions while substantially reducing the total cost which includes the chain configuration cost. also for long sfcs of seven or more network functions the tabu sap total cost is less than 10% higher than the optimal solution  which requires over ten times longer execution time .", "Pub Date": "2023-03-10"}