{"Title": "Satellite‚ÄìTerrestrial Collaborative Object Detection via Task-Inspired Framework", "Doi": "10.1109/JIOT.2023.3287973", "Authors": ["a. lu", "y. cheng", "y. hu", "z. cao", "y. chen", "z. li"], "Key Words": ["internet of things (iot)", "low earth orbit (leo) satellite", "optical remote sensing object detection", "satellite edge computing (sec)", "satellite-terrestrial collaboration"], "Abstract": "recently buoyed by advances in the space industry low earth orbit  leo  satellites have become an important part of the internet of things  iot . leo satellites have entered the era of a big data link with iot how to deal with the data from the satellite iot is a problem worthy of consideration. conventional object detection method in optical remote sensing simply transmits the raw data to the ground. however it ignores the properties of the images and the connection with the downstream task. to obtain efficient data transmission and accurate object detection we propose a task inspired satellite‚äìterrestrial collaborative object detection framework called stcod. it detects regions of interest  rois  and adopts a block based adaptive sampling method to compress the background  bg  in optical remote sensing images by introducing satellite edge computing  sec  on satellites. the stcod framework also sets the transmission priority of image blocks according to their contributions to the task and uses fountain code to ensure the reliable transmission of important image blocks. we build a whole software simulation framework to validate our method including the satellite module the transmission module and the terrestrial module. extensive experimental results show that the stcod framework can reduce the amount of downlink data decreased by 50.04% while losing the detection accuracy by 0.54%. in our simulated satellite‚äìterrestrial link the stcod framework can reduce the number of satellite to terrestrial transmissions by half. when the packet loss rate is between 5% and 20% the detection accuracy is lost only 0.05% to 0.5%.", "Pub Date": "2023-11-20"}