{"Title": "Satellite Edge Computing With Collaborative Computation Offloading: An Intelligent Deep Deterministic Policy Gradient Approach", "Doi": "10.1109/JIOT.2022.3233383", "Authors": ["h. zhang", "r. liu", "a. kaushik", "x. gao"], "Key Words": ["computation offloading", "deep deterministic policy gradient (ddpg)", "intersatellite cooperative computing", "resource allocation", "satellite edge computing"], "Abstract": "enabling a satellite network with edge computing capabilities can complement the advantages further of a single terrestrial network and provide users with a full range of computing service. satellite edge computing is a potentially indispensable technology for future satellite terrestrial integrated networks. in this article a three tier edge computing architecture consisting of the terminal‚äìsatellite‚äìcloud is proposed where tasks can be processed at three planes and intersatellites can cooperate to achieve on board load balancing. facing varying and random task queues with different service requirements we formulate the objective problem of minimizing the system energy consumption under the delay and resource constraints and jointly optimize the offloading decision communication and computing resource allocation variables. moreover the distribution of resources is based on the reservation mechanism to ensure the stability of the satellite terrestrial link and the reliability of computation process. to adapt to the dynamic environment we propose an intelligent computation offloading scheme based on the deep deterministic policy gradient  ddpg  algorithm which consists of several different deep neural networks  dnns  to output both discrete and continuous variables. additionally by setting the selection process of legal actions the simultaneous decisions on offloading locations and allocating resources under multitask concurrency is realized. the simulation results show that the proposed scheme can effectively reduce the total energy consumption of the system by ensuring that the task is completed on demand and outperform the benchmark algorithms.", "Pub Date": "2023-05-05"}