{"Title": "Scalable Transfer Evolutionary Optimization: Coping With Big Task Instances", "Authors": ["m. shakeri", "e. miahi", "a. gupta", "y. -s. ong"], "Pub Date": "2023-09-15", "Abstract": "in today‚äôs digital world we are faced with an explosion of data and models produced and manipulated by numerous large scale cloud based applications. under such settings existing transfer evolutionary optimization  treo  frameworks grapple with simultaneously satisfying two important quality attributes namely  1  scalability against a growing number of source tasks and 2  online learning agility against sparsity of relevant sources to the target task of interest. satisfying these attributes shall facilitate practical deployment of transfer optimization to scenarios with big task instances while curbing the threat of negative transfer. while applications of existing algorithms are limited to tens of source tasks in this article we take a quantum leap forward in enabling more than two orders of magnitude scale up in the number of tasks  that is we efficiently handle scenarios beyond 1000 source task instances. we devise a novel treo framework comprising two co evolving species for joint evolutions in the space of source knowledge and in the search space of solutions to the target problem. in particular co evolution enables the learned knowledge to be orchestrated on the fly expediting convergence in the target optimization task. we have conducted an extensive series of experiments across a set of practically motivated discrete and continuous optimization examples comprising a large number of source task instances of which only a small fraction indicate source‚äìtarget relatedness. the experimental results show that not only does our proposed framework scale efficiently with a growing number of source tasks but is also effective in capturing relevant knowledge against sparsity of related sources fulfilling the two salient features of scalability and online learning agility.", "Doi": "10.1109/TCYB.2022.3164399", "Key Words": ["big task instances", "online learning agility", "scalability", "transfer evolutionary optimization (treo)"]}