{"Title": "Scalable and Conflict-Free NTT Hardware Accelerator Design: Methodology, Proof, and Implementation", "Authors": ["j. mu", "y. ren", "w. wang", "y. hu", "s. chen", "c. -h. chang", "j. fan", "j. ye", "y. cao", "h. li", "x. li"], "Pub Date": "2023-04-20", "Abstract": "number theoretic transform  ntt  is useful for the acceleration of polynomial multiplication which is the main performance bottleneck in the next generation cryptographic schemes. different ntt based cryptographic algorithms have different security settings. the diverse application scenarios introduce different cost performance tradeoffs and hardware constraints. motivated by the emerging demand for more versatile ntt hardware accelerators we propose a new design methodology that can generate area efficient and high performance ntt accelerators for any length and modulus of ntt polynomials and single processing element  pe  or pe array with a varying number of layers. the proposed ntt accelerator architecture pivots on a conflict free memory access pattern for adaptation to different combinations of security and pe array configuration parameters. the proposed memory access pattern is formally proved to be conflict free for any parametric configurations. the criterion for read after write conflict without pipeline stall is also established. our proposed design methodology can produce ntt accelerators with single pe or multilayer pe array for different polynomial size and modulus with hardware area and computational efficiency comparable to accelerators customized for a fixed set of parameters. our proposed methodology produces parameterized accelerator with higher scalability than the existing parameterized accelerator design. on average the accelerators generated by our proposed method are 71.4% more area time efficient. up to 30.7% area time reduction over the most area time efficient state of the art scalable ntt accelerator can be achieved for the same security parameters.", "Doi": "10.1109/TCAD.2022.3205552", "Key Words": ["memory access pattern", "number theoretic transform (ntt)", "post-quantum cryptography (pqc)", "scalable hardware design"]}