{"Title": "Scaling up Superconducting Quantum Computers With Cryogenic RF-Photonics", "Authors": ["s. joshi", "s. moazeni"], "Pub Date": "2023-12-21", "Abstract": "today hundred qubit quantum computers require a dramatic scale up to millions of qubits to become practical for solving real world problems. although a variety of qubit technologies have been demonstrated scalability remains a major hurdle. superconducting  sc  qubits are one of the most mature and promising technologies to overcome this challenge. however these qubits reside in a millikelvin cryogenic dilution fridge isolating them from thermal and electrical noise. they are controlled by a rack full of external electronics through extremely complex wiring and cables. although thousands of qubits can be fabricated on a single chip and cooled down to millikelvin temperatures scaling up the control and readout electronics remains an elusive goal. this is mainly due to the limited available cooling power in cryogenic systems constraining the wiring capacity and cabling heat load management. in this article we focus on scaling up the number of xy control lines by using cryogenic rf photonic links. this is one of the major roadblocks to build a thousand qubit superconducting qc. we will first review and study the challenges of state of the art proposed approaches including cryogenic cmos and deep cryogenic photonic methods to scale up the control interface for sc qubit systems. we will discuss their limitations due to the active power dissipation and passive heat leakage in detail. by analytically modeling the noise sources and thermal budget limits we will show that our solution can achieve a scale up to a thousand of qubits. our proposed method can be seamlessly implemented using advanced silicon photonic processes and the number of required optical fibers can be further reduced by using wavelength division multiplexing  wdm .", "Doi": "10.1109/JLT.2023.3311806", "Key Words": ["quantum computing", "superconducting qubit", "thermal budget", "cooling power", "cryogenic rf-photonics"]}