{"Title": "Scheduling Precedence Constrained Tasks for Mobile Applications in Fog Computing", "Doi": "10.1109/TSC.2022.3192095", "Authors": ["k. li"], "Key Words": ["energy-constrained scheduling", "fog computing", "level-by-level scheduling", "list scheduling", "mobile application", "post-power-allocation algorithm", "pre-power-allocation algorithm", "precedence constrained tasks", "task scheduling", "time-constrained scheduling"], "Abstract": "we consider scheduling precedence constrained tasks of a mobile application in a fog computing environment which faces multiple challenges of precedence constraints power allocation and performance cost tradeoff. our strategies to handle the three challenges are described as follows. first in pre power allocation algorithms and post power allocation algorithms precedence constraints are handled by the classic list scheduling algorithm and the level by level scheduling method respectively. second in a pre power allocation algorithm  a post power allocation algorithm respectively  a power allocation strategy is determined before  after respectively  a computation offloading strategy is decided. third the performance cost tradeoff is dealt with by defining the energy constrained scheduling problem and the time constrained scheduling problem. that is between performance and cost we fix one and minimize the other. the main contributions of the present paper are highlighted as follows. we develop a class of pre power allocation algorithms for both energy constrained and time constrained scheduling which are based on the classic list scheduling algorithm and the equal energy method. we develop a class of post power allocation algorithms for both energy constrained and time constrained scheduling which are based on the level by level scheduling method and our previously proposed algorithms for independent tasks. we evaluate the proposed algorithms by extensive experiments on mobile applications with randomly generated directed acyclic graphs and identify the most effective and efficient heuristic algorithms. our research in this paper studies computation offloading in the context of traditional task scheduling while incorporating new and unique features of fog computing into consideration. to the author best knowledge there has been no such and similar study in the current literature.", "Pub Date": "2023-06-13"}