{"Title": "SCMA-Enabled Multi-Cell Edge Computing Networks: Design and Optimization", "Doi": "10.1109/TVT.2023.3242422", "Authors": ["p. liu", "k. an", "j. lei", "w. liu", "y. sun", "g. zheng", "s. chatzinotas"], "Key Words": ["internet of things", "sparse code multiple access (scma)", "multi-access edge computing (mec)", "binary offloading", "partial offloading", "resource management"], "Abstract": "multi access edge computing  mec  is regarded as a promising approach for providing resource constrained mobile devices with computing resources through task offloading. sparse code multiple access  scma  is a code domain non orthogonal multiple access  noma  scheme that can meet the demands of multi cell mec networks for high data transmission rates and massive connections. in this paper we propose an optimization framework for scma enabled multi cell mec networks. the joint resource allocation and computation offloading problem is formulated to minimize the system cost which is defined as the weighted energy cost and latency. due to the nonconvexity of the proposed optimization problem induced by the coupled optimization variables we first propose an algorithm based on the block coordinate descent  bcd  method to iteratively optimize the transmit power and edge computing resources allocation by deriving closed form solutions and further develop an improved low complexity simulated annealing  sa  algorithm to solve the computation offloading and multi cell scma codebook allocation problem. to solve the problem of partial state observation and timely decision making in long term optimization environment we put forward a multiagent deep deterministic policy gradient  maddpg  algorithm with centralized training and distributed execution. furthermore we extend the framework to the partial offloading case and propose an algorithm based on alternating convex search for solving the task offloading ratio. numerical results show that the proposed multi cell scma mec scheme achieves lower energy consumption and system latency in comparison to the orthogonal frequency division multiple access  ofdma  and power domain  pd  noma techniques.", "Pub Date": "2023-06-19"}