{"Title": "Scrutinization and Abstraction of Unstructured Electronic Health Records using Natural Language Processing and Deep Learning", "Doi": "10.1109/InC457730.2023.10262918", "Authors": ["r. nancy deborah", "s. alwyn rajiv", "a. vinora", "j. priyadharshini", "p. priyanga", "k. vidhya lakshmi"], "Key Words": ["electronics health record (ehr)", "natural language processing (nlp)", "deep learning", "recurrent neural network (rnn)"], "Abstract": "the healthcare industry produces patients' medical records in great numbers on daily basis. in hospitals these records are generated in both organized and unstructured formats. ehr commonly called electronic health records are the digital copy of the medical summary of the patient medical treatment lab reports of the patients and their medical history. electronic health records hold an enormous amount of data which is found useful for research in the medical field but the limitation is that it takes time to process those data. to overcome this disadvantage we are introducing the deep learning concept of recurrent neural network  rnn  for rapid analysis in ehrs. and the other limitation is that due to the presence of medical entities in ehr these are hard to process. to overcome this limitation nlp is used for the automatic processing of records. nlp has shown improvement in the performance of processing a large amount of data. the proposed work is about combining the knowledge of deep learning approaches with natural language processing to handle the ehr datasets to enhance the already existing methods in an ehr system. in this paper we study the patient unstructured ehrs and propose a novel algorithm named clinical nert. we predict the patient medical conditions based on the symptoms they experience. we train our model with the degree of symptoms for the disease along with its severity. here deep learning techniques are used to provide a way to boost the performance of the system by enhancing the precision of the decision making process regarding patients' disease prediction by processing the vibrantly rich information from the medical records.", "Pub Date": "2023-09-29"}