{"Title": "Seamless Transition From Machine Learning on the Cloud to Industrial Edge Devices With Thinger.io", "Doi": "10.1109/JIOT.2023.3268771", "Authors": ["a. l. bustamante", "m. a. patricio", "a. berlanga", "j. m. molina"], "Key Words": ["edge computing", "internet of things (iot)", "machine learning operations (mlops)", "thingerio"], "Abstract": "due to industry 4.0 machines can be connected to their manufacturing processes with the ability to react faster and smarter to changing conditions in a factory. previously internet of things  iot  devices could only collect and send data to the cloud for analysis. however the increasing computing capacity of today‚äôs devices allows them to perform complex computations on device resulting in edge computing. edge devices are a fundamental component of modern distributed real world artificial intelligence  artificial intelliegence  systems in industry 4.0 environments. as a result edge computing extends cloud computing capabilities by bringing services near the edge of a network and thus supports a new variety of artificial intelliegence services and machine learning  ml  applications. however there is a large difference between designing and training an ml model potentially in the cloud to create ml services that can be deployed and consumed on the edge. this article presents an ml workflow based on ml operations  mlops  over the thinger.io iot platform to streamline the transition from model training to model deployment on edge devices. the proposed workflow is composed of different elements such as the ml training pipeline ml deployment pipeline and ml workspace. similarly this article describes the ease of design and deployment of the proposed solution in a real environment where an anomaly detection service is implemented for detecting outliers on temperature and humidity measurements. the performance tests performed over the ml pipeline steps and the ml service throughput on the edge indicate that this workflow adds minimum overhead to the process providing a more reliable reusable and productive environment.", "Pub Date": "2023-09-06"}