{"Title": "Secrecy Performance Analysis and Optimization for UAV-Relay-Enabled WPT and Cooperative NOMA MEC in IoT Networks", "Doi": "10.1109/ACCESS.2023.3331752", "Authors": ["a. -n. nguyen", "d. -b. ha", "t. v. truong", "v. n. vo", "s. sanguanpong", "c. so-in"], "Key Words": ["internet of things", "unmanned aerial vehicles", "energy harvesting", "wireless power transfer", "non-orthogonal multiple access", "mobile edge computing", "physical layer security"], "Abstract": "this paper investigates a system for unmanned aerial vehicle  uav  enabled wireless power transfer  wpt  and non orthogonal multiple access  noma  mobile edge computing  mec  in the internet of things  iot    uwnmi wherein a uav equipped with an energy transmitter  et  acts as a relay. in particular we consider a situation involving two clusters of iot devices  ids  that have limited resources and therefore are unable to compute their own tasks and must instead offload them to a base station  bs  via the uav relay  ur  in the presence of a passive eavesdropper. in the uwnmi system the effects of imperfect channel state information  icsi  and imperfect successive interference cancellation  isic  are considered along with the usage of artificial noise  an  to improve the physical layer security  pls  of the system. we derive closed form expressions for the successful computation probability  scp  and secrecy outage probability  sop  under the nakagami  $\\mathfrak {m}$  fading channel model in order to evaluate the performance of the system. moreover we present optimization problems with the objectives of optimizing the position and height of the ur the time switching ratio  tsr  and the power allocation for the an in order to maximize the scp and minimize the sop. these problems are solved using a particle swarm optimization  pso  based algorithm. in addition monte carlo simulation results are presented to validate the accuracy of our analysis based on simulations of the system performance under different values of the system parameters including the number of antennas at the bs the number of ids in each cluster the tsr and the position and height of the ur.", "Pub Date": "2023-11-20"}