{"Title": "Secure Medical Data Against Unauthorized Access Using Decoy Technology in Distributed Edge Computing Networks", "Doi": "10.1109/ACCESS.2023.3344168", "Authors": ["i. khan", "a. ghani", "s. m. saqlain", "m. u. ashraf", "a. alzahrani", "d. -h. kim"], "Key Words": ["security and privacy", "protected health information", "health information exchange", "decoy document", "distributed edge computing networks"], "Abstract": "the recent advancements in cyber technology have facilitated the global electronic sharing of healthcare data among various healthcare professionals including clinicians researchers business administrators and others. fog computing is gaining popularity as a means of disseminating information across industries especially in medicine and healthcare due to its capability to manage vast amounts of information and data. the evolution of fog computing now allows it to be adaptable to various budget constraints within healthcare organizations thanks to technological progress. this adaptation includes features like real time data breach alerts and automated surveillance. as new communication and computing models emerge fresh security and privacy concerns arise within medical and health related data. existing data privacy and security protocols have proven inadequate in preventing data leaks and theft attacks especially those orchestrated by malicious parties. while medical data is stored in the cloud legitimate entities‚äô authorized access to medical documents remains a significant concern. therefore this article designs an authentication and authorization scheme that safeguards the privacy of users‚äô medical information documents. in response to this challenge we propose an innovative approach that leverages decoy information technology and user behavior profiling. this methodology aims to enhance the security of authorized data access within the fog environment ensuring the confidentiality of medical data. the results show that the proposed protocol is more secure against unauthorized access and security attacks and more computationally efficient than its counterparts.", "Pub Date": "2023-12-27"}