{"Title": "Securing Approximate Computing Systems via Obfuscating Approximate-Precise Boundary", "Doi": "10.1109/TCAD.2022.3168261", "Authors": ["p. yellu", "q. yu"], "Key Words": ["approximate computing (ac)", "computer and information processing", "computer security", "data integrity", "denial-of-service attack", "hardware", "image processing", "image analysis", "image recognition", "image edge detection", "memory", "phase change memory (pcm)", "signal processing", "noise", "signal to noise ratio", "peak signal-to-noise ratio (psnr)"], "Abstract": "approximate computing  ac  techniques have been leveraged to improve computing performance and energy efficiency with minor degradation in accuracy. recent literature indicates that some ac mechanisms could be exploited by attackers to implement new attack surfaces. to address the emerging attacks in ac systems we propose to obfuscate the approximate precise boundary  apb  with entry blurring and boundary broadening schemes. the proposed entry blurring scheme leverages a hidden quality metric which has a strong correlation with approximation errors to obscure the entrance of apb and eliminate the explicit transition between approximate and precise modes thus improving ac systems‚äô resilience against apb attacks. the proposed boundary broadening scheme enlarges the transition zone between approximate and precise modes by expanding a single apb threshold to two comparison thresholds and it further enables a random selection of ac modules in the candidate library. the protection mechanisms provided by our obfuscation method strengthens ac systems‚äô resilience against apb attacks. our case studies show that the proposed entry blurring scheme improves the application quality by up to 168% over the baseline and successfully achieves the desired accuracy. the latency overhead of our method is negligible and the increase on area and power cost can be minimized to 6% and 8% respectively.", "Pub Date": "2022-12-21"}