{"Title": "Secure Video Offloading in Multi-UAV-Enabled MEC Networks: A Deep Reinforcement Learning Approach", "Doi": "10.1109/JIOT.2023.3296613", "Authors": ["t. zhao", "f. li", "l. he"], "Key Words": ["deep reinforcement learning (drl)", "mobile-edge computing (mec)", "secure video offloading", "unmanned aerial vehicle (uav)"], "Abstract": "unmanned aerial vehicle  uav  enabled mobile edge computing  mec  has been widely applied in internet of things networks while the security risk of wireless computation offloading is still a challenging issue due to the openness nature of line of sight wireless channels between uavs and edge devices  eds . the existing secure offloading methods are not well targeted for video offloading in multi uav enabled mec networks since the joint potentiality of video distortion characteristics and multi uav flexible deployment in enhancing security is not exploited. in this article we propose a secure video offloading strategy based on deep reinforcement learning  drl  for a multi uav enabled mec system with a uav eavesdropper. a joint optimization problem of resolution adjustment offloading decision computing capability allocation communication resources orchestration and multi uav position deployment is formulated to minimize system energy consumption under the constraints of offloading security system latency and users‚äô quality of experience from the aspect of video frame analytic accuracy. since the formulated problem is a high dimensional nonlinear mixed integer np hard problem it is difficult to obtain the optimal solution via traditional optimization methods. to solve it we propose a drl algorithm  hrf td3  to instruct the agent to approach the optimal solution efficiently. the simulation results show that the proposed algorithm is superior to comparison algorithms in terms of system energy consumption eds‚äô energy consumption and system latency under the condition of wireless offloading security.", "Pub Date": "2024-01-08"}