{"Title": "Secure Offloading in NOMA-Enabled Multi-Access Edge Computing Networks", "Doi": "10.1109/TCOMM.2023.3342242", "Authors": ["t. -x. zheng", "x. chen", "y. wen", "n. zhang", "d. w. k. ng", "n. al-dhahir"], "Key Words": ["multi-access edge computing (mec)", "physical layer security (pls)", "secure offloading", "non-orthogonal multiple access (noma)", "secrecy outage probability (sop)", "total energy consumption"], "Abstract": "multi access edge computing  mec  has been recognized as a promising technology for enhancing the computation capability for next generation wireless networks. this paper studies physical layer security for an mec network where multiple users desire to securely offload part of their computation tasks to a base station  bs  simultaneously using non orthogonal multiple access  noma  subject to the potential overhearing of a malicious eavesdropper. the secrecy outage probability  sop  is adopted as a secrecy performance metric of the computation offloading against eavesdropping attacks. we aim to minimize the total energy consumption of the mec system subject to an individual sop constraint for each user. to this end we jointly design each user‚äôs local computing bits the transmit power the secrecy code rates as well as the successive interference cancellation decoding order at the bs side. as the formulated problem is highly non convex and challenging to solve we propose an efficient algorithm based on penalty dual decomposition  pdd  and sequential convex approximation methods to obtain an efficient suboptimal solution. to reduce the computational complexity we further propose a reverse recursion  rr  algorithm and derive semi closed form solutions to the design problem. numerical results are presented to validate the convergence and the effectiveness of our proposed algorithms. we show that the minimal total energy consumption obtained via either the pdd or rr method approaches the optimal performance of exhaustive search as the task duration increases. it is also demonstrated that the rr algorithm can achieve a comparable performance to that of the pdd algorithm while enjoying a much lower computational complexity.", "Pub Date": "2024-04-17"}