{"Title": "Self-Supervised Learning with Radiology Reports, A Comparative Analysis of Strategies for Large Vessel Occlusion and Brain CTA Images", "Doi": "10.1109/ISBI53787.2023.10230623", "Authors": ["s. pachade", "s. datta", "y. dong", "s. salazar-marioni", "r. abdelkhaleq", "a. niktabe", "k. roberts", "s. sheth", "l. giancardo"], "Key Words": ["large vessel occlusion", "ischemic stroke", "clip", "bert"], "Abstract": "scarcity of labels for medical images is a significant barrier for training representation learning approaches based on deep neural networks. this limitation is also present when using imaging data collected during routine clinical care stored in picture archiving communication systems  pacs  as these data rarely have attached the high quality labels required for medical image computing tasks. however medical images extracted from pacs are commonly coupled with descriptive radiology reports that contain significant information and could be leveraged to pre train imaging models which could serve as starting points for further task specific fine tuning.in this work we perform a head to head comparison of three different self supervised strategies to pre train the same imaging model on 3d brain computed tomography angiogram  cta  images with large vessel occlusion  lvo  detection as the downstream task. these strategies evaluate two natural language processing  nlp  approaches one to extract 100 explicit radiology concepts  rad spatialnet  and the other to create general purpose radiology reports embeddings  distil bert . in addition we experiment with learning radiology concepts directly or by using a recent self supervised learning approach  clip  that learns by ranking the distance between language and image vector embeddings. the lvo detection task was selected because it requires 3d imaging data is clinically important and requires the algorithm to learn outputs not explicitly stated in the radiology report.pre training was performed on an unlabeled dataset containing 1542 3d cta   reports pairs. the downstream task was tested on a labeled dataset of 402 subjects for lvo. we find that the pre training performed with clip based strategies improve the performance of the imaging model to detect lvo compared to a model trained only on the labeled data. the best performance was achieved by pre training using the explicit radiology concepts and clip strategy.", "Pub Date": "2023-09-01"}