{"Title": "Semantic Computing for Organizational Effectiveness: From Organization Theory to Practice through Semantics-Based Modelling", "Doi": "10.1109/ICSC59802.2024.00020", "Authors": ["m. rizk", "d. rosu", "m. fox"], "Key Words": ["cooperation", "coordination", "dependence", "organization", "ontology", "owl", "z3"], "Abstract": "a critical function of an organization is to foster the level of integration  coordination and cooperation  necessary to achieve its objectives. the need to coordinate and motivation to cooperate emerges from the myriad dependencies between an organization‚äôs members and their work. therefore to reason about solutions to coordination and cooperation problems requires a robust representation that includes the underlying dependencies. we find that such a representation remains missing from formal organizational models and we leverage semantics to bridge this gap. drawing on well established organizational research and our extensive fieldwork with one of north america‚äôs largest municipalities  1  we introduce an ontology formalized in first order logic that operationalizes concepts like outcome reward and epistemic dependence and their links to potential integration risks  and  2  present real world applications of this ontology to analyze and support integration in complex government infrastructure projects. our ontology is implemented and validated in both z3 and owl. key features of our model include inferable dependencies explainable coordination and cooperation risks and actionable insights on how dependency structures within an organization can be altered to mitigate the risks. conceptualizing real world challenges like incentive misalignment free riding and subgoal optimization in terms of dependency structures our semantics based approach represents a novel method for modelling and enhancing coordination and cooperation. integrated within a decision support system our model may serve as an impactful aid for organizational design and effectiveness. more broadly our approach underscores the transformative potential of semantics in deriving tangible real world value from existing organization theory.", "Pub Date": "2024-03-22"}