{"Title": "SemiPFL: Personalized Semi-Supervised Federated Learning Framework for Edge Intelligence", "Doi": "10.1109/JIOT.2022.3233599", "Authors": ["a. tashakori", "w. zhang", "z. jane wang", "p. servati"], "Key Words": ["edge computing", "edge heterogeneity", "edge intelligence", "federated learning", "meta learning", "personalized federated learning", "semi-supervised learning", "sensor analytics", "transfer learning"], "Abstract": "recent advances in wearable devices and internet of things  iot  have led to massive growth in sensor data generated in edge devices. labeling such massive data for classification tasks has proven to be challenging. in addition data generated by different users bear various personal attributes and edge heterogeneity rendering it impractical to develop a global model that adapts well to all users. concerns over data privacy and communication costs also prohibit centralized data accumulation and training. we propose semipfl that supports edge users having no label or limited labeled data sets and a sizable amount of unlabeled data that is insufficient to train a well performing model. in this work edge users collaborate to train a hyper network in the server generating personalized autoencoders for each user. after receiving updates from edge users the server produces a set of base models for each user which the users locally aggregate them using their own labeled data set. we comprehensively evaluate our proposed framework on various public data sets from a wide range of application scenarios from wearable health to iot and demonstrate that semipfl outperforms state of the art federated learning frameworks under the same assumptions regarding user performance network footprint and computational consumption. we also show that the solution performs well for users without label or having limited labeled data sets and increasing performance for increased labeled data and number of users signifying the effectiveness of semipfl for handling data heterogeneity and limited annotation. we also demonstrate the stability of semipfl for handling user hardware resource heterogeneity in three real time scenarios.", "Pub Date": "2023-05-05"}