{"Title": "Semi-Asynchronous Model Design for Federated Learning in Mobile Edge Networks", "Doi": "10.1109/TVT.2023.3298787", "Authors": ["j. zhang", "w. liu", "y. he", "z. he", "m. guizani"], "Key Words": ["federated learning", "mobile edge networks", "deep deterministic policy gradient", "semi-asynchronous update model", "energy efficiency"], "Abstract": "federated learning  fl  is a distributed machine learning  ml . distributed clients train locally and exclusively need to upload the model parameters to learn the global model collaboratively under the coordination of the aggregation server. although the privacy of the clients is protected which requires multiple rounds of data upload between the clients and the server to ensure the accuracy of the global model. inevitably this results in latency and energy consumption issues due to limited communication resources. therefore mobile edge computing  mec  has been proposed to solve communication delays and energy consumption in federated learning. in this paper we first analyze how to select the gradient values that help the global model converge quickly and establish theoretical analysis about the relationship between the convergence rate and the gradient direction. to efficiently reduce the energy consumption of clients during training on the premise of ensuring the local training accuracy and the convergence rate of the global model we adopt the deep deterministic policy gradient  ddpg  algorithm which adaptively allocates resources according to different clients' requests to minimize the energy consumption. to improve flexibility and scalability we propose a new the semi asynchronous federated update model which allows clients to aggregate asynchronously on the server and accelerates the convergence rate of the global model. empirical results show that the proposed algorithm $\\mathbf {1}$ not only accelerates the convergence speed of the global model but also reduces the size of parameters that need to be uploaded. besides the proposed algorithm $\\mathbf {2}$ reduces the time difference caused by user heterogeneity. eventually the semi asynchronous update model is better than the synchronous update model in communication time.", "Pub Date": "2023-12-18"}