{"Title": "Sequential Offloading for Distributed DNN Computation in Multiuser MEC Systems", "Doi": "10.1109/JIOT.2023.3279271", "Authors": ["f. wang", "s. cai", "v. k. n. lau"], "Key Words": ["computation offloading", "deep neural network (dnn) inferencing", "infinite-horizon markov decision process (mdp)", "mobile-edge computing (mec)", "parametric q-learning"], "Abstract": "this article studies a sequential task offloading problem for a multiuser mobile edge computing  mec  system. while most of the existing works consider static one shot offloading optimization with fixed wireless channel conditions and fixed computational tasks we consider a dynamic optimization approach which embraces wireless channel fluctuations and random deep neural network  dnn  task arrivals over an infinite horizon. specifically we introduce a local cpu workload queue  wd qsi  and a mec server workload queue  mec qsi  to model the dynamic workload of dnn tasks at each wireless device  wd  and the mec server respectively. the transmit power and the partitioning of the local dnn task at each wd are dynamically determined based on the instantaneous channel conditions  to capture the transmission opportunities  and the instantaneous wd qsi and mec qsi  to capture the dynamic urgency of the tasks  to minimize the average latency of the dnn tasks. the joint optimization can be formulated as an ergodic markov decision process  mdp  in which the optimality condition is characterized by a centralized bellman equation. however the brute force solution of the mdp is not viable due to the curse of dimensionality as well as the requirement for knowledge of the global state information. to overcome these issues we first decompose the mdp into multiple lower dimensional sub mdps each of which can be associated with a wd or the mec server. next we further develop a parametric online  $q$  learning algorithm so that each sub mdp is solved locally at its associated wd or the mec server. the proposed solution is completely decentralized in the sense that the transmit power for sequential offloading and the dnn task partitioning can be determined based on the local channel state information  csi  and the local wd qsi at the wd only. additionally no prior knowledge of the distribution of the dnn task arrivals or the channel statistics will be needed for the mec server. the proposed solution can achieve the superb performance over various state of the art baselines.", "Pub Date": "2023-10-03"}