{"Title": "Service Home Identification of Multiple-Source IoT Applications in Edge Computing", "Doi": "10.1109/TSC.2022.3176576", "Authors": ["j. li", "w. liang", "w. xu", "z. xu", "y. li", "x. jia"], "Key Words": ["internet of things (iot)", "mobile edge computing (mec)", "service provisioning for multi-source iot applications", "service operational cost minimization", "randomized algorithm", "online algorithm", "resource allocation and optimization", "dynamic iot application request admissions", "network slicing in edge computing"], "Abstract": "the real time communication requirement of the internet of things  iot  applications promotes the convergence of iot and mobile edge computing  mec . the mec paradigm greatly shortens the iot service delay by leveraging cloudlets  edge servers  of mec in the proximity of iot devices. considering limited computing and storage resources in an mec network it is challenging to provide efficient iot enabled service provisioning in such a network. in this article we study the service home identification problem of service provisioning for multi source iot applications in an mec network by identifying a service home  cloudlet  of each multi source iot application for its data processing querying and storage. each multi source iot application consists of multiple sources located at different geographical locations and each source uploads its data stream via a gateway  its nearby access point  to the mec network and the uploaded data then is aggregated with the stream data of the other sources of the iot application at the service home. we here focus on two novel service home identification problems  the service operational cost minimization problem with the aim to minimize the total service operational cost by admitting as many multi source iot applications as possible and the online throughput maximization problem with the aim to maximize the number of multi source iot application requests admitted. we first show that both the problems are np hard. we then formulate an integer linear programming  ilp  solution to the service operational cost minimization problem and propose a randomized algorithm with high probability and a deterministic approximation algorithm respectively at moderate resource capacity violations. we third develop an efficient heuristic algorithm for the problem without any resource violation. furthermore we deal with the online throughput maximization problem under an assumption that multi source iot application requests arrive one by one without the knowledge of future arrivals for which we formulate an integer linear programming  ilp  solution to its offline version followed by devising an online algorithm with competitive ratio. we finally evaluate the performance of the proposed algorithms through experimental simulations. simulation results demonstrate that the proposed algorithms are promising and outperform their comparison counterparts.", "Pub Date": "2023-04-07"}