{"Title": "Serving SDGs via Bank Mergers: A Neuro Quantum Fuzzy Approach for Qatari Banks", "Authors": ["t. a. a. al-binali", "a. f. aysan", "h. dƒ±n√ßer", "ƒ∞. m. √únal", "s. y√ºksel"], "Pub Date": "2023-07-13", "Abstract": "determining the right merger strategy for banks is an important step. in this way risks can be managed more effectively and long term financial performance can be achieved. however there are many different factors that affect this process. it is not optimal for banks to consider all factors due to budget constraints. in this context it is important to determine the most important ones among these criteria. accordingly the purpose of this study is to evaluate alternative merger strategies for banks. for this purpose 12 different sustainable development goals  sdgs  based criteria are selected. multi stepwise weight assessment ratio analysis  m swara  methodology is used to compute the weights of these items. the main contribution of this study is that the implications of the merger process on sdgs can be examined. furthermore a new methodology  m swara  is proposed in this study that has an increasing impact on the methodological originality. the findings indicate that increasing profitability has the greatest weight  0.095 . similarly market share is found as the second most critical factor  0.092  for merger decisions in the banking industry. a profitable bank can attract more investors and with the help of this situation it can be much easier to raise capital and access funding from capital markets. these issues can be used to finance projects that align with sdgs such as renewable energy affordable housing or clean water initiatives. in addition to this situation profitability can also have a positive impact on innovation and technological advancement. with sufficient resources a bank can invest in research and development technological infrastructure and innovative products and services. owing to these investments sustainable development can be promoted.", "Doi": "10.1109/ACCESS.2023.3292238", "Key Words": ["balanced scorecard", "sdgs", "m&a", "banking", "m-swara", "quantum spherical fuzzy sets"]}