{"Title": "Service Satisfaction-Oriented Task Offloading and UAV Scheduling in UAV-Enabled MEC Networks", "Doi": "10.1109/TWC.2023.3267330", "Authors": ["j. tian", "d. wang", "h. zhang", "d. wu"], "Key Words": ["multi-access edge computing (mec)", "unmanned aerial vehicle (uav)", "task priority", "task offloading", "uav trajectory", "genetic algorithm"], "Abstract": "with the development of computation intensive applications unmanned aerial vehicle  uav  enabled multi access edge computing  mec  provides task offloading service for the users with or without terrestrial infrastructure support. meanwhile the next generation of uavs communication systems are expected to be user centric. therefore more attention should be paid to users‚äô satisfaction with the offered service. in this paper we study the service satisfaction oriented task offloading and uav scheduling problem for uav enabled mec networks where the task priorities are considered based on the delay requirements of users‚äô tasks and the remaining energy status of users. specifically we firstly divide the users into different groups via the k means based grouping algorithm. then we develop a novel user satisfaction model by jointly considering the task processing delay and energy saving based on which a total user satisfaction maximization problem is formulated to jointly optimize the task offloading decisions and uav scheduling strategy. to solve the formulated problem we decompose it into two sub problems i.e. the uav scheduling sub problem and the task offloading sub problem. to solve the first sub problem we develop a genetic algorithm  ga  based uav scheduling algorithm through dealing with multiple balanced assignment problems. to address the second sub problem a ga based task offloading algorithm is developed. then we propose a joint task offloading and uav scheduling optimization algorithm to solve the original optimization problem. finally simulation results demonstrate that the proposed optimization algorithm not only converges fast but also improves the total users‚äô satisfaction greatly. the total users‚äô satisfaction improved by the proposed scheme is up to 16.9% in the case of 170 users.", "Pub Date": "2023-12-12"}