{"Title": "Shapley Value-Based Computation Offloading for Edge Computing", "Doi": "10.1109/TVT.2023.3250486", "Authors": ["y. chai", "x. -j. zeng"], "Key Words": ["edge computing", "computation offloading", "non-linear programming", "shapley value"], "Abstract": "for wireless communications and the internet of things edge computing has emerged as the potential solution to meet users' demand of fast communications and effective computation by allocating computing resources closer to users and tasks and then reducing the process time and avoiding the transmission of huge amount of data. however to achieve the potential of edge computing an effective computation offloading scheme is a key issue needed to be addressed because it determines how efficient the computing resource allocation and the whole network performance are. toward providing a solution to such an important issue this paper formulates the offloading problem as a cooperation game problem about how to share the reasonably adjacent computing resource to users to form an efficient coalition network for the best performance and then proposes a shapley value based computation offloading approach. the proposed approach includes three main steps  firstly following the principle of edge computing  users to be close to resources  and reducing the complexity a clustering algorithm is proposed to divide the whole network into clusters and each cluster has one edge node. then the non linear programming is implemented in each cluster and neighboring two or three clusters respectively to obtain the delay values and task allocation results. finally to check whether cooperation and coalition among neighboring clusters can bring better network performance shapley value is used to evaluate whether combining neighboring clusters in edge computing for the first time. the objective values obtained from the non linear programming are used to evaluate the profit of different coalitions which are used to compute shapley values to determine the final best coalitions between clusters. the numerical results show the effectiveness of the proposed method.", "Pub Date": "2023-07-18"}