{"Title": "Shoes With Integrated Electrodes to Measure Floor Impedance and Its Application to Automatic Pathway Classification", "Authors": ["s. sharma", "b. george"], "Pub Date": "2024-02-22", "Abstract": "automatic classification of pathways is very useful as it aids safe walking of the visually impaired lower leg amputees and diabetic patients with mono filament issues. it is also useful for the guided navigation of robots and autonomous vehicles. most of the existing pathway or pathway classification schemes use properties such as the color or image texture of the pathway. due to this limited information the classification accuracy is limited. in addition it fails to sense the pathway condition such as wet or dry. in this article we show that the classification can be improved by integrating electrical impedance information of the floor or pathway. obtaining the current floor impedance is a challenging task and it needs to be achieved using a wearable. in a recent work of ours a basic idea of measuring the impedance of the floor between the shoes of a person was presented recently. for this the shoe is modified and integrated with flexible electrodes in it. this article presents a thorough scientific study of the scheme. in addition a detailed practical evaluation of the sensor prototype on various pedestrian pathways like soil mud road grass etc. an analysis of sources of error and the application of it in aiding the classification are presented. an analytical model is derived using conformal mapping to compute the electrical properties such as resistance and capacitance of the pathway between the shoes. the accuracy of the model is verified using finite element analysis  fea . existing image based classification techniques use deep learning algorithms. the new information i.e. the impedance of the floor is provided and integrated into this algorithm and the results showed that classification accuracy is improved significantly from  $78.52\\%$  to 100%.", "Doi": "10.1109/TIM.2024.3365573", "Key Words": ["conformal mapping", "deep learning", "impedance measurement", "industrial robots", "pathway classification", "prostheses", "visually impaired", "wearable sensors"]}