{"Title": "Shortest Path Finding in Quantum Networks With Quasi-Linear Complexity", "Authors": ["s. santos", "f. a. monteiro", "b. c. coutinho", "y. omar"], "Pub Date": "2023-01-24", "Abstract": "a fully quantum network implies the creation of quantum entanglement between a given source node and some other destination node with a number of quantum repeaters in between. this paper tackles the problem of quantum entanglement distribution by solving the routing problem over an infrastructure based on quantum repeaters and with a finite number of pairs of entangled qubits available in each link. the network model considers that link purification is available such that a nested purification protocol can be applied at each link to generate entangled qubits with higher fidelity than the original ones. a low complexity multi objective routing algorithm to find the shortest path between any two given nodes is proposed and assessed for random networks using a fairly general path extension mechanism that can fit a large family of particular technological requirements. different types of quantum protocols require different levels of fidelity for the entangled qubit pairs. for that reason the proposed algorithm identifies the shortest path between two nodes that assures an end to end fidelity above a specified threshold. the minimum requirements for the end to end entanglement fidelity depend on the whole extension of the paths and cannot be looked at as a local property of each link. moreover one needs to keep track not only of the shortest path but also of longer paths holding more entangled qubits than the shorter paths in order to satisfy the fidelity criterion. thus standard single parameter shortest path algorithms do not necessarily converge to the optimal solution. the problem of finding the best path in a network subject to multiple criteria  known as multi objective routing  is in general an np hard problem due to the rapid growth of the number of stored paths. this work proposes a metric that identifies and discards paths that are objectively worse than others. by doing so the time complexity of the proposed algorithm scales near to linearly with respect to the number of nodes in the network showing that the shortest path problem in quantum networks can be solved with a complexity very close to the one of the classical counterparts. that is analytically proved for the case where all the links of a path have the same fidelity  homogeneous model . the algorithm is also adapted to a particular type of path extension where different links along a path can be purified to different degrees asserting its flexibility and near to linearity even when heterogeneous fidelities along the sections of a path are considered.", "Doi": "10.1109/ACCESS.2023.3237997", "Key Words": ["quantum networks", "quantum repeaters", "path-finding algorithm", "end-to-end fidelity", "multi-objective routing"]}