{"Title": "Simulation Paths for Quantum Circuit Simulation With Decision Diagrams What to Learn From Tensor Networks, and What Not", "Authors": ["l. burgholzer", "a. ploier", "r. wille"], "Pub Date": "2023-03-20", "Abstract": "simulating quantum circuits on classical computers is a notoriously hard yet increasingly important task for the development and testing of quantum algorithms. in order to alleviate this inherent complexity efficient data structures and methods such as tensor networks and decision diagrams have been proposed. however their efficiency heavily depends on the order in which the individual computations are performed. for tensor networks the order is defined by so called contraction plans and a plethora of methods has been developed to determine suitable plans. on the other hand simulation based on decision diagrams is mostly conducted in a straight forward i.e. sequential fashion thus far. in this work we study the importance of the path that is chosen when simulating quantum circuits using decision diagrams and show conceptually and experimentally that choosing the right simulation path can make a vast difference in the efficiency of classical simulations using decision diagrams. we propose an open source framework  available at github.com cda tum ddsim  that not only allows to investigate of dedicated simulation paths but also to reuse of existing findings e.g. obtained from determining contraction plans for tensor networks. experimental evaluations show that translating strategies from the domain of tensor networks may yield speedups of several factors compared to the state of the art. furthermore we design a dedicated simulation path heuristic that allows to improve the performance even further‚äîfrequently yielding speedups of several orders of magnitude. finally we provide an extensive discussion on what can be learned from tensor networks and what cannot.", "Doi": "10.1109/TCAD.2022.3197969", "Key Words": ["classical quantum circuit simulation", "decision diagrams", "quantum computing", "quantum data structures", "tensor networks"]}