{"Title": "SM-RNet: A Scale-Aware-Based Multiattention-Guided Reverse Network for Pulmonary Nodules Segmentation", "Authors": ["t. tang", "r. zhang", "k. lin", "f. li", "x. xia"], "Pub Date": "2023-10-05", "Abstract": "lung cancer is a leading cause of cancer death but its mortality continues to decline substantially benefiting from early screening and or treatment of lung nodules. therefore the accurate and robust segmentation of pulmonary nodules from lung computed tomography  ct  is an essential task. however automated solution is still challenging due to the high variability blurred edges and complex background of pulmonary nodules in ct scans. in this article we propose a novel scale aware based multiattention guided reverse network  sm rnet  for pulmonary nodules segmentation which makes full use of the complementary information from different attention dimensions and scales and progressively obtains the complete object by reverse erasure  re  manner consisting of two stages. stage i performs weighted cross scale fusion for features with different scale attentions to extract the intermediate multiscale features  mfs  with channel and scale awareness and stage ii adaptively selects features from the most appropriate scale for the target and sequentially mines the details required for the segmentation task by a new scale guided spatial attention  ssa  block and a new re block. in addition the model is equipped with two stage deep supervision. we evaluate the segmentation accuracy of our method by calculating the dice similarity coefficient  di  jaccard index  ji  hausdorff distance  hd  recall specificity  spe  and precision  pre  on an internal institution dataset from the fudan university shanghai cancer center  fuscc  and a public dataset lung nodule analysis 2016  luna16 . our proposed sm rnet achieves the dice scores of 89.290% ¬± 0.040% and 86.496% ¬± 0.076% and an hd of 5.532 ¬± 0.186 and 6.131 ¬± 0.288 for fuscc and luna respectively. sm rnet significantly outperforms other state of the art  sota  networks. in addition the visualization results of qualitative analysis show that the network has strong robustness.", "Doi": "10.1109/TIM.2023.3315365", "Key Words": ["intermediate multiscale features (mfs)", "lung nodule segmentation", "reverse erasure (re)", "scale aware", "scale-guided spatial attention (ssa)"]}