{"Title": "Soft Sensor Model for Billet Temperature in Multiple Heating Furnaces Based on Transfer Learning", "Authors": ["n. zhai", "x. zhou", "s. li", "h. shi"], "Pub Date": "2023-05-02", "Abstract": "billet heating temperature directly affects the quality of the billet but the existing technology cannot measure the billet surface temperature. therefore we accurately predict the temperature of the furnace by a soft sensor to approximate the billet temperature. limited by the complexity of the heating process and the lack of computing resources in factories the existing research pays little attention to or even cannot meet the temperature prediction requirements of multiple heating zones in multiple heating furnaces. to address the above problems we propose a temperature prediction method for multiheating furnaces based on transfer learning and knowledge distillation. the method establishes a multisource domain model of a source domain furnace on a cloud platform. then the multisource knowledge is transferred to the target domain heating furnace and the target domain teacher model is established by fine tuning the source domain model through the target domain data. next to efficiently predict the furnace temperature a shallow multitask student model is established at the edge server to predict multiple heating zones in the target furnace. furthermore a knowledge distillation method for regression prediction is proposed so that the student model can improve the prediction accuracy under the guidance of the cloud teacher model. the effectiveness of the method is verified by experiments on 20 different heating zone datasets in two heating furnaces and two wind turbine datasets. the consistency of multiple experiments shows that this method cannot only improve the accuracy by transferring the source domain knowledge but also reduce the size of model parameters by knowledge distillation on the premise of meeting the requirements of prediction error.", "Doi": "10.1109/TIM.2023.3267520", "Key Words": ["furnace temperature prediction", "knowledge distillation", "multitask learning (mtl)", "transfer learning"]}