{"Title": "SPACE: Segment Prefetching and Caching at the Edge for Adaptive Video Streaming", "Doi": "10.1109/ACCESS.2023.3252365", "Authors": ["j. aguilar-armijo", "c. timmerer", "h. hellwagner"], "Key Words": ["adaptive video streaming", "content delivery", "has", "edge computing", "cellular network edge", "mec", "segment prefetching", "segment caching"], "Abstract": "multi access edge computing  mec  is a new paradigm that brings storage and computing close to the clients. mec enables the deployment of complex network assisted mechanisms for video streaming that improve clients‚äô quality of experience  qoe . one of these mechanisms is segment prefetching which transmits the future video segments in advance closer to the client to serve content with lower latency. in this work for has based  http adaptive streaming  video streaming and specifically considering a cellular  e.g. 5g  network edge we present our approach segment prefetching and caching at the edge for adaptive video streaming  space . we propose and analyze different segment prefetching policies that differ in resource utilization player and radio metrics needed and deployment complexity. this variety of policies can dynamically adapt to the network‚äôs current conditions and the service provider‚äôs needs. we present segment prefetching policies based on diverse approaches and techniques  past segment requests segment transrating  i.e. reducing segment bitrate quality  markov prediction model machine learning to predict future segment requests and super resolution. we study their performance and feasibility using metrics such as qoe characteristics computing times prefetching hits and link bitrate consumption. we analyze and discuss which segment prefetching policy is better under which circumstances as well as the influence of the client side adaptive bit rate  abr  algorithm and the set of available representations  ‚äúbitrate ladder‚äù  in segment prefetching. moreover we examine the impact on segment prefetching of different caching policies for  pre  fetched segments including least recently used  lru  least frequently used  lfu  and our proposed popularity based caching policy least popular used  lpu .", "Pub Date": "2023-03-09"}