{"Title": "Space and Time-Efficient Quantum Multiplier in Post Quantum Cryptography Era", "Authors": ["d. s. c. putranto", "r. w. wardhani", "h. t. larasati", "h. kim"], "Pub Date": "2023-03-09", "Abstract": "this paper examines the asymptotic performance of multiplication and the cost of quantum implementation for the naive schoolbook karatsuba and toom cook methods in the classical and quantum cases and provides insights into multiplication roles in the post quantum cryptography  pqc  era. further considering that the lattice based pqc algorithm is based on polynomial multiplication algorithms including the toom cook 4 way multiplier as its fundamental building block we propose a higher degree multiplier the toom cook 8 way multiplier which has the lowest asymptotic performance and implementation cost. additionally the designed multiplication will include additional sub operations to complete the multiplication of large integers in order to prevent side channel attacks. to design our toom cook 8 way in detail we employ detailed step computations such as splitting evaluation point wise multiplication interpolation and recomposition as well as several strategies to reduce space and time requirements. existing asymptotic performance and quantum implementation cost multipliers are compared with our 2 way 4 way and 8 way toom cook multiplier designs. our toom cook 8 way quantum multiplier has the lowest asymptotic performance analysis or qubit count in terms of space efficiency with  $n\\left {\\frac {15}{8}}\\right ^{\\frac {\\log 15}{ 2\\log 15   \\log 8 } \\log  {8} n}$  or asymptotically  $\\mathcal {o}  n^{1.245} $ . the design has the lowest logical toffoli counts bound at  $112n^{\\log  {8} 15} 128n $  and toffoli depth of  $n\\left {\\frac {15}{8}}\\right ^{1 \\frac {\\log 15}{ 2\\log 15   \\log 8 } \\log  {8} n }$  asymptotically close to  $\\mathcal {o} n^{1.0569} $  which corresponds to a space  and time efficient multiplication.", "Doi": "10.1109/ACCESS.2023.3252504", "Key Words": ["post quantum cryptography", "quantum multiplication", "karatsuba", "toom-cook 8-way", "asymptotic performance"]}