{"Title": "Spatially-Temporally Collaborative Service Placement and Task Scheduling in MEC Networks", "Doi": "10.1109/TVT.2023.3297169", "Authors": ["c. feng", "q. yang", "t. q. s. quek", "w. wu", "k. guo"], "Key Words": ["mobile edge computing", "collaborative service placement and task scheduling", "decentralized algorithm", "stochastic optimization"], "Abstract": "mobile edge computing provides the opportunity for edge systems to underpin a variety of computation intensive yet delay sensitive applications. we acknowledge that the limited computing and storage resource of an individual edge server allows only a subset of services to be placed at a time. this raises the question of service placement which refers to where to place each type of service. moreover which service to place allows which type of tasks to be processed and thereby affects task scheduling performance which refers to where whether to schedule each task and task splitting among edge and cloud. respect of the interactions between service placement and task scheduling  spts  a joint optimized design of spts is investigated in this article. our main contribution is a novel spatial temporal collaboration of spts to minimize the overall cost of edge systems. spatial collaboration is explored to enable edge servers within specific geographic regions collaboratively serve users' demands while temporal collaboration is explored to optimize the spts in multiple time slots and pursue a long term performance. we first propose an online and decentralized algorithm for spatial temporal collaborative of spts. we then extend the proposed single timescale of the proposed algorithm into multiple timescales to have service  re placed at a larger timescale and hence alleviate service interruption. while proved to preserve the asymptotic optimality the larger timescale slow down the optimal service placement decision. a learn and adapt strategy is further designed to speed up the service placement. theoretical analysis and simulations are performed to validate the efficiency of the proposed algorithm.", "Pub Date": "2023-12-18"}