{"Title": "SPEAR-Net: Self-Prior Enhanced Artifact Removal Network for Limited-Angle DECT", "Authors": ["k. chen", "c. yang", "h. tang", "x. ji", "g. coatrieux", "j. -l. coatrieux", "y. chen"], "Pub Date": "2023-04-06", "Abstract": "dual energy computed tomography  dect  is a fully functional instrument for disease detection in clinical practice because of its ability to identify substances and quantify materials. in some practical applications due to the limitation of scanning conditions projection data can only be collected from a limited angle and the consistency of measurement cannot be guaranteed. the existing dect reconstruction methods fail to address well the severe artifacts and noise in dect images caused by limited angle scanning. in this article we proposed a self prior enhanced artifact removal network  spear net  for limited angle dect which can effectively combine the complementary information in the high  and low energy domains and self prior information to contribute positively to the reconstruction of high quality dect images. the spear net consists of an image domain self prior network  ip net  two dual energy image domain self prior networks  dip nets  and a dual energy sinogram domain self prior network  dsp net . specifically the ip net and dip net are adopted to extract the features of the dect reconstructed images under dual quarter scanning as prior information. the self prior projection obtained from the forward projection of the prior computed tomography  ct  image is harnessed by dsp net to complete the dual energy limited angle projection data and to facilitate the performance of spear net in removing artifacts in the reconstructed dual energy images. qualitative and quantitative analyses demonstrate the superior capability of spear net in dual energy limited angle projection data complementation detail preservation and artifact removal. two popular dect applications virtual noncontrast  vnc  imaging and iodine contrast agent quantification reveal that images reconstructed by spear net have promising clinical significance.", "Doi": "10.1109/TIM.2023.3260280", "Key Words": ["deep learning", "dual-energy computed tomography (dect)", "iodine contrast agent quantification", "limited-angle reconstruction", "virtual noncontrast (vnc) imaging"]}