{"Title": "SPIE-DIR: Self-Prior Information Enhanced Deep Iterative Reconstruction Using Two Complementary Limited-Angle Scans for DECT", "Authors": ["y. zhang", "d. hu", "t. lyu", "g. quan", "j. xiang", "g. coatrieux", "s. luo", "y. chen"], "Pub Date": "2023-01-09", "Abstract": "dual energy computed tomography  dect  can simultaneously provide the anatomical structure and material specific information of the scanned object having many applications in industry and medicine. different from conventional ct dect acquires two attenuation measurements of the same object at two different x ray spectra resulting in apparent redundant information. this article exploits this kind of redundancy to develop the self prior information enhanced deep iterative reconstruction  spie dir  algorithm for limited angle dect. unlike the routine practice in model based deep learning  dl  algorithms the spie dir method simultaneously performs constraints in the projection residual and image domains corresponding to three modules  projection inpainting residual correction and image refinement. during this stage the prior image and prior projection derived from two complementary limited angle scans are used to improve the algorithm performance. besides to avoid the blurring effect caused by minimizing the euclidean distance the wasserstein generative adversarial network with gradient penalty is adopted to enhance the visual perception of the generated results. experiments on the simulated data and real rat data have demonstrated that the proposed spie dir algorithm has the potential to obtain high quality dect images from two limited angle scans. furthermore visual and quantitative assessments have shown the promising performance of spie dir in artifact removal structural fidelity ct number preservation and visual perception enhancement.", "Doi": "10.1109/TIM.2022.3227549", "Key Words": ["deep iterative reconstruction", "dual-energy computed tomography", "generative adversarial network", "limited-angle", "self-prior information"]}