{"Title": "Split Federated Learning for 6G Enabled-Networks: Requirements, Challenges, and Future Directions", "Doi": "10.1109/ACCESS.2024.3351600", "Authors": ["h. hafi", "b. brik", "p. a. frangoudis", "a. ksentini", "m. bagaa"], "Key Words": ["6g networks", "wireless communication", "federated deep learning", "split deep learning", "split federated learning"], "Abstract": "sixth generation  6g  networks anticipate intelligently supporting a wide range of smart services and innovative applications. such a context urges a heavy usage of machine learning  ml  techniques particularly deep learning  dl  to foster innovation and ease the deployment of intelligent network functions operations which are able to fulfill the various requirements of the envisioned 6g services. the revolution of 6g networks is driven by massive data availability moving from centralized and big data towards small and distributed data. this trend has motivated the adoption of distributed and collaborative ml dl techniques. specifically collaborative ml dl consists of deploying a set of distributed agents that collaboratively train learning models without sharing their data thus improving data privacy and reducing the time communication overhead. this work provides a comprehensive study on how collaborative learning can be effectively deployed over 6g wireless networks. in particular our study focuses on split federated learning  sfl  a technique that recently emerged promising better performance compared with existing collaborative learning approaches. we first provide an overview of three emerging collaborative learning paradigms including federated learning split learning and split federated learning as well as of 6g networks along with their main vision and timeline of key developments. we then highlight the need for split federated learning towards the upcoming 6g networks in every aspect including 6g technologies  e.g. intelligent physical layer intelligent edge computing zero touch network management intelligent resource management  and 6g use cases  e.g. smart grid 2.0 industry 5.0 connected and autonomous systems . furthermore we review existing datasets along with frameworks that can help in implementing sfl for 6g networks. we finally identify key technical challenges open issues and future research directions related to sfl enabled 6g networks.", "Pub Date": "2024-01-22"}