{"Title": "SQ-CARS: A Scalable Quantum Control and Readout System", "Authors": ["u. singhal", "s. kalipatnapu", "p. k. gautam", "s. majumder", "v. v. l. pabbisetty", "s. jandhyala", "v. singh", "c. s. thakur"], "Pub Date": "2023-08-31", "Abstract": "qubits are the basic building blocks of a quantum processor which require electromagnetic pulses in gigahertz  ghz  frequency range and latency in nanoseconds for control and readout. in this article we address three main challenges associated with room temperature electronics used for controlling and measuring superconducting qubits  scalability direct microwave synthesis and a unified user interface. to tackle these challenges we have developed scalable quantum control and readout system  sq cars  a system based on the zcu111 evaluation kit. sq cars is designed to be scalable configurable and phase synchronized providing multiqubit control and readout capabilities. the system offers an interactive python framework making it user friendly. scalability to a larger number of qubits is achieved by deterministic synchronization of multiple channels. the system supports direct synthesis of arbitrary vector microwave pulses using the second nyquist zone technique from 4 to 9 ghz. it also features onboard data processing such as tunable low pass filters and configurable rotation blocks enabling lock in detection and low latency active feedback for quantum experiments. all control and readout features are accessible through an onboard python framework. to validate the performance of sq cars we conducted various time domain measurements to characterize a superconducting transmon qubit. our results were compared against traditional setups commonly used in similar experiments. with deterministic synchronization of control and readout channels and an open source approach for programming sq cars paves the way for advanced experiments with superconducting qubits.", "Doi": "10.1109/TIM.2023.3305656", "Key Words": ["control electronics", "field-programmable gate array (fpga)", "quantum computing", "radio frequency system-on-chip (rfsoc)", "superconducting qubit"]}