{"Title": "Stable Service Caching in MECs of Hierarchical Service Markets With Uncertain Request Rates", "Doi": "10.1109/TMC.2022.3149870", "Authors": ["z. xu", "q. xia", "l. wang", "p. zhou", "j. c. s. lui", "w. liang", "w. xu", "g. wu"], "Key Words": ["mobile edge computing", "service caching", "stackelberg congestion game", "approximation algorithms", "price of anarchy"], "Abstract": "multi access edge computing  mec  enables extreme low latency artificial intelliegence services such as augmented reality  ar  and virtual reality  vr  by deploying cloudlets in locations close to users. meanwhile a 5g hierarchical service market is emerging with both large scale and small scale network service providers competing for both computing and network bandwidth resources of an infrastructure provider. in this paper we investigate the problem of caching services originally deployed in remote clouds to cloudlets in an mec network in a hierarchical service market. for the service caching problem we first propose a novel approximation restricted framework that guarantees the stability of the 5g service market. under the proposed framework we first propose an approximation algorithm with a provable approximation ratio for the problem with non selfish network service providers. we then design an efficient stackelberg congestion game with selfish network service providers and analyze the price of anarchy  poa  of the proposed stackelberg congestion game to measure the efficiency loss of the game due to selfishness of network service providers. considering that the request rate of each service may not be given in advance we study the service caching problem with the uncertainlity of request rates and propose an approximation algorithm and a stackelberg game via leveraging the randomized rounding technique. we finally evaluate the performance of the proposed algorithms and mechanisms by both simulations and implementations in a real test bed. results show that the performance of our proposed mechanisms achieve around 9.2% less cost than those of existing approaches.", "Pub Date": "2023-06-05"}