{"Title": "STAR-RIS-Aided Mobile Edge Computing: Computation Rate Maximization With Binary Amplitude Coefficients", "Doi": "10.1109/TCOMM.2023.3274137", "Authors": ["z. liu", "z. li", "m. wen", "y. gong", "y. -c. wu"], "Key Words": ["binary optimization problem", "computation rate", "mobile edge computing (mec)", "simultaneously transmitting and reflecting reconfigurable intelligent surface (star-ris)", "smoothing-based method"], "Abstract": "in this paper simultaneously transmitting and reflecting  star  reconfigurable intelligent surface  ris  is investigated in the multi user mobile edge computing  mec  system to improve the computation rate. compared with traditional ris aided mec star ris extends the service coverage from half space to full space and provides new flexibility for improving the computation rate for end users. however the star ris aided mec system design is a challenging problem due to the non smooth and non convex binary amplitude coefficients with coupled phase shifters. to fill this gap this paper formulates a computation rate maximization problem via the joint design of the star ris phase shifts reflection and transmission amplitude coefficients the receive beamforming vectors and energy partition strategies for local computing and offloading. to tackle the discontinuity caused by binary variables we propose an efficient smoothing based method to decrease convergence error in contrast to the conventional penalty based method which brings many undesired stationary points and local optima. furthermore a fast iterative algorithm is proposed to obtain a stationary point for the joint optimization problem with each subproblem solved by a low complexity algorithm making the proposed design scalable to a massive number of users and star ris elements. simulation results validate the strength of the proposed smoothing based method and show that the proposed fast iterative algorithm achieves a higher computation rate than the conventional method while saving the computation time by at least an order of magnitude. moreover the resultant star ris aided mec system significantly improves the computation rate compared to other baseline schemes with conventional reflect only transmit only ris.", "Pub Date": "2023-07-14"}