{"Title": "State-Based Dynamic Graph with Breadth First Progression For Autonomous Robots", "Doi": "10.1109/CCWC60891.2024.10427646", "Authors": ["t. chugh", "k. tyagi", "p. srinivasan", "j. challagundla"], "Key Words": ["large language models", "agent-based approach", "autonomous operations", "graph framework", "mixture of experts"], "Abstract": "this paper introduces a novel method for enhancing robotic systems using large language models  llms . we focus on leveraging llms to substantially improve robots‚äô decision making and interaction with their environment. our proposed framework employs an agent based approach where robots utilize llms for sophisticated pattern recognition environmental understanding and autonomous decision making. the main innovation of this research is the integration of llms into a robotic system enabling robots to process large volumes of unstructured data recognize complex patterns and make informed decisions with increased precision and efficiency. this integration marks a significant leap in robotic cognitive abilities surpassing the constraints of traditional programming. our methodology transforms llms into dynamic elements within robotic systems fostering enhanced and responsive interactions with the environment. robots equipped with llms are thus capable of advanced autonomous operations including navigating complex environments solving intricate problems and interacting more naturally with humans. the primary contribution of this work is the creation of an agent based graph framework designed to facilitate collaborative problem solving in robotic systems. this framework consists of multiple agents working collaboratively spanning from data ingestion to comprehensive world understanding and decision making. these agents include modules responsible for various operational aspects such as environmental analysis data processing and specialized llms for data interpretation and summarization. positioning llms as proactive inquisitive agents our approach enables them to actively seek information and efficiently collaborate with other agents to complete tasks. the dynamic nature of this graph search and inter agent communication model is a considerable innovation in robotics offering a more integrated and effective approach for robots to tackle complex tasks thereby enhancing their ability to operate autonomously and intelligently in diverse environments.", "Pub Date": "2024-02-13"}