{"Title": "Stereo Attention Cross-Decoupling Fusion-Guided Federated Neural Learning for Hyperspectral Image Classification", "Doi": "10.1109/TGRS.2023.3320044", "Authors": ["w. cai", "m. gao", "y. ding", "x. ning", "x. bai", "p. qian"], "Key Words": ["edge computing", "feature fusion", "federated learning", "hyperspectral image classification", "neural networks"], "Abstract": "federated learning is a promising solution in several industries for cotraining models among distributed clients via centralized servers without leaving private user data on the devices. thus federated learning can be seen as a stimulus for the edge computing paradigm as it supports collaborative learning and model optimization. in view of the strict requirements for data security and system reliability of hyperspectral classification techniques for surveillance aerospace and military missions this article proposes a novel stereo attention cross decoupling fusion  cdf  guided federated neural learning algorithm for hyperspectral image classification which first trains client devices using a scalable federated learning approach consisting of master server secure aggregator and edge client devices of a certain size. the distributed devices train local models of the neural network for classifying hyperspectral images and send them to the secure aggregator which aggregates the local models using a weighted averaging strategy and sends them to the master server for iteration. in addition the stereo attention cdf module is used to mine the multidimensional spatial details of the hyperspectral images specifically by first extracting the most discriminative features from different directions  horizontal vertical and spatial  using the attention mechanism and then using the decoupling fusion strategy to classify the original feature map into three levels  significant minor and redundant and use them to model the multidimensional spatial relationships thus strengthening the capability to represent features. extensive experiments on several public datasets have shown that the proposed method provides competitive performance and more importantly is effective in enhancing privacy and reliability for hyperspectral image classification.", "Pub Date": "2023-10-20"}