{"Title": "Stochastic Resource Optimization for Wireless Powered Hybrid Coded Edge Computing Networks", "Doi": "10.1109/TMC.2023.3246994", "Authors": ["w. c. ng", "w. y. b. lim", "z. xiong", "d. niyato", "h. v. poor", "x. s. shen", "c. miao"], "Key Words": ["edge computing", "resource management", "network economics", "multi-tier computing", "stochastic integer programming"], "Abstract": "to enable ubiquitous artificial intelligence  ai  in the next generation wireless communications networks computation intensive tasks such as data processing and model training have to be performed by energy constrained end users. in this paper we present a hybrid coded edge computing network whereby users can choose to complete their computation task through  i  local computation with the wireless power transfer derived from base stations ii  coded edge offloading or iii  hybrid computation involving edge offloading and local computation. to minimize the overall network cost we propose a stochastic resource optimization approach. given the stochastic nature of wireless charging efficiency and edge servers computation capacities which can only be observed ex post a computation strategy for each user is determined using the two stage stochastic integer programming  sip . to address the complexity of the sip problem which scales with the size of the network we introduce the efficient computation methods of benders‚äô decomposition and sample average approximation. besides we present a special case of $z$z stage stochastic offloading optimization that is applicable when the corrective edge offloading action can be executed in multiple stages e.g. for non time sensitive tasks that do not need to be completed by stage two. finally we provide extensive sensitivity analyses to evaluate the performance of the proposed cost minimization approach amid varying network parameters. we demonstrate that our approach outperforms deterministic optimization approaches for in network cost minimization.", "Pub Date": "2024-02-05"}