{"Title": "Study of Œ≥-Photon High-Resolution Fast 3-D Image Reconstruction Algorithm Based on Lossless Equivalent System Matrix", "Authors": ["m. wang", "m. zhao", "m. yao", "r. guo"], "Pub Date": "2023-09-08", "Abstract": "in  $\\gamma $  photon industrial large space high resolution full 3 d nondestructive testing imaging when there is a large increase in the number of detection crystals the number of response lines the number of computational tasks and the storage space of the system matrix all increase dramatically  therefore reducing computation time and storage space becomes challenging. in this study we propose a  $\\gamma $  photon high resolution fast 3 d image reconstruction method based on a lossless equivalent system matrix  lesm  which divides the cylindrical effective field of view into multiple equivalent sector blocks performs polar voxel discretization according to adaptive rules and accurately calculates the system matrix corresponding to one equivalent sector block by a polar voxel stereo angle model. furthermore the system matrix elements corresponding to the remaining sector blocks are obtained by rotational symmetry. meanwhile the system matrix elements corresponding to the polar voxels in the equivalent sector block are divided into subsets according to radial and mirror symmetry to further reduce the number of system matrix elements that need to be computed so as to realize the lossless compression and fast recovery of the 3 d system matrix. to improve the accuracy of the system matrix and effectively suppress noise the error caused by the depth of interaction  doi  is further reduced based on the lesm calculation and the display of the image is completed by precomputing the mapping matrix  ${t}$ . parallel computing is used to accelerate the algorithm. simulation and experimental results show that compared with the traditional cartesian voxel method the proposed method significantly reduces the computational tasks and storage space of the system matrix elements and improves the contrast and spatial resolution of industrial 3 d reconstructed images thus meeting the demand of  $\\gamma $  photon industrial large space detection imaging.", "Doi": "10.1109/TIM.2023.3309362", "Key Words": ["œ≥-photon imaging", "industrial nondestructive testing", "large-space detector", "system matrix compression"]}