{"Title": "Superconducting-Oscillatory Neural Network With Pixel Error Detection for Image Recognition", "Authors": ["r. cheng", "c. kirst", "d. vasudevan"], "Pub Date": "2023-05-05", "Abstract": "brain inspired oscillatory neural networks  onns  utilize coupled oscillators to emulate biological neuronal dynamics. onns are naturally suitable for image pattern recognition. many hardware implementations of onns have been explored recently by using analog or digital cmos systems which can be limited by moore law. in this work we used one of the advanced superconducting technologies for coupled oscillator networks to further improve the energy efficiency and processing speed. inductively coupled ring oscillators using rapid single flux quantum  rsfq  technology were designed and simulated. these josephson junction  jj  based oscillators can operate as fast as tens of ghz but only consume a energy of several aj per operation. excluding cryo cooling factors the estimated power consumption of our rsfq oscillator is hundreds of nw at a frequency of 12.5 ghz which is multiple times smaller than a typical cmos ring oscillator. furthermore a system for pattern recognition with error detection was designed based on these oscillators. synchronization dynamics in a pair of coupled oscillators were used to identify whether a test pixel matches a reference pixel. a network comprised of 16 pairs of oscillators were wired together along with synchronization detectors and a fluxon integrator to demonstrate pattern recognition function. this work was performed using standard jj models and demonstrated through wrspice and josim software simulations. the circuits and systems proposed in this work aim to provide insights into the use of superconducting technology for implementing onns and may serve as basic building blocks for the design of more complex oscillatory computational networks in image processing and beyond. single oscillator modeling and systematic network function exploration will be performed in future work.", "Doi": "10.1109/TASC.2023.3251945", "Key Words": ["image recognition", "neuromorphic computing", "oscillatory neural networks", "rsfq"]}