{"Title": "Superconducting Qubit Network as a Single Microwave Photon Detector for Galactic Axion Search", "Authors": ["e. enrico", "c. bonavolont√†", "g. brida", "g. coda", "e. il'ichev", "l. fasolo", "m. fistoul", "a. meda", "l. oberto", "g. oelsner", "m. rajteri", "b. ruggiero", "p. silvestrini", "m. valentino", "p. vanacore", "m. lisitskiy"], "Pub Date": "2024-01-24", "Abstract": "experimental search of galactic axions requires detection of single photons in the microwave range. we work on a novel approach to detect single microwave photons based on a coherent collective response of quantum states occurring in a superconducting qubit network  sqn  embedded in a low dissipative superconducting resonator. we propose a two resonators detector configuration with two parallel resonators without common part and with separated input and output terminals. the device consists of a low dissipative resonator with embedded sqn in which microwave photons arrive  ‚äúsignal resonator‚äù  and a transmission line for measuring the frequency dependent transmission coefficient demonstrating resonant drops at the qubit frequencies  ‚äúreadout resonator‚äù . in comparison with t type three terminal device recently proposed and investigated by us the device with two resonators with separated input and output terminals doesn't contain common part of both resonators and exclude an unwanted noise from measurement readout circuits to the signal resonator. a layout of two resonators four terminal sqn detectors containing 5 flux qubits weakly coupled to a low dissipative signal and readout resonator was developed and optimized. the samples were fabricated by manhattan al based technology with nb resonator circuits. the sqn detector was experimentally tested in terms of microwave measurements of scattering parameters of both resonators and crosstalk properties. comparison of experimental data with results of the simulations permits one to conclude that the electromagnetic conditions of the fundamental resonant peak of 8.5 ghz of both resonators aren't affected by the crosstalk phenomenon and their performances provided by the design remain not altered for correct device operation.", "Doi": "10.1109/TASC.2023.3340640", "Key Words": ["superconducting microwave devices", "josephson devices", "superconducting resonators", "superconducting detectors", "microwave detectors", "superconducting qubit"]}