{"Title": "System Based on Artificial Intelligence Edge Computing for Detecting Bedside Falls and Sleep Posture", "Doi": "10.1109/JBHI.2023.3271463", "Authors": ["b. -s. lin", "c. -w. peng", "i. -j. lee", "h. -k. hsu", "b. -s. lin"], "Key Words": ["bedside fall", "deep learning", "edge computing", "neuromorphic computing hardware", "sleep posture recognition"], "Abstract": "bedside falls and pressure ulcers are crucial issues in geriatric care. although many bedside monitoring systems have been proposed they are limited by the computational complexity of their algorithms. moreover most of the data collected by the sensors of these systems must be transmitted to a back end server for calculation. with an increase in the demand for the internet of things problems such as higher cost of bandwidth and overload of server computing are faced when using the aforementioned systems. to reduce the server workload certain computing tasks must be offloaded from cloud servers to edge computing platforms. in this study a bedside monitoring system based on neuromorphic computing hardware was developed to detect bedside falls and sleeping posture. the artificial intelligence neural network executed on the back end server was simplified and used on an edge computing platform. an integer 8 bit precision neural network model was deployed on the edge computing platform to process the thermal image captured by the thermopile array sensing element to conduct sleep posture classification and bed position detection. the bounding box of the bed was then converted into the features for posture classification correction to correct the posture. in an experimental evaluation the accuracy rate inferencing speed and power consumption of the developed system were 94.56% 5.28 frames per second and 1.5 w respectively. all the calculations of the developed system are conducted on an edge computing platform and the developed system only transmits fall events to the back end server through wi fi and protects user privacy.", "Pub Date": "2023-06-30"}