{"Title": "TABI: Trust-Based ABAC Mechanism for Edge-IoT Using Blockchain Technology", "Doi": "10.1109/ACCESS.2023.3265349", "Authors": ["a. pathak", "i. al-anbagi", "h. j. hamilton"], "Key Words": ["attribute-based access control (abac)", "authentication", "blockchain", "edge computing", "hyperledger composer", "hyperledger fabric", "iot network", "trust evaluation mechanism"], "Abstract": "recent research has focused on applying blockchain technology to solve security related problems in internet of things  iot  networks. however implementing blockchain technology directly on iot networks is prone to high overheads and energy expensive operations. therefore in this paper we use edge computing technology to avoid these problems. we also propose a novel trust based access control mechanism for edge iot networks using blockchain technology  named tabi  to implement end to end security in resource constrained iot networks. the tabi mechanism utilizes both access control and trust evaluation mechanisms to mitigate the impact of malicious iot users and devices. additionally it incorporates permissioned hyperledger blockchain technology to provide an added layer of security through authentication. the trust evaluation mechanism is implemented as a trust calculation contract  tcc  on the edge devices using hyperledger composer. the access control mechanism employs an attribute based access control  abac  mechanism which is implemented on the hyperledger blockchain using two smart contracts  the attribute contract  ac  and the access control contract  acc . we implement a proof of concept  poc  implementation using hyperledger caliper  a benchmark testing tool  and docker images. our evaluation includes five analyses  trust evaluation mechanism access control mechanism security blockchain and iot applications. through this evaluation we highlight the effectiveness of tabi in terms of throughput latency detection of malicious iot devices and resource consumption of the iot devices. our analyses demonstrate that tabi is particularly useful in iot applications that require low latency and resource efficiency.", "Pub Date": "2023-04-17"}