{"Title": "Talent Recommendation Model of School-enterprise Cooperation Based on Big Data Technology", "Doi": "10.1109/ICBAIE59714.2023.10281276", "Authors": ["w. yang"], "Key Words": ["school-enterprise cooperation mode", "talent training", "big data", "recommendation model", "prediction and optimization algorithm"], "Abstract": "with the development of big data artificial intelligence and other technologies the research on the construction of intelligent human recommendation environment has gradually formed the characteristics of self adaptation and personalization. as for discussing the problem of low utilization rate of human resources big data the internal factor mechanism of talent big data system selection intention based on data technology matching is not clear enough. starting from the two sub dimensions of data prediction technology fit and information recommendation context fit this paper studies the willingness of human resource practitioners to choose big data human resource system. the explanation mechanism of perceived value was put forward. according to the characteristics of talent demand the clustering recommendation method is divided into prediction part and recommendation part. the recommendation part mainly solves the problems of data sparsity and cold start. the attributes of the acquired user data are extracted. the knowledge map of user demand service domain is constructed. then the knowledge map of cooperative enterprises is clustered according to the graph segmentation theory. each data cluster is imported into the random forest model for training. with the potential of network representation learning in structural feature extraction over time nodes in heterogeneous networks are transformed into low dimensional vectors through network representation learning model to solve the problem of node similarity in large scale structural networks. it will promote the cooperation between enterprises and universities and will also enhance the innovation ability of intelligent recommendation of human resources in school enterprise cooperation.", "Pub Date": "2023-10-17"}