{"Title": "TANTO: An Effective Trust-Based Unmanned Aerial Vehicle Computing System for the Internet of Things", "Doi": "10.1109/JIOT.2022.3150765", "Authors": ["j. bai", "z. zeng", "t. wang", "s. zhang", "n. n. xiong", "a. liu"], "Key Words": ["aerial computing", "internet of things (iot)", "task offloading", "trust computing", "unmanned aerial vehicles (uavs)"], "Abstract": "large number of internet of things  iot  devices deployed on demand to monitor surroundings and offload computation intensive tasks to edge servers which favors low latency iot applications. however some of them scatter in areas with limited or no available communication infrastructure  no aci  which rises a huge challenge for task offloading due to when and which devices have tasks cannot be known in advance. in this article a trust based active notice task offloading  tanto  scheme in the aerial computing system  acs  assisted by the unmanned aerial vehicle  uav  is proposed to provide trust and low delay task offloading for resource limited iot devices in areas with no aci. the main innovations of tanto in acs are as follow  1  a novel task offloading mechanism for iot devices in networks with no aci is proposed where devices broadcast task offloading notice making it easy for uav to know where tasks need to offload without aimless search which can effectively reduce uav‚äôs flight distance and task completion delay at the same time  2  a trust calculation and reasoning method is proposed to calculate network trust and divide the network into grids with different trust values which guides uav through grids with higher trust to increase the task completion rate and reduce delay  and 3  an online uav trajectory optimization algorithm is proposed to dynamically prioritize tasks with urgent deadline. a large number of experimental results show that tanto has better performance than previous studies in terms of task completion rate tasks‚äô average completion time and uav‚äôs flight cost.", "Pub Date": "2023-03-23"}