{"Title": "Task Offloading Optimization in NOMA-Enabled Dual-Hop Mobile Edge Computing System Using Conflict Graph", "Doi": "10.1109/TWC.2022.3198092", "Authors": ["m. s. al-abiad", "m. z. hassan", "m. j. hossain"], "Key Words": ["conflict graphs", "computation offloading", "noma", "resource allocation", "admission control", "user clustering"], "Abstract": "resource allocation is investigated for offloading computational intensive tasks in dual hop mobile edge computing  mec  system. the envisioned system has both the cooperative access points  aps  with the computing capability and the mec servers. a user device  ud  therefore first uploads a computing task to the nearest ap and the ap can either locally process the received task or offload to mec server. to utilize the radio resource blocks  rrbs  in the aps efficiently we exploit the non orthogonal multiple access  noma  for offloading the tasks from the uds to the ap s . in order to investigate the trade off between latency and energy consumption this work considers minimizing a weighted sum that consists of latency and energy consumption subject to uds‚äô rate threshold tasks‚äô time delay computational frequency scaling and transmit power allocation constraints. with a joint consideration of all such factors the problem is np hard and its global optimal solution is computationally intractable. a graph theoretical approach is employed to solve the problem efficiently. specifically a novel joint mec graph based approach is devised which solves the scheduling among the uds aps and rrbs the transmit power control and the local computational frequency scaling problem s  jointly. the joint mec approach achieves near optimal performance with high computational complexity. to strike a suitable balance between the performance and computational complexity of the resource allocation a low complexity yet efficient pruning graph approach is also devised. the efficiency of the proposed graph based approaches over several benchmark schemes is verified via extensive simulations.", "Pub Date": "2023-02-10"}