{"Title": "Task Computation Offloading for Multi-Access Edge Computing via Attention Communication Deep Reinforcement Learning", "Doi": "10.1109/TSC.2022.3225473", "Authors": ["k. li", "x. wang", "q. he", "m. yang", "m. huang", "s. dustdar"], "Key Words": ["multi-access edge computing", "reinforcement learning", "task computation offloading", "user cooperation"], "Abstract": "this article investigates how to enhance the multi access edge computing  mec  systems performance with the aid of device to device  d2d  communication computation offloading. by adequately exploiting a novel computation offloading mechanism based on d2d collaboration users can efficiently share computational resources with each other. however it is challenging to distinguish valuable information that truly promotes a collaborative decision as worthless information can hinder collaboration among users. in addition the transmission of large volumes of information requires high bandwidth and incurs significant latency and computational complexity resulting in unacceptable costs. in this article we propose an efficient d2d assisted mec computation offloading framework based on attention communication deep reinforcement learning  acdrl  which simulates the interactions between related entities including device to device collaboration in the horizontal and device to edge offloading in the vertical. second we developed a distributed cooperative reinforcement learning algorithm that includes an attention mechanism that skews computational resources towards active users to avoid unnecessary resource wastage in large scale mec systems. finally to improve the effectiveness and rationality of cooperation among users we introduce a communication channel to integrate information from all users in a communication group thus facilitating cooperative decision making. the proposed framework is benchmarked and the experimental results show that the proposed framework can effectively reduce latency and provide valuable insights for practical design compared to other baseline approaches.", "Pub Date": "2023-08-08"}