{"Title": "Task Scheduling Mechanisms for Fog Computing: A Systematic Survey", "Doi": "10.1109/ACCESS.2023.3277826", "Authors": ["m. hosseinzadeh", "e. azhir", "j. lansky", "s. mildeova", "o. h. ahmed", "m. h. malik", "f. khan"], "Key Words": ["fog computing", "cloud computing", "task scheduling", "methods", "quality of service"], "Abstract": "in the internet of things  iot  ecosystem some processing is done near data production sites at higher speeds without the need for high bandwidth by combining fog computing  fc  and cloud computing. fog computing offers advantages for real time systems that require high speed internet connectivity. due to the limited resources of fog nodes one of the most important challenges of fc is to meet dynamic needs in real time. therefore one of the issues in the fog environment is the optimal assignment of tasks to fog nodes. an efficient scheduling algorithm should reduce various qualitative parameters such as cost and energy consumption taking into account the heterogeneity of fog nodes and the commitment to perform tasks within their deadlines. this study provides a detailed taxonomy to gain a better understanding of the research issues and distinguishes important challenges in existing work. therefore a systematic overview of existing task scheduling techniques for cloud fog environment as well as their benefits and drawbacks is presented in this article. four main categories are introduced to study these techniques including machine learning based heuristic based metaheuristic based and deterministic mechanisms. a number of papers are studied in each category. this survey also compares different task scheduling techniques in terms of execution time resource utilization delay network bandwidth energy consumption execution deadline response time cost uncertainty and complexity. the outcomes revealed that 38% of the scheduling algorithms use metaheuristic based mechanisms 30% use heuristic based 23% use machine learning algorithms and the other 9% use deterministic methods. the energy consumption is the most significant parameter addressed in most articles with a share of 19%. finally a number of important areas for improving the task scheduling methods in the fc in the future are presented.", "Pub Date": "2023-06-05"}