{"Title": "TDPP: 2-D Permutation-Based Protection of Memristive Deep Neural Networks", "Authors": ["m. zou", "z. zhu", "t. greenberg-toledo", "o. leitersdorf", "j. li", "j. zhou", "y. wang", "n. du", "s. kvatinsky"], "Pub Date": "2024-02-20", "Abstract": "the execution of deep neural network  dnn  algorithms suffers from significant bottlenecks due to the separation of the processing and memory units in traditional computer systems. emerging memristive computing systems introduce an in situ approach that overcomes this bottleneck. the nonvolatility of memristive devices however may expose the dnn weights stored in memristive crossbars to potential theft attacks. therefore this article proposes a 2 d permutation based protection  tdpp  method that thwarts such attacks. we first introduce the underlying concept that motivates the tdpp method  permuting both the rows and columns of the dnn weight matrices. this contrasts with previous methods which focused solely on permuting a single dimension of the weight matrices either the rows or columns. while it is possible for an adversary to access the matrix values the original arrangement of rows and columns in the matrices remains concealed. as a result the extracted dnn model from the accessed matrix values would fail to operate correctly. we consider two different memristive computing systems  designed for layer by layer and layer parallel processing respectively  and demonstrate the design of the tdpp method that could be embedded into the two systems. finally we present a security analysis. our experiments demonstrate that tdpp can achieve comparable effectiveness to prior approaches with a high level of security when appropriately parameterized. in addition tdpp is more scalable than previous methods and results in reduced area and power overheads. the area and power are reduced by respectively  $1218\\times $  and  $2815\\times $  for the layer by layer system and by  $178\\times $  and  $203\\times $  for the layer parallel system compared to prior works.", "Doi": "10.1109/TCAD.2023.3322351", "Key Words": ["deep neural network (dnn)", "memristor", "permutation-based protection", "security"]}