{"Title": "TEE-PA: TEE Is a Cornerstone for Remote Provenance Auditing on Edge Devices With Semi-TCB", "Doi": "10.1109/ACCESS.2024.3366344", "Authors": ["t. takemura", "r. yamamoto", "k. suzaki"], "Key Words": ["trusted execution environment (tee)", "provenance auditing", "system call logging", "trusted computing base (tcb)", "autonomous recovery"], "Abstract": "artificial intelliegence&iot edge devices run complex applications and are under the threat of stealthy attacks that are not easily detected by traditional security systems. provenance auditing is a promising technique for determining the ramification of an attack from event logs. however the original provenance auditing was designed for personal computers and is unsuitable for edge devices. therefore introducing provenance auditing on edge devices raises the following three problems.  1  current edge devices have relatively powerful cpus but are not enough for provenance auditing.  2  most provenance auditing tools are developed as normal applications and the log data is exposed to an untrusted area.  3  most edge devices are used outdoors without an administrator and must be managed by secure m2m  machine to machine . to solve these problems we propose tee pa to securely collect system call logs on an edge device using tee  trusted execution environment  and send them to a remote provenance auditing on a powerful server. the system call logs are directly transferred from the kernel to the tee and are not exposed to administrators as well as attackers. although the kernel runs in an untrusted world and has a semantic gap from the tee tee pa offers a semi tcb  trusted computing base  that measures the kernel integrity check mechanism from the tee at boot time and partially trusts the kernel. operational correctness is periodically confirmed by unpredictable heartbeat messages sent from the remote provenance auditing server. if the correctness is not confirmed in the logs on the server heartbeat message is not sent triggering an autonomous recovery with a system reset of the watchdog timer protected by the tee. we implemented a prototype of tee pa on the arm trustzone of raspberry pi3 with spade and lkrg  linux kernel runtime guard  as remote provenance auditing and kernel integrity check. we demonstrate that tee pa can determine the ramifications of stealthy attacks  fileless malware and shell command attacks  with acceptable performance. the performance evaluation estimates that tee pa is 19 times faster than on board provenance auditing.", "Pub Date": "2024-02-23"}