{"Title": "Text2Reaction : Enabling Reactive Task Planning Using Large Language Models", "Doi": "10.1109/LRA.2024.3371223", "Authors": ["z. yang", "l. ning", "h. wang", "t. jiang", "s. zhang", "s. cui", "h. jiang", "c. li", "s. wang", "z. wang"], "Key Words": ["planning under uncertainty", "ai-based methods", "learning from demonstration"], "Abstract": "to complete tasks in dynamic environments robots need to timely update their plans to react to environment changes. traditional stripe like or learning based planners struggle to achieve this due to their high reliance on meticulously predefined planning rules or labeled data. fortunately recent works find that large language models  large language model  can be effectively prompted to solve planning problems. thus we investigate the strategies for large language model to master reactive planning problems without complex definitions and extra training. we propose text2reaction an large language model based framework enabling robots to continuously reason and update plans according to the latest environment changes. inspired from human step by step re planning process we present the re planning prompt which informs large language model the basic principles of re planning and fosters the gradual development of a current plan to a new one in a three hop reasoning manner‚äìcause analysis consequence inference and plan adjustment. in addition text2reaction is designed to first generate an initial plan based on the task description before execution allowing for subsequent iterative updates of this plan. we demonstrate the superior performance of text2reaction over prior works in reacting to various environment changes and completing varied tasks. in addition we validate the reliability of our re planning prompt through ablation experiments and its capability when deployed in real world robots enabling continuous reasoning in the face of diverse changes until the user instructions are successfully completed.", "Pub Date": "2024-03-18"}