{"Title": "The Silicon-Based XOI Wafer: The Most General Electronics-Photonics Platform for Computing, Sensing, and Communications", "Authors": ["r. soref", "b. j. shastri", "a. n. tait"], "Pub Date": "2022-10-25", "Abstract": "this paper proposes that the 300 mm diameter silicon wafer coated with a thin insulator layer which becomes a buried layer is the most general and most capable platform for high volume foundry manufactured waveguided photonic integrated circuits  pics  and for the on wafer electronics that control and signal process the photonics. we call this ‚äúon insulator‚äù platform an electronic  photonic  or optoelectronic  integrated circuit wafer. for a few potential applications like ‚äúgeneral intelligence‚äù  shainline et al. 2021  entire wafers would be deployed. however in almost every case the wafer will be diced into hundreds of electronic photonic chips  chips are the real aim of wafer creation . those chips would be commercial products or custom made application specific pics. the goal of this paper is to present a detailed vision of the ultimate electronic  photonic wafers that   1  serve a vast range of applications  2  operate at any wavelength within the ultraviolet visible near infrared and middle infrared  3  provide low loss well confined optical waveguiding across the wafer  4  utilize an optimized or application specific combination of photonic materials including semiconductors insulators ferroelectrics poled polymers  xu et al. 2022  phase change materials  pcms   wuttig et al. 2017  plasmonics  moor et al. 2021   amin et al. 2021  and 2d materials such as graphene  liu et al. 2020   5  offer one or more practical electro optical modulation and switching mechanisms that are discussed below  6  offer on wafer laser diodes wavelength multiplexed comb sources leds optical amplifiers and photodetectors  7  provide a full range of cmos or ‚äúother‚äù control electronics as well as electronic memories and data converters  analog to digital and digital to analog  and  8  are manufacturable in volume by proven techniques such as wafer bonding smart cut and hetero epitaxy‚äì or are made by emerging methods. the insulator mentioned above could be silicon dioxide  sio2  or alumina  al2o3  or silicon nitride  si3n4 or sin . sio2 is generally preferred but the al2o3 and the sin offer better mid  infrared transparency than the oxide.", "Doi": "10.1109/JSTQE.2022.3211310", "Key Words": ["group-iv photonics", "heterogeneous integration", "optical computing", "optoelectronic integration", "quantum photonics", "silicon-on-insulator", "wafer-scale integration"]}