{"Title": "The Use and Misuse of Pre-Trained Generative Large Language Models in Reliability Engineering", "Doi": "10.1109/RAMS51492.2024.10457630", "Authors": ["y. hu", "y. goktas", "d. d. yellamati", "c. de tassigny"], "Key Words": ["large language model", "machine learning", "reliability", "fmea"], "Abstract": "generative large language models  llms  have garnered significant attention since the release of chatgpt in november 2022. researchers are actively exploring diverse applications to leverage the capabilities of these llm systems. within the field of reliability engineering there exists a potential for fruitful utilization of such models. in this paper we delve into the applications of large language models in reliability engineering specifically focusing on their impressive language processing capabilities beyond traditional natural language processing  nlp  tasks. our study aims to evaluate the llms' potential in answering complex engineering questions and offering solutions to intricate problems. additionally we investigate the limitations of llms to understand their boundaries in providing accurate and reliable outputs. the paper emphasizes the significance of prompt engineering to enhance the accuracy and reliability of llms for improved performance in quantitative tasks. by incorporating minor prompt engineering techniques the large language models  llms  especially gpt 4 exhibited promising performance in answering certified reliability engineer  cre  exam questions. our study involves an analysis of the errors made by the llms allowing for a understanding of their limitations. drawing from our findings we provide recommendations on the appropriate application and areas to exercise caution when employing llms in the field of reliability engineering. these insights aim to guide practitioners in maximizing the benefits of llms while being mindful of their limitations and potential pitfalls. it is important to note that generative ai and llms are rapidly evolving and the evaluation conducted in this study reflects the test results at the time of writing. we anticipate that llm responses may vary in the future. we are currently conducting research on developing applications based on llms to support the daily tasks of reliability engineers. we are excited about the possibilities and look forward to sharing our outcomes and contributing to the community.", "Pub Date": "2024-03-18"}