{"Title": "The MPU RX-4 Project: Design, Electronics, and Software Development of a Geofence Protection System for a Fixed-Wing VTOL UAV", "Authors": ["k. a. tsintotas", "l. bampis", "a. taitzoglou", "i. kansizoglou", "p. kaparos", "c. bliamis", "k. yakinthos", "a. gasteratos"], "Pub Date": "2023-01-09", "Abstract": "unmanned aerial vehicles  uavs  are at the forefront of this century‚äôs technological shift becoming ubiquitous in research and market areas. however as a uav navigates autonomously there are unanticipated occasions e.g. collisions with dynamic obstacles or loss of data provided by the global navigation satellite system  gnss  where the aircraft has to change its mission plans. in particular to be protected from possible accidents the platform‚äôs geofence protection system should adjust the trajectory appropriately when obstacles are detected and select the proper ground surface when emergency landing is prompted. as these processes require fast reaction times utilizing low latency sensors and algorithms is necessary. this article proposes a complete and low complexity geofence protection system for recognizing moving objects and assessing the ground surface‚äôs suitability using onboard sensing and processing modules. the proposed system is implemented on a novel fixed wing uav designated as mpu rx 4 which features an unconventional flying wing layout and vertical take off and landing  vtol  capabilities. our system is based on a forward facing laser imaging detection and ranging  lidar  sensor and three downward facing laser rangefinders. we take advantage of the high precision distance measurements and operational speed to identify moving obstacles using the lidar module while the ground‚äôs slope and the existence of any obstacle therein are computed through the rangefinders. first the article describes the uav design procedure and its aerodynamic performance characteristics which allowed us to evaluate our approach on a testbed aircraft. then the evaluation protocol shows that our system can perform robustly and under real time constraints reaching an overall latency of only 165.5 ms sufficient for reliable detection and avoidance of moving obstacles.", "Doi": "10.1109/TIM.2022.3225020", "Key Words": ["geofence protection system", "unmanned aerial vehicle (uav)", "vertical take-off and landing (vtol)", "visual-based navigation"]}