{"Title": "The Security and Privacy of Mobile-Edge Computing: An Artificial Intelligence Perspective", "Doi": "10.1109/JIOT.2023.3304318", "Authors": ["c. wang", "z. yuan", "p. zhou", "z. xu", "r. li", "d. o. wu"], "Key Words": ["artificial intelligence (ai)", "fifth generation (5g)", "internet of things (iot)", "machine learning (ml)", "mobile-edge computing (mec)", "security and privacy", "software-defined network (sdn) security", "virtual machine security"], "Abstract": "mobile edge computing  mec  is a new computing paradigm that enables cloud computing and information technology  it  services to be delivered at the network‚äôs edge. by shifting the load of cloud computing to individual local servers mec helps meet the requirements of ultralow latency localized data processing and extends the potential of the internet of things  iot  for end users. however the crosscutting nature of mec and the multidisciplinary components necessary for its deployment have presented additional security and privacy concerns. fortunately artificial intelligence  artificial intelliegence  algorithms can cope with excessively unpredictable and complex data which offers a distinct advantage in dealing with sophisticated and developing adversaries in the security industry. hence in this article we comprehensively provide a survey of security and privacy in mec from the perspective of artificial intelliegence. on the one hand we use european telecommunications standards institute  etsi  mec reference architecture as our based framework while merging the software defined network  sdn  and network function virtualization  nfv  to better illustrate a serviceable platform of mec. on the other hand we focus on new security and privacy issues as well as potential solutions from the viewpoints of artificial intelliegence. finally we comprehensively discuss the opportunities and challenges associated with applying artificial intelliegence to mec security and privacy as possible future research directions.", "Pub Date": "2023-12-11"}