{"Title": "The Role of Network Slicing and Edge Computing in the Metaverse Realization", "Doi": "10.1109/ACCESS.2023.3255510", "Authors": ["s. karunarathna", "s. wijethilaka", "p. ranaweera", "k. t. hemachandra", "t. samarasinghe", "m. liyanage"], "Key Words": ["augmented reality", "multi-access edge computing", "metaverse", "network slicing", "virtual reality", "extended reality"], "Abstract": "metaverse is the latest technological hype in the modern world due to its potential for revolutionizing the digital visual perspective. with the covid-19 pandemic most industries have moved towards digitization and the metaverse is identified as one of the most promising platforms for such a transition as it provides a three dimensional  3d  immersive experience for the users. currently most digital service providers and organizations are actively working on metaverse  based applications. in addition there has been a rapid increase on research work involving metaverse realization. launching a large scale metaverse in the real world is a challenging task. however fifth generation  5g  and beyond 5g  b5g  technologies are envisioned to improve the feasibility of pragmatic deployments. although there are several conceptual designs available actual adaptations of the concepts are still limited. this survey focuses on providing a practical approach for metaverse realization using 5g and b5g technologies. specifically we discuss the importance of network slicing  ns  and multi access edge computing  mec  as emerging 5g technologies for enabling the realization of the metaverse. we first introduce the motivation behind metaverse for future envisaged technologies. next we present a holistic high level framework for metaverse realization based on network slicing and edge computing. moreover we discuss the futuristic metaverse applications their technical requirements and methods to satisfy the requirements. finally we highlight the deployment challenges and possible approaches to overcome them for an actual metaverse realization.", "Pub Date": "2023-03-17"}