{"Title": "The Application of Natural Language Processing Technology Based on Deep Learning in Japanese Sentiment Analysis", "Doi": "10.1109/AIKIIE60097.2023.10390437", "Authors": ["x. zhang"], "Key Words": ["deep learning", "natural language processing", "japanese text", "emotion analysis"], "Abstract": "in the era of artificial intelligence with the rapid development of human beings the study of natural language is also receiving increasing attention. this paper aims to explore the use of deep learning technology to detect and predict emotional tendency of artificial neural network models. firstly the text expression capability based on feature extraction and classifier construction will be introduced. secondly the word vector adaptive method used in the experimental process will be explained in detail which can achieve semantic computation and emotion mining. finally we will also propose a fusion function strategy to mark the content of the article and build a natural language processing system based on this strategy. at the same time we will test the performance of the system. the test results show that the adaptability of the system can reach 74% at the lowest and 79% at the highest which can show that the analysis technology of the system can meet the basic requirements. through these researches and explorations we will be able to better understand and demonstrate the importance of natural language processing in modern society. the application of deep learning in japanese emotion analysis has achieved some research results. by using the deep learning method we can train large scale japanese text learn the language feature representation and realize the understanding and analysis of text emotion. deep learning can improve the accuracy of japanese emotion analysis by using the technology of word embedding and language model. in addition deep learning can also be applied to other natural language processing tasks such as machine translation and question answering systems and bring better results to these tasks. in the future we can look forward to the further research and application of deep learning in the field of japanese emotion analysis.", "Pub Date": "2024-01-22"}