{"Title": "The Effect of Cryogenic Temperatures on the Lateral Heat Spreading in InGaAs/InP HEMTs", "Authors": ["g. graziano", "a. ferraris", "e. cha", "c. b. zota"], "Pub Date": "2023-07-25", "Abstract": "the recent developments in quantum computing architectures have caused an increasing interest in cryogenic low noise amplifiers  lnas  due to their role in the qubit readout chain. advanced quantum computers with many qubits will require cryogenic integration of thousands of lnas. minimizing lna power dissipation while maintaining low noise will be of key importance due to the limited available cooling power in cryostats. in addition self heating  sh  and heat dissipation of cryogenic lnas represent limiting factors in the device‚äôs performance and integration. while sh is predicted to increase in transistor channels at cryogenic temperatures large scale thermal spreading outside of active devices due to sh is not well understood. here the 2 d heat flow due to the sh of ingaas inp high electron mobility transistors  hemts  is experimentally studied. we realize a matrix of schottky diode thermal sensors close to the active device which allows us to obtain a full 2 d temperature mapping with respect to the power dissipated by the hemt. measurements are performed in the temperature range of 300‚äì4.2 k. results indicate that hemt large scale thermal spreading due to sh is suppressed at lower ambient temperatures. below 77 k the increase of surface temperature at a distance  $< 12 \\mu \\text{m}$  from the active area is less than the measurement sensitivity  0.5 k . therefore we conclude that the increased sh in the channel at cryogenic conditions does not result in increased surface heating. these results build on our understanding of the opportunities for integrated cryogenic electronics in quantum computers.", "Doi": "10.1109/TED.2023.3287813", "Key Words": ["cryogenics electronics", "high electron mobility transistor (hemt)", "quantum applications", "self-heating (sh)"]}