{"Title": "The Road to Near-Capacity CV-QKD Reconciliation: An FEC-Agnostic Design", "Authors": ["x. liu", "c. xu", "y. noori", "s. x. ng", "l. hanzo"], "Pub Date": "2024-04-17", "Abstract": "new near capacity continuous variable quantum key distribution  cv qkd  reconciliation schemes are proposed where both the authenticated classical channel  clc  and the quantum channel  quc  for qkd are protected by separate forward error correction  fec  coding schemes. more explicitly all of the syndrome based qkd reconciliation schemes found in literature rely on syndrome based codes such as low density parity check  ldpc  codes. hence at the current state of the art the channel codes that cannot use syndrome decoding such as the family of convolutional codes  ccs  and polar codes cannot be directly applied. moreover the clc used for syndrome transmission in these schemes is generally assumed to be idealistically error free where the realistic additive white gaussian noise  awgn  and rayleigh fading of the clc have not been taken into account. to circumvent this limitation a new codeword based   rather than syndrome based   qkd reconciliation scheme is proposed where alice sends an fecprotected codeword to bob through a clc while bob sends a separate fec protected codeword to alice through a quc. upon decoding the codeword received from the other side the final key is obtained by applying a simple modulo 2 operation to the local codeword and the decoded remote codeword. as a result first of all the proposed codeword based qkd reconciliation system ensures protection of both the quc and of the clc. secondly the proposed system has a similar complexity at both sides where both alice and bob have an fec encoder and an fec decoder. thirdly the proposed system makes qkd reconciliation compatible with a wide range of fec schemes including polar codes ccs and irregular convolutional codes  irccs  where a near capacity performance can be achieved for both the quc and for the clc. our simulation results demonstrate that thanks to the proposed regime the performance improvements of the quc and of the clc benefit each other hence leading to an improved secret key rate  skr  that inches closer to both the pirandola laurenza ottaviani banchi  plob  bound and to the maximum achievable rate bound.", "Doi": "10.1109/OJCOMS.2024.3382225", "Key Words": ["continuous variable quantum key distribution (cv-qkd)", "multidimensional reconciliation", "low-density parity check (ldpc) codes", "irregular convolutional codes (ircc)", "secret key rate (skr)", "near-capacity codes"]}