{"Title": "The Quantum Path Kernel: A Generalized Neural Tangent Kernel for Deep Quantum Machine Learning", "Authors": ["m. incudini", "m. grossi", "a. mandarino", "s. vallecorsa", "a. d. pierro", "d. windridge"], "Pub Date": "2023-09-15", "Abstract": "building a quantum analog of classical deep neural networks represents a fundamental challenge in quantum computing. a key issue is how to address the inherent nonlinearity of classical deep learning a problem in the quantum domain due to the fact that the composition of an arbitrary number of quantum gates consisting of a series of sequential unitary transformations is intrinsically linear. this problem has been variously approached in literature principally via the introduction of measurements between layers of unitary transformations. in this article we introduce the quantum path kernel  qpk  a formulation of quantum machine learning capable of replicating those aspects of deep machine learning typically associated with superior generalization performance in the classical domain specifically hierarchical feature learning. our approach generalizes the notion of quantum neural tangent kernel which has been used to study the dynamics of classical and quantum machine learning models. the qpk exploits the parameter trajectory i.e. the curve delineated by model parameters as they evolve during training enabling the representation of differential layerwise convergence behaviors or the formation of hierarchical parametric dependencies in terms of their manifestation in the gradient space of the predictor function. we evaluate our approach with respect to variants of the classification of gaussian xor mixtures  an artificial but emblematic problem that intrinsically requires multilevel learning in order to achieve optimal class separation.", "Doi": "10.1109/TQE.2023.3287736", "Key Words": ["machine learning", "neural tangent kernel (ntk)", "quantum kernel", "quantum machine learning", "quantum neural networks (qnns)", "support vector machine (svm)"]}