{"Title": "Time-Variant Reliability Optimization for Stress Balance in Press-Pack Insulated Gate Bipolar Transistors", "Doi": "10.1109/ACCESS.2023.3313504", "Authors": ["h. li", "t. yang", "x. liu", "j. zhong", "j. mo", "h. zhou", "z. xiao"], "Key Words": ["decoupling algorithm", "insulated gate bipolar transistor", "stress balance", "time-variant reliability optimization"], "Abstract": "stress imbalance significantly affects the performance of a press pack insulated gate bipolar transistor  igbt . time variant loads and conditions lead to the stress fluctuations exacerbating the impacts. the conventional reliability optimization faces efficiency barriers due to the nested time variant reliability analysis and design optimization. in this paper a time variant reliability optimization approach for press pack igbts is proposed to address the efficiency issue of the igbt reliability optimization. the performance functions of the maximum and typical stresses are formulated as the optimization objective and constraint. a time variant reliability optimization model is formulated considering the stress balance reliability degradation within the service cycle. a decoupling algorithm is proposed to transform the nested optimization into a sequential iteration of static reliability optimization and time variant reliability analysis. the reliability analysis utilizes the performance function continuity in the time domain to reduce the evaluations for the most likelihood points thereby enhancing efficiency. numerical and experimental results on an actual igbt demonstrate the accuracy of the stress balance performance analysis. the time variant reliability optimization based on the performance functions improves the stress balance performance by 16.3% and meets the reliability requirements within the service cycle. compared with the conventional double loop approach the difference between the solution of the proposed approach with the reference solution is 0.4% and the efficiency is 334 times that of the double loop approach. the performance advantages in accuracy and efficiency exhibit the application potential of this approach.", "Pub Date": "2023-09-14"}