{"Title": "Time-Constrained Service Handoff for Mobile Edge Computing in 5G", "Doi": "10.1109/TSC.2022.3208783", "Authors": ["n. sharghivand", "l. mashayekhy", "w. ma", "s. dustdar"], "Key Words": ["mechanism design", "mobile edge computing", "path planning", "pricing", "quality of service", "service handoff"], "Abstract": "many mobile device applications require low end to end latency to edge computing infrastructure when offloading their computation tasks in order to achieve real time perception and cognition for users. user mobility brings significant challenges in providing low latency offloading due to the limited coverage area of cloudlets. virtual machine  vm /container handoff is a promising solution to seamlessly transfer services from one cloudlet to another to maintain low latency as users move. however an inefficient path planning for the handoff can result in system congestion and consequently poor quality of service  qos . the situation can even worsen by selfish users who intentionally lie about their true parameters to achieve better service at the cost of degrading the whole system performance. to fill this research gap we propose an online service handoff mechanism  oshm  to provide an efficient path dynamically for transferring vm container from the current serving cloudlet to a nearby cloudlet at the destination of a mobile user. our proposed path planning algorithm is based on a label correction methodology leading to polynomial time complexity. oshm is accompanied by our proposed payment determination function to discourage misreporting of unknown parameters. we discuss the theoretical properties of our proposed mechanism in implementing a system equilibrium and ensuring truthfulness. we also perform a comprehensive assessment through extensive experiments which show the efficiency of oshm in terms of workload handoff time consumed energy and other metrics compared to several benchmarks. experimental results show that oshm outperforms other algorithms reducing at least 61% in average workload 33% in average handoff time and 29% in average energy consumption.", "Pub Date": "2023-06-13"}