{"Title": "TinyML Empowered Transfer Learning on the Edge", "Doi": "10.1109/OJCOMS.2024.3373177", "Authors": ["a. m. hayajneh", "m. hafeez", "s. a. r. zaidi", "d. mclernon"], "Key Words": ["tinyml", "transfer learning", "machine learning", "deep neural networks"], "Abstract": "tiny machine learning  tinyml  is a promising approach to enable intelligent applications relying on human activity recognition  har  on resource limited and low power internet of things  iot  edge devices. however designing efficient tinyml models for these devices remains challenging due to computational resource constraints and the need for customisation to unique use cases. to address this we propose a novel approach that utilises transfer learning  tl  techniques on edge micro controller units  mcus  to accelerate tinyml development. our strategy involves pre training generalised ml models on large scale and varied datasets and fine tuning them on device for specific applications using tl. we demonstrate the effectiveness of our approach for har by experimenting with a convolutional neural network long short term memory tl  cnn lstm tl  model architecture and visualisation techniques like t distributed stochastic neighbour embedding  t sne  for dimensionality reduction. to further validate our model‚äôs proficiency and adaptability we conducted extensive testing using two distinct datasets  motionsense and uci. this dual dataset approach allowed us to assess the robustness of our model across different data domains showcasing its versatility and effectiveness in various har scenarios. our results show significant model accuracy and reduced training time while maintaining high inference rates and low mcu memory footprint. we also provide insights into best practices for implementing tl on edge mcus and evaluate classification performance metrics such as accuracy precision recall f1 score and categorical cross entropy loss. our work lays a solid foundation for faster and more efficient tinyml deployments through tl framework across different application domains and types of edge iot devices.", "Pub Date": "2024-03-27"}