{"Title": "To Deploy New or to Deploy More?: An Online SFC Deployment Scheme at Network Edge", "Doi": "10.1109/JIOT.2023.3293817", "Authors": ["z. yuan", "l. luo", "d. guo", "d. c. . -k. wong", "g. cheng", "b. ren", "q. zhang"], "Key Words": ["deep reinforcement learning (drl)", "edge computing", "online service function chaining (sfc) deployment"], "Abstract": "service function chaining  sfc  dynamically links multiple virtual network functions  vnfs  to provide flexible and scalable network services for network entities and users. implementing sfcs at the network edge provides instant vnf service yet is confined by the limited edge resources. existing strategies suggest either to deploy new vnfs for diverse service provision or to deploy more installed vnfs for reliable service provision. however these one sided optimizations fail to realize comprehensive improvements in the network service quality. to this end the motivation of this article is to consider a more comprehensive sfc deployment plan to provide more efficient network services. in this article we propose deepsfc an online sfc deployment scheme at network edge. our deepsfc considers the impact of resource allocations and deployment locations on the average latency of overall service requests. it realizes an elegant tradeoff between the diversity and the availability of sfcs by adopting the deep reinforcement learning  drl  method. to be specific we first determine the type and number of vnfs that need to be deployed. thereafter we optimize the deployment locations of these chosen vnfs in the service chain considering the impact of dynamic bandwidth in the real network. for more general scenarios wherein users‚äô service requirements change or the deployed server crashes we further relocate the vnf deployment with the joint consideration of performance degradation and migration cost. evaluation results show that deepsfc outperforms its competitors in various experimental settings and responds the requests with lower average latency.", "Pub Date": "2024-01-08"}