{"Title": "Topic Modelling using Latent Dirichlet Allocation (LDA) and Analysis of Students Sentiments", "Doi": "10.1109/JCSSE58229.2023.10201965", "Authors": ["o. ishmael", "e. kiely", "c. quigley", "d. mcginty"], "Key Words": ["lda", "sentiments", "nlp", "modelling", "assessments"], "Abstract": "open ended question responses are an unstructured data source that contains extremely useful information. the idea of obtaining information using open ended questions is particularly popular and frequently employed in various schools and digital platforms. in the field of education universities collect and generate vast amounts of data daily left unused or not analysed. this demonstrates the need to develop different models to promote the use of text based data analysis techniques. in this study surveys with open ended questions were used to draw out analytical insights from student views on automated personalised feedback assessments. opened ended questions present questions that require answers that use natural language. the human language data described in text documents is made possible by the use of various natural language processing  nlp  approaches. these approaches include the latent semantic analysis  lsa  and latent dirichlet allocation  lda  that analyse open ended questions and surveys data. in this study lda is used for modelling topics to analyse students' sentiments on the feedback assessment given to them regarding their performance on the module. providing automated personalised feedback to large student groups has many challenges such as the type of communication delivery mode and the language used for feedback about their progress. this study offers an application of nlp in an education environment to provide meaningful and useful student feedback. the paper presents the steps algorithm and findings so that practitioners can apply this model to their education setting. the findings reveal 87% of students have positive sentiments 7% are neutral 5% are confused by the personalised feedback forms. this informs practitioners about the value of the feedback but also areas for future work when offering feedback to students.", "Pub Date": "2023-08-10"}