{"Title": "Towards Reliable Participation in UAV-Enabled Federated Edge Learning on Non-IID Data", "Doi": "10.1109/OJVT.2023.3341304", "Authors": ["y. cheriguene", "w. jaafar", "h. yanikomeroglu", "c. a. kerrache"], "Key Words": ["dropouts", "edge computing", "federated learning", "model poisoning", "stragglers", "uav", "unmanned aerial vehicle"], "Abstract": "federated learning  fl  is a decentralized machine learning  ml  technique that allows a number of participants to train an ml model collaboratively without having to share their private local datasets with others. when participants are unmanned aerial vehicles  uavs  uav enabled fl would experience heterogeneity due to the majorly skewed  non independent and identically distributed  iid  collected data. in addition uavs may demonstrate unintentional misbehavior in which the latter may fail to send updates to the fl server due for instance to uavs' disconnectivity from the fl system caused by high mobility unavailability or battery depletion. such challenges may significantly affect the convergence of the fl model. a recent way to tackle these challenges is client selection based on customized criteria that consider uav computing power and energy consumption. however most existing client selection schemes neglected the participants' reliability. indeed fl can be targeted by poisoning attacks in which malicious uavs upload poisonous local models to the fl server by either providing targeted false predictions for specifically chosen inputs or by compromising the global model accuracy through tampering with the local model. hence we propose in this article a novel client selection scheme that enhances convergence by prioritizing fast uavs with high reliability scores while eliminating malicious uavs from training. through experiments we assess the effectiveness of our scheme in resisting different attack scenarios in terms of convergence and achieved model accuracy. finally we demonstrate the performance superiority of the proposed approach compared to baseline methods.", "Pub Date": "2023-12-29"}