{"Title": "Toward a Unified Framework for Unsupervised Complex Tabular Reasoning", "Doi": "10.1109/ICDE55515.2023.00133", "Authors": ["z. li", "x. li", "z. duan", "b. dong", "n. liu", "j. wang"], "Key Words": ["unsupervised data generation", "tabular reasoning"], "Abstract": "structured tabular data exist across nearly all fields. reasoning task over these data aims to answer questions or determine the truthiness of hypothesis sentences by understanding the semantic meaning of a table. while previous works have devoted significant efforts to the tabular reasoning task they always assume there are sufficient labeled data. however constructing reasoning samples over tables  and related text  is labor intensive especially when the reasoning process is complex. when labeled data is insufficient the performance of models will suffer an unendurable decline. in this paper we propose a unified framework for unsupervised complex tabular reasoning  uctr  which generates sufficient and diverse synthetic data with complex logic for tabular reasoning tasks assuming no human annotated data at all. specifically we first utilize a random sampling strategy to collect diverse programs of different types and execute them on tables based on a \"program executor\" module. to bridge the gap between the programs and natural language sentences we design a powerful \"nl generator\" module to generate natural language sentences with complex logic from these programs. since a table often occurs with its surrounding texts we further propose novel \"table to text\" and \"text to table\" operators to handle joint table text reasoning scenarios. this way we can adequately exploit the unlabeled table resources to obtain a well performed reasoning model under an unsupervised setting. our experiments cover different tasks  question answering and fact verification  and different domains  general and specific  showing that our unsupervised methods can achieve at most 93% performance compared to supervised models. the impressive performance demonstrates that uctr can significantly reduce the dependence on manual annotation. moreover we also find that it can substantially boost the supervised performance in low resourced domains as a data augmentation technique.", "Pub Date": "2023-07-26"}