{"Title": "Toward Ambient Intelligence: Federated Edge Learning With Task-Oriented Sensing, Computation, and Communication Integration", "Doi": "10.1109/JSTSP.2022.3226836", "Authors": ["p. liu", "g. zhu", "s. wang", "w. jiang", "w. luo", "h. v. poor", "s. cui"], "Key Words": ["ambient intelligence", "federated edge learning", "integrated sensing and communication", "sensing-computation-communication resource allocation"], "Abstract": "with the breakthroughs in deep learning and contactless sensors the recent years have witnessed a rise of ambient intelligence applications and services spanning from healthcare delivery to intelligent home. federated edge learning  feel  as a privacy enhancing paradigm of collaborative learning at the network edge is expected to be the core engine to achieve ambient intelligence. sensing computation and communication  sc$^{2}$  are highly coupled processes in feel and need to be jointly designed in a task oriented manner to achieve the best feel performance under stringent resource constraints at edge devices. however this remains an open problem as there is a lack of theoretical understanding on how the sc$^{2}$ resources jointly affect the feel performance. in this paper we address the problem of joint sc$^{2}$ resource allocation for feel via a concrete case study of human motion recognition based on wireless sensing in ambient intelligence. first by analyzing the wireless sensing process in human motion recognition we find that there exists a thresholding value for the sensing transmit power exceeding which yields sensing data samples with approximately the same satisfactory quality. then the joint sc$^{2}$ resource allocation problem is cast to maximize the convergence speed of feel under the constraints on training time energy supply and sensing quality of each edge device. solving this problem entails solving two subproblems in order  the first one reduces to determine the joint sensing and communication resource allocation that maximizes the total number of samples that can be sensed during the entire training process  the second one concerns the partition of the attained total number of sensed samples over all the communication rounds to determine the batch size at each round for convergence speed maximization. the first subproblem on joint sensing and communication resource allocation is converted to a single variable optimization problem by exploiting the derived relation between different control variables  resources  which thus allows an efficient solution via one dimensional grid search. for the second subproblem it is found that the number of samples to be sensed  or batch size  at each round is a decreasing function of the loss function value attained at the round. based on this relationship the approximate optimal batch size at each communication round is derived in closed form as a function of the round index. finally extensive simulation results are provided to validate the superiority of the proposed joint sc$^{2}$ resource allocation scheme over baseline schemes in terms of feel performance.", "Pub Date": "2023-02-22"}