{"Title": "Toward Network-Slicing-Enabled Edge Computing: A Cloud-Native Approach for Slice Mobility", "Doi": "10.1109/JIOT.2023.3292520", "Authors": ["s. d. a. shah", "m. a. gregory", "s. li"], "Key Words": ["5g", "cloud-native", "microservices", "multiaccess edge computing (mec)", "network slice mobility (nsm)", "ultrareliable and low-latency communication (urllc)", "vehicle-toeverything (v2x)"], "Abstract": "network slicing is a key enabler for 5g and beyond networks that permits operators to provide scalable flexible and dedicated networks over a common physical infrastructure. to cope with the rising demand for ultrareliable and low latency communication  urllc  in beyond 5g networks the provision of dedicated secure networks closer to the users is essential. multiaccess edge computing  mec  is a promising technology that provides data and computational resources closer to mobile users. however mec servers are resource constrained and offering dedicated service specific network slices at the edge in a highly dynamic and mobile environment is challenging. network slicing and mec are being evolved by two different standardization bodies that limit their integration and raise mobility challenges that deserve more attention. we propose a cloud native microservices architecture for network slice mobility management in mec that permits each mec slice to be distributed as stateless and independently deployable microservices. the proposal separates the mec slice operational data and the user context as each network function in a mec slice stores the context in a separate shared database. the proposed architecture leverages new sdn extended federation modules in compliance with the etsi requirements for inter mec system coordination. the federation modules support a more flexible and scalable creation of network slices at mec servers efficient resource utilization and mobility of network slices across mec servers. the simulation results show that our proposed architecture outperforms the existing sdn based approaches for network slicing in mec by achieving high slice acceptance rates and reduced slice migration delay.", "Pub Date": "2024-01-08"}