{"Title": "Toward Autonomous Multi-UAV Wireless Network: A Survey of Reinforcement Learning-Based Approaches", "Doi": "10.1109/COMST.2023.3323344", "Authors": ["y. bai", "h. zhao", "x. zhang", "z. chang", "r. j√§ntti", "k. yang"], "Key Words": ["unmanned aerial vehicle (uav)", "multi-uav wireless network", "reinforcement learning", "uav-assisted communication network", "uav-assisted mobile computing"], "Abstract": "unmanned aerial vehicle  uav  based wireless networks have received increasing research interest in recent years and are gradually being utilized in various aspects of our society. the growing complexity of uav applications such as disaster management plant protection and environment monitoring has resulted in escalating and stringent requirements for uav networks that a single uav cannot fulfill. to address this multi uav wireless networks  muwns  have emerged offering enhanced resource carrying capacity and enabling collaborative mission completion by multiple uavs. however the effective operation of muwns necessitates a higher level of autonomy and intelligence particularly in decision making and multi objective optimization under diverse environmental conditions. reinforcement learning  rl  an intelligent and goal oriented decision making approach has emerged as a promising solution for addressing the intricate tasks associated with muwns. as one may notice the literature still lacks a comprehensive survey of recent advancements in rl based muwns. thus this paper aims to bridge this gap by providing a comprehensive review of rl based approaches in the context of autonomous muwns. we present an informative overview of rl and demonstrate its application within the framework of muwns. specifically we summarize various applications of rl in muwns including data access sensing and collection resource allocation for wireless connectivity uav assisted mobile edge computing localization trajectory planning and network security. furthermore we identify and discuss several open challenges based on the insights gained from our review.", "Pub Date": "2023-11-21"}