{"Title": "Towards Complete and Scalable Emulation of Quantum Algorithms on High-Performance Reconfigurable Computers", "Authors": ["e. el-araby", "n. mahmud", "m. j. jeng", "a. macgillivray", "m. chaudhary", "m. a. i. nobel", "s. i. u. islam", "d. levy", "d. kneidel", "m. r. watson", "j. g. bauer", "a. e. riachi"], "Pub Date": "2023-07-10", "Abstract": "contemporary quantum computers face many critical challenges that limit their usefulness for practical applications. a primary limiting factor is classical to quantum  c2q  data encoding which requires specific circuits for quantum state initialization. the required state initialization circuits are often complex and violate decoherence constraints particularly for i o intensive applications. existing noisy intermediate scale quantum  nisq  devices are noise sensitive and have low quantum bit  qubit  counts thus limiting the applicability of c2q circuits for encoding large and realistic datasets. this has made the study of complete and realistic circuits that include data encoding challenging and has also led to a heavy dependency on costly and resource intensive simulations on classical platforms. in this work we propose a cost effective classical hardware accelerated framework for realistic and complete emulation of quantum algorithms. the emulation framework incorporates components for the critical c2q data encoding process as well as architectures for quantum algorithms such as the quantum haar transform  qht . the framework is used to investigate optimizations for c2q and qht algorithms and the corresponding optimized quantum circuits are presented. the framework is implemented on a high performance reconfigurable computer  hprc  which emulates the proposed qht circuits combined with proposed c2q data encoding methods. for performance benchmarks cpu based emulations and simulations on a state of the art quantum computing simulator are also carried out. results show that the proposed hardware accelerated emulation framework is more efficient in terms of speed and scalability compared to cpu based emulation and simulation.", "Doi": "10.1109/TC.2023.3248276", "Key Words": ["field-programmable gate arrays", "parallel processing", "quantum computing", "quantum encoding"]}