{"Title": "Toward Deterministic Communications in 6G Networks: State of the Art, Open Challenges and the Way Forward", "Doi": "10.1109/ACCESS.2023.3316605", "Authors": ["g. p. sharma", "d. patel", "j. sachs", "m. de andrade", "j. farkas", "j. harmatos", "b. varga", "h. -p. bernhard", "r. muzaffar", "m. ahmed", "f. d√ºrr", "d. bruckner", "e. m. de oca", "d. houatra", "h. zhang", "j. gross"], "Key Words": ["6g", "urllc", "tsn", "detnet", "wireless", "machine learning", "deterministic communication"], "Abstract": "over the last decade society and industries have undergone rapid digitization that is expected to lead to the evolution of the cyber physical continuum. end to end deterministic communications infrastructure is the essential glue that will bridge the digital and physical worlds of the continuum. we describe the state of the art and open challenges with respect to contemporary deterministic communications and compute technologies‚äî 3gpp 5g ieee time sensitive networking ietf detnet opc ua as well as edge computing. while these technologies represent significant technological advancements towards networking cyber physical systems  cps  we argue in this paper that they rather represent a first generation of systems that are still limited in different dimensions. in contrast realizing future deterministic communications systems requires firstly seamless convergence between these technologies and secondly scalability to support heterogeneous  time varying requirements  arising from diverse cps applications. in addition future deterministic communication networks will have to provide such characteristics end to end which for cps refers to the entire communication and computation loop from sensors to actuators. in this paper we discuss the state of the art regarding the main challenges towards these goals  predictability end to end technology integration end to end security and scalable vertical application interfacing. we then present our vision regarding viable approaches and technological enablers to overcome these four central challenges. in particular we argue that there is currently a window of opportunity to establish through 6g standardization the foundations for a scalable and converged deterministic communications and compute infrastructure. key approaches to leverage in that regard are 6g system evolutions wireless friendly 6g integration with tsn and detnet novel end to end security approaches efficient edge cloud integrations data driven approaches for stochastic characterization and prediction as well as leveraging digital twins towards system awareness.", "Pub Date": "2023-10-06"}