{"Title": "Toward Optimal MEC-Based Collision Avoidance System for Cooperative Inland Vessels: A Federated Deep Learning Approach", "Doi": "10.1109/TITS.2022.3154158", "Authors": ["w. hammedi", "b. brik", "s. m. senouci"], "Key Words": ["water transportation systems", "internet of ships", "cooperative collision avoidance", "deep federated learning", "mobile edge computing", "consortium blockchain"], "Abstract": "cooperative collision avoidance between inland waterway ships is among the envisioned services on the internet of ships. such a service aims to support safe navigation while optimizing ships‚äô trajectories. however to deploy it timely and accurate prediction of ships‚äô positioning with real time reactions is needed to anticipate collisions. in such a context ships positions are usually predicted using advanced machine learning  ml  techniques. traditionally ml schemes require that the data be processed in a centralized way e.g. a cloud data center managed by a third party. however these schemes are not suitable for the collisions avoidance service due to the inaccessibility of ships‚äô positioning data by this third party and allowing connected ships to get access to sensitive information. therefore in this paper we design a new cooperative collision avoidance system for inland ships while ensuring data security and privacy. our system is based on deep federated learning to collaboratively build a model of ship positioning prediction while avoiding sharing their private data. in addition it is deployed at multi access edge computing  mec  level to provide low latency communication to ensure fast responses during collision detection. furthermore it relies on blockchain and smart contracts to ensure trust and valid communications between ships and mec nodes. we evaluate the proposed system using a generated dataset representing ships mobility in france. the results which demonstrate the accuracy of our prediction model prove the effectiveness of our cooperative collision avoidance system in ensuring timely and reliable communications and avoiding collisions between ships.", "Pub Date": "2023-02-08"}