{"Title": "Traditional Chinese Medicine Prescription Recommendation Model Based on Large Language Models and Graph Neural Networks", "Doi": "10.1109/BIBM58861.2023.10385489", "Authors": ["j. qi", "x. wang", "t. yang"], "Key Words": ["prescription recommendation", "large language model", "traditional chinese medicine", "graph neural network"], "Abstract": "background  traditional chinese medicine  tcm  has a millennia long history offering unique treatments and insights into global health. given the intricate symptoms and shifting syndrome patterns prescribing can be tough for young doctors. tcm prescription recommendations can help these doctors address their experience gap. in recent years with advancements in technologies such as artificial intelligence and big data intelligent recommendations for tcm prescriptions have become feasible holding significant implications for enhancing treatment efficacy and optimizing patient experience. objective  this study aims to establish a novel tcm prescription recommendation model by integrating large language models with graph neural network  gnn  to enhance the accuracy of prescription suggestions. method  based on the co occurrence of symptoms and herbal medicines we constructed symptom graphs symptom herb graphs and herb herb graphs. using graph convolutional network  gcn  we acquired embeddings for both symptoms and herbs. the symptom embeddings are then integrated with insights from large language model embeddings while auxiliary information from an external knowledge graph is incorporated into the herb embeddings. a final list of herb recommendations was generated by interacting with the embeddings of symptoms and herbs. results  the proposed algorithm achieved 22.1% 17.2% and 13% on the evaluation metrics p@5 p@10 and p@20 respectively. concurrently scores for r@5 r@10 and r@20 were 14% 24% and 32.5% respectively. the p@5 metric surpassed the kdhr by 4.7% and the r@20 metric exceeded the kdhr by 6%. overall the performance of our model outperformed other baseline models across various evaluation criteria. conclusion  the tcm prescription recommendation model infused with information from a large language model can effectively enhance the outcomes of tcm prescription recommendations. the study may offer valuable insights for auxiliary clinical research and treatment in tcm.", "Pub Date": "2024-01-18"}