{"Title": "Traffic Flow Optimization for UAVs in Multi-Layer Information-Centric Software-Defined FANET", "Doi": "10.1109/TVT.2022.3213040", "Authors": ["l. zhu", "m. m. karim", "k. sharif", "c. xu", "f. li"], "Key Words": ["flow optimization", "information-centric networking", "software-defined networks", "uavs"], "Abstract": "unmanned aerial vehicles  uavs  have received significant research interest from academia due to their on demand content distribution capabilities using mobile edge computation and the next generation flying ad hoc network  fanet . with the addition of software defined networking  sdn  and network virtualization these uavs have transformed into three dimensional distributed heterogeneous networks. however the softwarized uav based communication is prone to high latency energy consumption resource constraints and link failures. hence content orchestration has become a significant challenge. information centric networking  icn  uses content based rapid data dissemination in the dynamic wireless scenario. however icn based content discovery and distribution have not been explored extensively for uav assisted networks. in this work we propose a uav assisted multi layer ic sdn solution to tackle the content distribution challenges using distributed controllers placed hierarchically in the edge and cloud tiers. besides we formulate the traffic optimization problem into a joint forwarding and flow scheduling problem using m m/1 queueing allocation model and propose a heuristic edge cloud traffic flow assignment solution that allocates requests based on the service type and device location. we evaluate the proposed solution in a simulation environment considering the mobility principle of fanet nodes. besides the effectiveness of the optimization solution and the performance gains are evaluated analytically. the simulation and numerical results show that the proposed optimization model is efficient as compared to other solutions in maximizing throughput and minimizing computational latency delay and packet loss.", "Pub Date": "2023-02-13"}