{"Title": "Transformer With Double Enhancement for Low-Dose CT Denoising", "Doi": "10.1109/JBHI.2022.3216887", "Authors": ["h. li", "x. yang", "s. yang", "d. wang", "g. jeon"], "Key Words": ["low-dose ct", "denoising", "transformer", "double enhancement", "compound loss"], "Abstract": "increasingly serious health problems have made the usage of computed tomography surge. therefore algorithms for processing ct images are becoming more and more abundant. these algorithms can lessen the harm of cumulative radiation in ct technology for the patient while eliminating the noise of image caused by dose reduction. however the mainstream cnn based algorithms are inefficient when dealing with features in broad regions. inspired by the large receptive field of transformer framework this paper designs an end to end low dose ct  ldct  denoising network based on the transformer. the overall network contains a main branch and dual side branches. specifically the overlapping free window based self attention transformer block is adopted on the main branch to realize image denoising. on the dual side branches we propose double enhancement module to enrich edge texture and context information of ldct images. meanwhile the receptive field of network is further enlarged after processing which is helpful for building model long range dependencies. the outputs of the side branches are concatenated for enhancing information and generating high quality ct images. in addition to better train the network we introduce a compound loss function including mean squared error  mse  multi scale perceptual  msp  and sobel l1  sl  to make the denoised image closer to the targeted norm dose ct  ndct  image. lastly we conducted experiments on two clinical datasets including abdomen head and chest ldct images with 25% 25% and 10% of the full dose respectively. the experimental results demonstrated that the proposed deformer achieved better denoising performance than the existing algorithms.", "Pub Date": "2023-10-05"}