{"Title": "Transformer Models for Recognizing Abusive Language An investigation and review on Tweeteval and SOLID dataset", "Doi": "10.1109/ICEEICT56924.2023.10157848", "Authors": ["f. a. rawther", "g. titus"], "Key Words": ["distilbert", "roberta", "distilroberta", "deberta", "nlp", "tweets"], "Abstract": "social engineering communities have become very popular among the kids and elderly alike. in this era of social media the streaming of comments opinions reviews and communications is done via most common social media messaging communities like twitter meta owned whatsapp fb and instagram snapchat telegram and youtube comments. in this paper we perform a review on the different methods and models used to identify the offensive language using different datasets. offensive language detection is a tedious task as it is country and language specific. the corpus used to identify the offensiveness and abusiveness is not covering all the word usages. we have done a comparison study of different methods on text to detect the post is offensive or not. the detection of abusive language is an unsolved and challenging problem to researchers in natural language processing  nlp . this has led to be one of the reasons for increased level of mental instability among teenagers to elderly. the crime via social media has increased to a large value than older days. the study and surveys show that to recognize the structure and context of the language is the best way to solve this problem to an extent. the paper aims to four recent transformer models pretrained and fine tuned for offensive language detection on the tweeteval dataset viz  distilbert roberta distilroberta and deberta. all the model had limitation in the performance based on the training data size used but are optimized by tuning hyper parameters during training. the models are limited to english language offensive words and recent works are going on in the area of multilingual tweets on both text and speech processing.", "Pub Date": "2023-06-26"}