{"Title": "Transparent Third-Party Authentication With Application Mobility for 5G Mobile-Edge Computing", "Doi": "10.1109/TNSM.2023.3296085", "Authors": ["a. ali", "y. -d. lin", "c. -y. li", "y. -c. lai"], "Key Words": ["mobile edge computing", "multi-access edge computing", "authentication", "mobility", "latency", "3gpp cellular networks"], "Abstract": "mobile edge computing  mec  is a key technology for supporting low latency applications close to the end user. users can access application servers in mec instead of routing to the internet by passing through a core cellular network. few security challenges arise as the traffic does not traverse through the core network and these can be solved by providing authentication services in the mec. however authentication and application mobility issues arise in the case of multiple mecs where a user is mobile and needs continuous service from application servers without needing to establish a new session and providing authentication information repeatedly to every new mec the user connects with. in this work we propose two solutions a tc3a  token based cookie transfer & 3rd party authentication  and a ts3a  token based state transfer & 3rd party authentication  for resolution of authentication and application mobility issues while achieving low latency. we conducted experiments on a testbed that had mecs deployed in a real time cellular network  emulated via openairinterface  and performed user handover between two mecs. the experimental results show that tc3a and ts3a successfully re authenticate the users without provision of login credentials with target mec while reducing the latency by approximately 49.76‚äì59.72% as compared to simple login method. the tc3a and ts3a also eliminate the need of keeping multiple accounts for applications at different mecs and most importantly provide application service continuity through state transfer during cross system handover which is not provided by a simple login method. tc3a provides the application service continuity without any loss of session state which is suitable for applications that cannot afford state loss and ts3a provides the same while reducing the latency by 47.05‚äì51.25% as compared to tc3a which is suitable for applications that require low latency.", "Pub Date": "2024-02-07"}