{"Title": "Tri-Modal Medical Image Fusion and Denoising Based on BitonicX Filtering", "Authors": ["y. jie", "x. li", "f. zhou", "t. ye"], "Pub Date": "2023-11-03", "Abstract": "medical image fusion integrates beneficial information from images of different modes and has been studied as a crucial auxiliary medical technology  however current research mainly focused on two modal fusion problems [e.g. computed tomography  ct  magnetic resonance imaging  mri  mri positron emission tomography  pet ] and little attention was paid to tri modal medical image fusion  e.g. ct mr t2 single photon emission ct  spect  mr t2 mr gad spect . in this article we present a tri modal medical image fusion and denoising method that contains fusion models  i  and  ii . a three layer decomposition based on a bitonicx filter was designed for model  i . particularly the adaptive morphological gradient pulse coupled neural network  am pcnn  and the coupled neural p  cnp  system based rules were proposed to fuse the detail and texture layers respectively. the middle fused result was obtained by synthesizing the prefused energy texture and detail layers in the model  i . in model  ii  for the fusion of the functional image and middle fused result we performed a ‚äúdetail energy‚äù decomposition with the bitonicx filter. we also propose a gradient energy clarity  gec  operator and energy based rules for fusing the detail and energy layers. the final fused result was obtained by adding the prefused detail layer and the energy layer in the model  ii . numerous experiments were conducted to assess the fused images objectively and subjectively demonstrating that the proposed method developed in this study surpasses the state of the art methods in noise free and noise fusions. meanwhile the average levels of the proposed method are 38.39% 2.46% 1.01% 36.28% 11.23% 20.82% 8.46% and 2.52% higher than that of the compared methods evaluated by the metrics including interactive information metric  qmi  tsallis entropy metric  qte  noncorrelated information entropy metric  qncie  phase consistency metric  qp  chen blum metric  qcb  structural similarity metric  qssim  contrast to noise  cnr  and correlation coefficient  cc  respectively. our code is available at https //github.com jei981214/tri modal bitonicx based.", "Doi": "10.1109/TIM.2023.3326255", "Key Words": ["bitonicx filter", "coupled neural p (cnp) system", "denoising", "gradient energy clarity (gec) operator", "pulse-coupled neural network (pcnn)", "tri-modal medical image fusion"]}