{"Title": "UAV-Enabled Mobile Edge Computing for Resource Allocation Using Cooperative Evolutionary Computation", "Doi": "10.1109/TAES.2023.3251967", "Authors": ["s. goudarzi", "s. a. soleymani", "w. wang", "p. xiao"], "Key Words": ["mobile edge computing (mec)", "queue-based computation offloading", "resource allocation", "unmanned aerial vehicle (uav)"], "Abstract": "edge computing is a viable paradigm for supporting industrial internet of things deployment by shifting computationally demanding tasks from resource constrained devices to powerful edge servers. in this study mobile edge computing  mec  services are provided for multiple ground mobile nodes  mns  through a time division multiple access protocol using unmanned aerial vehicle  uav  enabled edge servers. remotely controlled uavs can serve as mec servers due to their adaptability and flexibility. however the current mec approaches have proven ineffective in situations where the number of mns rapidly increases or network resources are sparsely distributed. furthermore suitable accessibility across wireless networks via mns with an acceptable quality of service is a fundamental problem for conventional uav assisted communications. to tackle this issue we present an optimized computation resource allocation model using cooperative evolutionary computation to solve the joint optimization problem of queue based computation offloading and adaptive computing resource allocation. the developed method ensures the task computation delay of all mns within a time block optimizes the sum of mn accessibility rates and reduces the energy consumption of the uav and mns while meeting task computation restrictions. moreover we propose a multilayer data flow processing system to make full use of the computational capability across the system. the top layer of the system contains the cloud center the middle layer contains the uav assisted mec servers and the bottom layer contains the mobile devices. our numerical analysis and simulation results prove that the proposed scheme outperforms conventional techniques such as equal offloading time allocation and straight line flight.", "Pub Date": "2023-10-10"}