{"Title": "UEE‚ÄìDelay Balanced Online Resource Optimization for Cooperative MEC-Enabled Task Offloading in Dynamic Vehicular Networks", "Doi": "10.1109/JIOT.2023.3330122", "Authors": ["j. su", "z. liu", "y. -a. xie", "y. li", "k. ma", "x. guan"], "Key Words": ["cooperative offloading (co)", "lyapunov optimization", "mobile-edge computing (mec) networks", "utility energy efficiency (uee)‚äìdelay balance"], "Abstract": "mobile edge computing  mec  pushing the centralized cloud computing storage and communication capability to the edge close to vehicular terminals is proposed as a promising solution to support computation intensive and delay sensitive services. this article proposes a cooperative mec enabled task offloading framework where the computational task of each vehicle is divided and computed by multiple collaborative mecs located on the roadside. however existing mec enabled offloading research is based on offline settings or static networks and fails to address the dynamic communication environments. these dynamic environments involve variations in temporality  real time channel state  and spatiality  uncertain data queue backlogs as vehicles pass through different coverage areas of mecs . in the dynamic vehicular networks the degradation of utility energy efficiency  uee  and time delay is inevitable and significantly impacted. to tackle this issue we propose an online dynamic scheme to solve the problem of maximizing uee while meeting time delay constraints. we then introduce a novel online dynamic optimization algorithm based on lyapunov optimization theory to adaptively create strategies for task offloading and communication resource allocation in parallel. numerical simulations demonstrate that the proposed algorithm achieves a balance between uee and delay striking a flexible tradeoff by tuning the control parameter  $v$ . furthermore the results confirm that the proposed algorithm outperforms baseline algorithms in terms of real time communication and transmission capability.", "Pub Date": "2024-03-26"}