{"Title": "Ultrasound Brain Tomography: Comparison of Deep Learning and Deterministic Methods", "Authors": ["m. soleimani", "t. rymarczyk", "g. k≈çosowski"], "Pub Date": "2023-12-22", "Abstract": "the general purpose of this document is to develop a lightweight portable ultrasound computer tomography  usct  system that enables noninvasive imaging of the inside of the human head with high resolution. the goal is to analyze the benefits of using a deep neural network containing convolutional neural network  cnn  and long short term memory  lstm  layers compared to deterministic methods. in addition to the cnn + lstm and lstm networks the following methods were used to create tomographic images of the inside of the human head  truncated singular value decomposition  tsvd  linear backprojection  lb  gauss‚äìnewton  gn  with regularization matrix tikhonov regularization  tr  and levenberg‚äìmarquardt  lm . a physical model of the human head was made. based on synthetic and real measurements images of the inside of the brain were reconstructed. on this basis the cnn + lstm and lstm methods were compared with deterministic methods. based on the comparison of images and quantitative indicators it was found that the proposed neural network is much more tolerant of noisy and nonideal synthetic data measurements which is manifested in the lack of the need to apply filters to the obtained images. an important finding confirmed by hard evidence is the confirmation of the greater usefulness of neural models in medical ultrasound tomography which results from the generalization abilities of the deep hybrid neural network. at the same time research has shown a deficit of these abilities in deterministic methods. considering the human head‚äôs specificity using hybrid neural networks containing both cnn and lstm layers in clinical trials is a better choice than deterministic methods.", "Doi": "10.1109/TIM.2023.3330229", "Key Words": ["brain imaging", "brain phantom", "neural networks", "speed of sound imaging", "ultrasound computed tomography"]}