{"Title": "Understanding Deep Learning Techniques for Recognition of Human Emotions Using Facial Expressions: A Comprehensive Survey", "Authors": ["m. karnati", "a. seal", "d. bhattacharjee", "a. yazidi", "o. krejcar"], "Pub Date": "2023-02-23", "Abstract": "emotion recognition plays a significant role in cognitive psychology research. however measuring emotions is a challenging task. thus several approaches have been designed for facial expression recognition  fer . although the challenges increase further as the data transit from the laboratory controlled environment to in the wild circumstances nowadays applications are overwhelmed by a profusion of deep learning  dl  techniques in real world problems. dl networks have steadily led to a better understanding of low dimensional discriminative features from high dimensional complex face patterns for automatic fer. the modern fer systems based on deep neural networks mainly suffer from two problems  overfitting due to the inadequate availability of training data and complications unassociated with the expressions such as occlusion posture illumination and identity bias. this study aims to provide a comprehensive survey of the significant dl based methods that have made a notable contribution to the field of fer. different components of the methods such as preprocessing feature extraction and classification of facial expressions are described systematically. moreover the discussed approaches are analyzed to compare their performance along with their advantages and limitations. furthermore different databases relevant to fer are also explored in this study. essentially the main aim of this survey is twofold. the former is to discuss the current scenario of fer approaches and the latter is to present some thoughts on the future directions of facial emotion recognition by machines  what are the obstacles and prospects for fer researchers?", "Doi": "10.1109/TIM.2023.3243661", "Key Words": ["deep learning (dl)", "facial expression databases", "facial expression recognition (fer)", "fer challenges", "fer future directions", "overfitting", "survey"]}