{"Title": "Universal Linear Optics Revisited: New Perspectives for Neuromorphic Computing With Silicon Photonics", "Authors": ["g. giamougiannis", "a. tsakyridis", "m. moralis-pegios", "a. r. totovic", "m. kirtas", "n. passalis", "a. tefas", "d. lazovsky", "n. pleros"], "Pub Date": "2022-12-22", "Abstract": "reprogrammable optical meshes comprise a subject of heightened interest for the execution of linear transformations having a significant impact in numerous applications that extend from the implementation of optical switches up to neuromorphic computing. herein we review the state of the art approaches for the realization of unitary transformations and universal linear operators in the photonic domain and present our recent work in the field that allows for fidelity restorable and low loss optical circuitry with single step programmability. these advantages unlock a new framework for matrix vector multiplications required by neuromorphic silicon photonic circuits supporting  i  high speed and high accuracy neural network  nn  inference ii  high speed tiled matrix multiplication iii  nn training and iv  programmable photonic nns. this new potential is initially validated through recent experimental results using sige eam technology and static weights and subsequently utilized for demonstrating experimentally the first deep nn  dnn  where optical tiled matrix multiplication up to 50 ghz is realized allowing optics to execute dnns with large number of trainable parameters over a limited photonic hardware. finally the new performance framework is benchmarked against state of the art nn processors and photonic nn roadmap projections highlighting its perspectives to turn the energy and area efficiency promise of neuromorphic silicon photonics into a tangible reality.", "Doi": "10.1109/JSTQE.2022.3228318", "Key Words": ["artificial intelligence", "deep learning", "integrated photonics", "linear optics", "multiport interferometers", "neuromorphic photonics", "reprogrammable photonic meshes", "silicon photonics"]}