{"Title": "Unleashing the Power of Large Language Model, Textual Embeddings, and Knowledge Graphs for Advanced Information Retrieval", "Doi": "10.1109/ICECET58911.2023.10389253", "Authors": ["d. yadav", "h. para", "p. selvakumar"], "Key Words": ["information retrieval", "question & answering systems", "knowledge graphs", "word embeddings", "natural language processing", "large language model", "natural language understanding", "inference-based questions"], "Abstract": "acquiring knowledge beyond the usual expertise is a critical challenge when implementing semantic information solutions for querying a knowledge base. to address this difficulty one proposed solution was to use knowledge graphs in conjunction with traditional question & answering  q&a  systems. however this approach struggles with limited facts difficulty in obtaining further insights into the context and limited ability to handle complex questions leading to inaccurate or irrelevant answers. to overcome these limitations we present an approach for answering inference based questions that integrates knowledge graphs a large language model and relevant embeddings from a vector database. combining knowledge graphs and word embeddings significantly enhances the strength of both techniques leading to improved performance of question and answering systems. we begin with generating representations of the relevant nodes in the knowledge graph and retrieve the most appropriate information from a collection of stored textual data using word embeddings. this approach tackles the shortcomings of conventional approaches that rely solely on knowledge graphs and are too rigid to handle the nuances of the context. this method provides a sophisticated understanding of language and context enabling it to handle complex questions that may involve multiple entities and relationships with a better understanding of the facts and context in which the question is being asked. the system ability to handle complex queries is evidenced through a combination of theoretical analysis and empirical data. our approach has demonstrated exceptional efficiency on a benchmark dataset as evidenced by evaluating the f1 score.", "Pub Date": "2024-01-22"}