{"Title": "Unmanned-Aerial-Vehicle-Assisted Wireless Networks: Advancements, Challenges, and Solutions", "Doi": "10.1109/JIOT.2022.3230786", "Authors": ["m. dai", "n. huang", "y. wu", "j. gao", "z. su"], "Key Words": ["applications", "communication", "computing", "integrated sensing", "unmanned aerial vehicles (uavs)", "wireless networks"], "Abstract": "the rapid development of communication and computing techniques enables unmanned aerial vehicles  uavs  to provide reliable and cost effective wireless communication and computing services from the air. compared to the conventional fixed infrastructure uavs have attractive attributes such as high flexibility and operability and as a result on demand line of sight connection links. therefore uav assisted wireless networks have been envisioned as a promising paradigm to achieve enhanced coverage and connectivity for future wireless communications. meanwhile achieving high levels of energy efficiency sensing communication and computing capacities and security and privacy are critical to the success of uav assisted wireless networks. in order to improve the performance of uav assisted wireless networks some frameworks and mechanisms have been developed in the past few years. in this article we provide a comprehensive survey of these developments. specifically we conduct a brief overview for the architecture of uav assisted wireless networks from four domains  i.e. framework related technology related challenge related and solution related  and four aspects  i.e. sensing related communication related computing related and application related . then the integrated sensing communication and computing for uav assisted wireless networks is introduced followed by the characteristics and requirements. we also provide the implementation and applications of uav assisted wireless networks. next we discuss the challenges and the state of the art solutions for uav assisted wireless networks. finally the advanced technologies for uav assisted communication and computing networks are exploited followed by the potential research directions.", "Pub Date": "2023-02-20"}