{"Title": "Unveiling the Potential of Large Language Models in Generating Semantic and Cross-Language Clones", "Doi": "10.1109/IWSC60764.2023.00011", "Authors": ["p. r. roy", "a. i. alam", "f. al-omari", "b. roy", "c. k. roy", "k. a. schneider"], "Key Words": ["language models", "software clone", "semantic clone", "cross-language clone", "gpt", "semantic-clonebench", "software engineering"], "Abstract": "semantic and cross language code clone generation may be useful for code reuse code comprehension refactoring and benchmarking. openai gpt model has potential in such clone generation as gpt is used for text generation. when developers copy paste codes from stack overflow  so  or within a system there might be inconsistent changes leading to unexpected behaviours. similarly if someone possesses a code snippet in a particular programming language but seeks equivalent functionality in a different language a semantic cross language code clone generation approach could provide valuable assistance. in this study using semanticclonebench as a vehicle we evaluated how well the gpt-3 model could help generate semantic and cross language clone variants for a given fragment. we have comprised a diverse set of code fragments and assessed gpt 3 performance in generating code variants. through extensive experimentation and analysis where 9 judges spent 158 hours to validate we investigate the model ability to produce accurate and semantically correct variants. our findings shed light on gpt 3 strengths in code generation offering insights into the potential applications and challenges of using advanced language models in software development. our quantitative analysis yields compelling results. in the realm of semantic clones gpt-3 attains an impressive accuracy of 62.14% and 0.55 bleu score achieved through few shot prompt engineering. furthermore the model shines in transcending linguistic confines boasting an exceptional 91.25% accuracy in generating cross language clones.", "Pub Date": "2024-03-21"}