{"Title": "UPoS Tagger for Low Resource Assamese Language: LSTM and BiLSTM based Modelling", "Doi": "10.1109/ICMLANT59547.2023.10372865", "Authors": ["k. talukdar", "s. k. sarma"], "Key Words": ["assamese", "pos", "upos tagging", "lstm", "bilstm", "low resource nlp"], "Abstract": "part of speech  pos  tagging is a crucial component of natural language processing enabling syntactic and semantic analysis. this paper presents the development and evaluation of a neural pos tagger tailored for the assamese language using long short term memory  lstm  and bidirectional lstm  bilstm  architectures. assamese a low resource language with its rich morphological structure presents unique challenges for pos tagging. leveraging deep learning we aim to achieve state of the art performance in universal pos  upos  tagging contributing to multilingual nlp research. in the laboratory setup an intel xeon based cpu and an nvidia quadro p1000 gpu powered a robust system configuration. tensorflow keras scikit learn and numpy were employed for model development feature extraction and data preprocessing. the assamese corpus comprising 30000 sequences from the guit assamese corpus was meticulously cleaned creating the gold standard dataset of sequences with a total of 420320 tokens. the upos tagset designed for cross lingual nlp consists of 17 universal pos categories. evaluation metrics included precision recall f1 score and overall accuracy. the bilstm model outperformed lstm with accuracy precision recall and f1 score exceeding 97%. comparison with a gru based baseline model demonstrated the superiority of the bilstm model with improvements of up to 3.77% across performance metrics. the trained models lay the foundation for building high quality tagged corpora for this low resource language. this is a groundbreaking approach to upos tagging in assamese using lstm and bilstm techniques. the use of a smaller upos tagset showcases the impressive capabilities of the trained models paving the way for larger low error tagged corpora. this research contributes to the development of nlp tools tailored for the assamese language marking a significant step forward in the field.", "Pub Date": "2024-01-01"}