{"Title": "UrbanEnQoSPlace: A Deep Reinforcement Learning Model for Service Placement of Real-Time Smart City IoT Applications", "Doi": "10.1109/TSC.2022.3218044", "Authors": ["m. bansal", "i. chana", "s. clarke"], "Key Words": ["iot service placement", "dueling dqn", "smart city", "ai for service placement in smart city", "ai in iot", "drl"], "Abstract": "multi access edge computing  mec  enables iot applications to place their services in the edge servers of mobile networks balancing quality of service  qos  and energy efficiency. previous works consider compute requirements while the iot and latency bandwidth per flow communicate requirements are largely ignored. moreover the smart city domain presents unique challenges ‚äì modeling the urban smart things  usts ‚äì urban iot clients  their connectivity with mec network diverse resource requirements  compute communicate and iot  of application services modeling the federation of multiple mec providers in a city which we consider in this article. to address these research gaps we propose  i  urbanenqosmdp ‚äì formulation for energy and qos  latency  optimized service placement for a set of applications in the ‚äòurban iot federated mec cloud‚äô architecture to satisfy applications‚äô compute per flow communicate and iot requirements  ii  ‚äò‚äô$\\epsilon$œµ greedy with mask‚äù policy for apriori satisfaction of iot requirements by shortlisting suitable usts  iii  urbanenqosplace ‚äì proposed multi action deep reinforcement learning  drl  model designed from dueling deep q network that uses the proposed policy to solve the urbanenqosmdp for simultaneously placing all services of an application. extensive simulation results illustrate efficacy and scalability of proposed model against state of the art drl algorithms  better convergence higher rewards lesser runtime  proposed policy w.r.t fewer violations .", "Pub Date": "2023-08-08"}