{"Title": "Utility Maximization for IRS Assisted Wireless Powered Mobile Edge Computing and Caching (WP-MECC) Networks", "Doi": "10.1109/TCOMM.2022.3222353", "Authors": ["z. chu", "p. xiao", "m. shojafar", "d. mi", "w. hao", "j. shi", "f. zhou"], "Key Words": ["intelligent reflecting surface (irs)", "wireless powered mobile edge computing and caching (wp-mecc)", "utility function", "karush-kuhn-tucker (kkt)", "quadratic transformation (qt)", "riemannian manifold optimization (rmo)"], "Abstract": "this paper exploits an intelligent reflecting surface  irs  assisted wireless powered mobile edge computing and caching  wp mecc  network. in particular an irs is utilized to reflect energy signals from a power station  ps  to various iot devices for energy harvesting during uplink wireless energy transfer  wet . these devices collect energy to support their own partially local computing for computational tasks and their offloading capabilities to an access point  ap  with the help of irs via time or frequency division multiple access  tdma or fdma . the ap is equipped with a local cache connected with a mec server via a backhaul link which prefetches the data to facilitate edge computing capabilities. the maximization of a utility function is formulated to evaluate the overall network performance which is defined as the difference between the sum of computational bits  offloading bits and local computing bits  and total backhaul cost. due to multiple coupled variables we first design the optimal caching strategy. then an auxiliary vector is introduced to coordinate the energy consumption of local computing and offloading where its optimal solution can be achieved by an exhaustive search. moreover we utilize the lagrange dual method and the karush kuhn tucker  kkt  conditions to derive the optimal time scheduling for the tdma scheme or the optimal bandwidth allocation for the fdma counterpart in closed form. the irs phase shifts are iteratively designed by employing the quadratic transformation  qt  and the riemannian manifold optimization  rmo . finally simulation results are demonstrated to validate the network utility performance and confirm the advantage of the employment of irs the optimal irs phase shift design and caching strategy in comparison to the benchmark schemes.", "Pub Date": "2023-01-13"}