{"Title": "Utility-Based Cooperative Resource Sharing in Symbiotic-Radio-Aided Internet of Things Networks", "Doi": "10.1109/JIOT.2022.3229089", "Authors": ["w. liang", "s. wen", "s. x. ng", "j. zhang"], "Key Words": ["backscatter communication (bc)", "energy harvesting (eh)", "internet of things (iot)", "mobile-edge computing (mec)", "offloading strategy", "symbiotic radio (sr)"], "Abstract": "symbiotic radio  sr  is a key technique to solve the energy shortage and spectrum limitation of the future internet of things  iot . in the sr aided iot networks supporting energy harvesting  eh  we study the cooperation schemes and offloading strategy between the primary users  pus  iot devices and the base station  bs  for reasonably allocating the spectrum power and time resources. considering the monetary transactions between the pus and iot devices two cooperation schemes namely the ‚äúpreferential scenario‚äù and the ‚äúno preferential scenario‚äù are proposed. in the preferential scenario based on the final strategy the iot devices use the purchased spectrum and power to offload their own tasks to the bs after assisting the cooperative pus to offload during a certain time slot. due to the assistance of iot devices for the pus iot devices enjoy a discount when paying for the purchased spectrum and power. in the no preferential scenario the iot devices and the cooperative pus offload tasks to the bs together in a certain time slot according to the offloading strategy. the spectrum and power used by the iot devices are purchased at the original price without a discount. for each scenario we study the utility maximization problem of the pus where the utility of pus includes the transmission rates and income. the utility based resource sharing algorithm is proposed to obtain an approximately optimal resource allocation scheme. our simulation results indicate that the proposed algorithm provides good performances for both scenarios while each scenario applying the proposed algorithm has its own advantages.", "Pub Date": "2023-10-30"}