{"Title": "Utilizing Artificial Neural Networks and Combined Capacitance-Based Sensors to Predict Void Fraction in Two-Phase Annular Fluids Regardless of Liquid Phase Type", "Authors": ["m. a. al-fayoumi", "h. m. al-mimi", "a. veisi", "h. al-aqrabi", "m. s. daoud", "e. eftekhari-zadeh"], "Pub Date": "2023-12-25", "Abstract": "assessing the void fraction in diverse multiphase flows across industries including petrochemical oil and chemical sectors is crucial. there are multiple techniques available for this objective. the capacitive sensor has gained significant popularity among these methods and has been extensively utilized. fluid properties have a substantial impact on the performance of capacitance sensors. factors such as density pressure and temperature can introduce significant errors in void fraction measurements. one approach to address this issue is a meticulous and laborious routine calibration process. in the current study an artificial neural network  ann  was developed to accurately assess the proportion of gas in a biphasic fluid motion irrespective of variations in the fluid phase form or variations eliminating the need for frequent recalibration. to achieve this objective novel combined capacitance based sensors were specifically designed. the sensors were simulated by employing the comsol multiphysics application. the simulation encompassed five distinct liquids  oil diesel fuel gasoline crude oil and water. the input for training a multilayer perceptron network  mlp  came from data gathered through comsol multiphysics simulations for estimating the percentage of gas content of an annular two phase fluid with a specific liquid form. the matlab software was utilized to construct and model the proposed neural network. the utilization of the novel and precise apparatus for measuring the intended mlp model demonstrated the ability to prognosticate the volume percentage with a mean absolute error  mae  of 0.004.", "Doi": "10.1109/ACCESS.2023.3340127", "Key Words": ["ring-type electrode", "trflc electrode", "concave-type electrode", "multiphase flow", "annular flow", "artificial intelligence", "capacitive sensor", "sensitivity"]}