{"Title": "UxV-Based Deep-Learning-Integrated Automated and Secure Garbage Management Scheme Using Blockchain", "Doi": "10.1109/JIOT.2022.3156617", "Authors": ["m. masuduzzaman", "t. rahim", "a. islam", "s. y. shin"], "Key Words": ["blockchain", "deep learning (dl)", "multiaccess edge computing (mec)", "quality of service (qos)", "unmanned aerial vehicle (uav)"], "Abstract": "this article presents a deep learning  dl  model integrated automated and secure garbage management scheme using unmanned any vehicle  uxv  to minimize the human effort in terms of the traditional garbage management system. different kinds of uxv  unmanned aerial vehicles automated guided vehicles unmanned surface vehicles unmanned underwater vehicles etc.  are utilized to establish an automated garbage management scheme to collect and place the garbage both from the ground and sea surfaces. however due to the limited battery capacity and inadequate resources of different uxv a lightweight dl model is developed to detect the garbage successfully with a higher accuracy rate. the proposed lightweight dl model uses two activation functions named mish and rectified linear unit to enhance the feature extraction and detect the garbage. moreover a multiaccess edge computing  mec  server is allocated in the proposed scheme to improve the quality of service  qos   i.e. reduce latency and improve security . furthermore a blockchain based secure hazardous garbage  e.g. infectious toxic or radioactive materials  tracking technique is concluded in this scheme to identify the individual and reduce the potential harm to the environment. experimental results demonstrate that the uxv can successfully detect the garbage using the proposed lightweight dl model within a minimum time frame and the obtained accuracy is higher than the other existing dl models. besides qos has been investigated to verify the efficacy of the proposed scheme. finally a private blockchain network is established to demonstrate the performance of the proposed hazardous garbage tracking technique.", "Pub Date": "2023-04-06"}