{"Title": "VFogSim: A Data-Driven Platform for Simulating Vehicular Fog Computing Environment", "Doi": "10.1109/JSYST.2023.3286329", "Authors": ["√ñ. u. akg√ºl", "w. mao", "b. cho", "y. xiao"], "Key Words": ["capacity planning", "cellular networks", "mobile computing", "systems simulation", "vehicular and wireless technologies"], "Abstract": "edge fog computing is a key enabling technology in 5g and beyond for fulfilling the tight latency requirements of emerging vehicle applications such as cooperative and autonomous driving. vehicular fog computing  vfc  is a cost efficient deployment option that complements stationary fog nodes with mobile ones carried by moving vehicles. to plan the deployment and manage the vfc resources in the real world it is essential to consider the spatiotemporal variations in both demand and supply of fog computing capacity and the tradeoffs between achievable quality of services and potential deployment and operating costs. the existing edge fog computing simulators such as ifogsim iotsim and edgecloudsim cannot provide a realistic technoeconomic investigation to analyze the implications of vfc deployment options due to the simplified network models in use the lack of support for fog node mobility and limited testing scenarios. in this article we propose an open source simulator vfogsim that allows real world data as input for simulating the supply and demand of vfc in urban areas. it follows a modular design to evaluate the performance and cost efficiency of deployment scenarios under various vehicular traffic models and the effectiveness of the diverse network and computation schedulers and prioritization mechanisms under user defined scenarios. to the best of our knowledge our platform is the first one that supports the mobility of fog nodes and provides realistic modeling of vehicle to everything in 5g and beyond networks in the urban environment. furthermore we validate the accuracy of the platform using a real world 5g measurement and demonstrate the functionality of the platform taking vfc capacity planning as an example.", "Pub Date": "2023-08-30"}