{"Title": "Virtual Reality Telepresence: 360-Degree Video Streaming with Edge-Compute Assisted Static Foveated Compression", "Doi": "10.1109/TVCG.2023.3320255", "Authors": ["x. huang", "j. riddell", "r. xiao"], "Key Words": ["360-degree video", "virtual reality", "telepresence"], "Abstract": "real time communication with immersive 360¬∞ video can enable users to be telepresent within a remotely streamed environment. increasingly users are shifting to mobile devices and connecting to the internet via mobile cellular networks. as the ideal media for 360¬∞ videos some vr headsets now also come with cellular capacity giving them potential for mobile applications. however streaming high quality 360¬∞ live video poses challenges for network bandwidth particularly on cellular connections. to reduce bandwidth requirements videos can be compressed using viewport adaptive streaming or foveated rendering techniques. such approaches require very low latency in order to be effective which has previously limited their applications on traditional cellular networks. in this work we demonstrate an end to end virtual reality telepresence system that streams ‚àº6k 360¬∞ video over 5g millimeter wave  mmw  radio. our use of 5g technologies in conjunction with mobile edge compute nodes substantially reduces latency when compared with existing 4g networks enabling high efficiency foveated compression over modern cellular networks on par with wifi. we performed a technical evaluation of our system visual quality post compression with peak signal to noise ratio  psnr  and fovvideovdp. we also conducted a user study to evaluate users' sensitivity to compressed video. our findings demonstrate that our system achieves visually indistinguishable video streams while using up to 80% less data when compared with un foveated video. we demonstrate our video compression system in the context of an immersive telepresent video calling application.", "Pub Date": "2023-11-02"}