{"Title": "Virtual Reality English Intelligent Translation System Based on Multi-Sensor Data", "Doi": "10.1109/ICDSI60108.2023.00011", "Authors": ["z. wang", "s. wang", "m. niu"], "Key Words": ["sensor data", "vr", "english intelligent translation", "chinese-english parallel corpus"], "Abstract": "at its annual conference on may 8 2018 google unveiled the google assistant an ai that passes the turing test and can converse with real people without any lag or logical errors while also understanding them. the google assistant can help people order food book travel arrangements and more. today ai translation has no errors in basic grammar has become more logical and some software can even combine context and the results of human translation are no different. communication between speakers of different languages is increasing as global economic integration deepens and there are many opportunities for mt on the market. ai translation has widespread commercial applications and a sizable market but also uses language as a link radiates widely and drives economic cultural and other all round exchanges. however the existing english intelligent translation system  its  has obvious shortcomings such as slow speed low translation accuracy and large translation error. this text proposes a new english its  virtual reality  vr  english its in view of multi sensor data  msd . the vr english its in view of msd proposed in this text has improved the blue scores of three types of sentences. among them the score of complex sentences increased by 50.7%. this text compares the decoding translation method given tree translation method  labeled method a  and the decoding machine english translation method given forest translation method  labeled method b  with the vr english intelligent translation method in view of msd  labeled method c  proposed in this text. the experimental results show that the vr english intelligent system in view of msd has the highest score 48.9 points.", "Pub Date": "2024-04-02"}