{"Title": "Visualizing the Behavior of Learning European Portuguese in Different Regions of the World Through a Mobile Application", "Doi": "10.1109/ACCESS.2023.3324390", "Authors": ["l. m. hoi", "y. sun", "w. ke", "s. k. im"], "Key Words": ["conjugator", "covid-19 pandemic", "data visualization", "diz l√°!", "european portuguese", "learning patterns", "mobile-assisted language learning", "second language acquisition", "self-determination theory", "star schema data model"], "Abstract": "this study explores the ‚äúdiz l√° ‚äù mobile application an innovative tool released in 2018 that aims to enable users especially chinese speakers to learn portuguese. this mobile application harnesses the principles of mobile assisted language learning  mall  and self determination theory  sdt  facilitating continued language education amid the covid-19 pandemic. our research exploits user habits reflected in more than five years of data to build multi dimensional models for visualizing large datasets with a focus on learning patterns related to verb conjugation. insights reveal that most users are language school students from macao china and portuguese speaking counties regions with a remarkable preference for learning portuguese verb conjugations. the research results also show that people like to learn verbs for comparison. notably despite the pandemic an upward trend was observed in the learning of these conjugations. our findings offer crucial implications for the design of pedagogical strategies and refinement of language learning  mall  apps highlighting areas of difficulty and learner preferences. we also used machine learning  ml  technologies to create a predictive model to recommend relevant learning materials to users. as a result this study stands at the intersection of technology enhanced language learning and educational research demonstrating how they can synergistically contribute to optimizing language learning outcomes.", "Pub Date": "2023-10-19"}