{"Title": "Visual Place Recognition for Opposite Viewpoints and Environment Changes", "Authors": ["p. li", "s. wen", "c. xu", "t. z. qiu"], "Pub Date": "2024-01-22", "Abstract": "human beings possess a remarkable capability for visual scene understanding due to the inherent hardwiring of our brain‚äôs visual system. this allows us to effortlessly recognize a place even when approaching it from the opposite direction without the need to physically turn around. however replicating this ability in autonomous vehicles or robots a field known as visual place recognition  vpr  presents significant challenges. in the case of front‚äìfront vpr the primary challenges revolve around changes in appearance and lighting conditions. however for front‚äìrear vpr an additional complex issue arises as a substantial portion of the visual field does not overlap between two opposing scenes. in this research article we propose an innovative pipeline for addressing the front‚äìrear vpr problem using the vector of locally aggregated descriptors  vlad . in the coarse matching stage we use a combination of two complementary descriptors. one descriptor captures the scene‚äôs semantics while the other calculates the utility of clusters based on appearance. we then use clusters with high utility to construct a novel local image descriptor known as l netvlad. in addition we use a sequence matching method for contrastive learning on these descriptors to compute distances and optimize their performance. for the fine matching stage we implement a double filtering approach for keypoints using available semantic information to further refine and eliminate incorrect keypoint correspondences. our experiments on various benchmark datasets demonstrate the robustness and high accuracy of our method in tackling all the aforementioned challenges.", "Doi": "10.1109/TIM.2024.3350152", "Key Words": ["compact structure", "environment changes", "l-netvlad", "opposite viewpoints", "visual place recognition (vpr)"]}