{"Title": "Wireless IoT Monitoring System in Hong Kong‚ÄìZhuhai‚ÄìMacao Bridge and Edge Computing for Anomaly Detection", "Doi": "10.1109/JIOT.2023.3300073", "Authors": ["x. wang", "w. wu", "y. du", "j. cao", "q. chen", "y. xia"], "Key Words": ["anomaly detection", "edge computing", "internet of things (iot)", "source-free domain adaptation", "structural health monitoring (shm)"], "Abstract": "the emergence of the internet of things  iot  has facilitated the development and usage of low computational microcontrollers at the edge of the network which process data in the proximity of data sources and thereby offload the pressure of data transmission. recently iot is becoming a key technology for structural health monitoring  shm  systems. this study designs a novel wireless iot monitoring system for the hong kong‚äìzhuhai‚äìmacao bridge the world longest sea crossing bridge. the 5g technology and edge computing are integrated to improve the system performance in sensor serviceability data transmission time synchronization and data quality control. the artificial intelligent  artificial intelliegence  algorithm is embedded into the nvidia xavier nx edge computing boards to preliminarily detect data anomalies caused by sensor faults before uploading the massive data to the cloud platform. as training artificial intelliegence models requires a large amount of labeled data and is always time consuming a novel data anomaly detection method is developed by transferring the model trained from the other bridge to the target bridge. given that prestoring source data in edge devices consumes expensive storage resources the source free domain adaptation is developed by integrating the robust self training mechanism and self knowledge distillation strategy. thus the model transfer is achieved cross bridges in the absence of source data. this study provides a valuable and practical reference for developing a wireless iot shm system for large scale infrastructure and enabling edge computing for data anomaly detection with high efficiency and accuracy.", "Pub Date": "2024-01-24"}