{"Title": "Workload Orchestration in Multi-Access Edge Computing Using Belief Rule-Based Approach", "Doi": "10.1109/ACCESS.2023.3326244", "Authors": ["m. n. jamil", "m. s. hossain", "r. u. islam", "k. andersson"], "Key Words": ["multi-access edge computing (mec)", "task offloading", "workload orchestrator", "belief rule base (brb)", "performance evaluation"], "Abstract": "multi access edge computing  mec  is a standard network architecture for edge computing which is proposed to handle enormous computation demands from emerging resource intensive and latency sensitive applications and services as well as accommodate quality of service  qos  requirements for ever growing users through computation offloading. since the demand of end users is unknown in a rapidly changing dynamic environment processing offloaded tasks in a non optimal server can deteriorate qos due to high latency and increasing task failures. in order to deal with such a challenge in mec a two stage belief rule based  brb  workload orchestrator is proposed to distribute the workload of end users to optimum computing units support strict qos requirements ensure efficient utilization of computational resources minimize task failures and reduce the overall service time. the proposed brb workload orchestrator decides the optimal execution location for each offloaded task from user equipment  ue  within the overall mec architecture based on network conditions computational resources and task requirements. edgecloudsim simulator is used to conduct comprehensive simulation experiments for evaluating the performance of the proposed brb orchestrator in contrast to four workload orchestration approaches from the literature with different types of applications. based on the simulation experiments the proposed workload orchestrator outperforms state of the art workload orchestration approaches and ensures efficient utilization of computational resources while minimizing task failures and reducing the overall service time.", "Pub Date": "2023-10-30"}