{"Title": "Zero-Value Filtering for Accelerating Non-Profiled Side-Channel Attack on Incomplete NTT-Based Implementations of Lattice-Based Cryptography", "Authors": ["t. tosun", "e. savas"], "Pub Date": "2024-02-12", "Abstract": "lattice based cryptographic schemes such as crystals kyber and dilithium are post quantum algorithms selected to be standardized by nist as they are considered to be secure against quantum computing attacks. the multiplication in polynomial rings is the most time consuming operation in many lattice based cryptographic schemes which is also subject to side channel attacks. while ntt based polynomial multiplication is almost a norm in a wide range of implementations a relatively new method incomplete ntt is preferred to accelerate lattice based cryptography especially on some computing platforms that feature special instructions. in this paper we present a novel efficient and non profiled power em side channel attack targeting polynomial multiplication based on the incomplete ntt algorithm. we apply the attack on the crystals dilithium signature algorithm and crystals kyber kem. we demonstrate that the method accelerates attack run time when compared to the existing approaches. while a conventional non profiled side channel attack tests a much larger hypothesis set because it needs to predict two coefficients of secret polynomials together we propose a much faster zero value filtering attack  zv fa  which reduces the size of the hypothesis set by targeting the coefficients individually. we also propose an effective and efficient validation and correction technique employing the inverse ntt to estimate and modify the mispredicted coefficients. our experimental results show that we can achieve a speed up of  ${1915}\\times $ over brute force.", "Doi": "10.1109/TIFS.2024.3359890", "Key Words": ["post-quantum cryptography", "side-channel attack", "correlation power analysis", "multivariate mutual information analysis", "crystals dilithium", "crystals kyber"]}